[
  {
    "id": "10-things-i-hate-about-you-1999",
    "title": "10 Things I Hate About You",
    "releaseDate": "1999-01-01",
    "genres": [
      "Coming-of-age",
      "Comedy",
      "Drama"
    ],
    "rating": 6.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens",
    "rewatchability": "1h30, not too memorable, but funny",
    "bestCharacterWinner": "TBD",
    "review": "Pretty solid popcorn flick. There are some decent laughs here, and characters like Kat (Julia Stiles) are pretty iconic, so that’s good. Cameron (Joseph Gordon-Levitt) is the most consistently likable character, but Patrick is cool enough to give him the win here. Most of the other characters are pretty annoying (high school movie, so not really surprising) and the plot does complicate itself a little too much, but the 90s comedy is still more entertaining than most of what is put out today. Pretty cookie-cutter plot, to the point where I could probably have guessed the entire script in broad strokes just from the IMDb synopsis, but the individual moments work together to make it stand out from all the other 90s high-school rom-coms out there. Speech at the end is not bad, I guess, and the massive song is setting the bar way too high for promposals. Also I find it weird how Bianca (Larisa Oleynik) just kisses Cameron and he stops thinking she’s awful, but whatever works, I guess.",
    "reviewDate": "2024-01-15",
    "tmdbId": 4951
  },
  {
    "id": "21-jump-street-2012",
    "title": "21 Jump Street",
    "releaseDate": "2012-01-01",
    "genres": [
      "Comedy"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teenagers, probably",
    "rewatchability": "Once a month if you want, it’s not really that deep",
    "bestCharacterWinner": "TBD",
    "review": "Funny bro-cop movie with heart. Jonah Hill and Channing Tatum have pretty good chemistry, and their characters are pretty naturally funny, so it’s definitely just a good funny movie to watch. The hallucination scenes had me proper laughing, and the supporting cast is cool too. Ice Cube, Rob Riggle, and Dakota Johnson (obviously super good looking) are good comedic sides, but Brie Larson was the most impressive actor here. After all the bad press she’s been getting (after Captain Marvel) it was good to see that she’s actually charming and a great actor. Anyway, the way the movie made fun of most of the modern school stereotypes is cool, and overall it’s a good all-nighter popcorn flick.",
    "reviewDate": "2024-01-15",
    "tmdbId": 64688
  },
  {
    "id": "22-jump-street-2014",
    "title": "22 Jump Street",
    "releaseDate": "2014-01-01",
    "genres": [
      "Comedy"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teenagers, probably",
    "rewatchability": "Once a month if you want, it’s not really that deep",
    "bestCharacterWinner": "TBD",
    "review": "They pretty much made as many connections to the original themselves, so that doesn’t leave much to go over. They switched out Brie Larson for Amber Stevens West and gave Ice Cube a bigger part this time around. Dave Franco’s cameo was hilarious, and ofc the chemistry between the leads was still the thing that made the movie. I did see this like a month before going to college, so I was totally scarred by the experience, even after considering that it was Hollywood college. So thanks for re-condemning frats in my eyes, movie. Still, it’s funny, and the lambo gag was fun. The football plotline wasn’t really too funny for me though.",
    "reviewDate": "2024-01-15",
    "tmdbId": 187017
  },
  {
    "id": "42-2013",
    "title": "42",
    "releaseDate": "2013-01-01",
    "genres": [
      "Hollywood",
      "Action?"
    ],
    "rating": 7.8,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Baseball fans",
    "rewatchability": "2h, great acting",
    "bestCharacterWinner": "TBD",
    "review": "I don’t even like baseball, but man, Chadwick Boseman is THE man. The dignity with which he plays Robinson (who I really respect now, too) is what makes this movie. The “underdog” story of fighting racism in sport progresses terribly fluently with a likable protagonist and a charismatic supporting cast of Mr. Rickey (Harrison Ford), Rachel Robinson (Nicole Beharie), and Wendell (Andre Holland), alongside the many entertaining Dodgers teammates. Music is great, costumes and direction, and even the accents compliment the overall reality of the scenes and the threats that Jackie faced. Pee-Wee (Lucas Black) said it best, “Maybe one day we’ll all wear 42.” They do now.",
    "reviewDate": "2024-01-15",
    "tmdbId": 109091
  },
  {
    "id": "5-centimeters-per-second-2007",
    "title": "5 Centimeters per Second",
    "releaseDate": "2007-01-01",
    "genres": [
      "Romance",
      "Coming-of-age",
      "Anime"
    ],
    "rating": 7.9,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Older teens, unmarried adults",
    "rewatchability": "It’s really serious, and more of a one-time experience",
    "bestCharacterWinner": "TBD",
    "review": "I’m pretty sure Makoto Shinkai is my favorite director. Everything he does just ends me. And even though this movie (if you want to call it that - it’s really three chapters) is formally listed as a “romance drama”, I really think it’s more realistic than most of the romance movies I’ve seen. I mean this straight up broke my heart, “500 days of summer” style. I’m relatively naive, so I haven’t completely given up on love (like Takaki), so pretty much everything he does hits REALLY hard. His relationship with Akari (Yoshimi Kondou) from the time they’re kids to adults is the focus of the movie, and that’s really all you need to know. It’s visually beautiful (as usual) and the visual storytelling is wonderful for both insightful and casual viewers. My only issue was that it’s plot didn’t have too many events, and maybe a longer runtime might have helped with that. But for what it is, it’ll definitely give you something to think about. Warning though, it might break your heart.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "That end scene. WHY DOES SHINKAI KEEP DOING THIS? Killed my heart to see that there was no one behind that train. But I guess that’s what the movie was about - relationships fade. Love fades, if you allow it to. Killed me. Takaki being emotionally unavailable around Kanae also hit home. And knowing that Akari got married without Takaki even knowing… my heart hurts even now. Love is hard, man. So yeah, Shinkai does it again. I don’t really know why they spent all that time focusing on Kanae’s family and sister and stuff, but there must be some reason. Also apparently the falling cherry blossom petals are a metaphor for relationships growing apart with time? Mad. I really liked the callback though, it was cute.",
    "tmdbId": 38142
  },
  {
    "id": "a-few-good-men-1992",
    "title": "A Few Good Men",
    "releaseDate": "1992-01-01",
    "genres": [
      "Drama",
      "Hollywood"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, people who like 90s movies",
    "rewatchability": "Once a month if you want",
    "bestCharacterWinner": "TBD",
    "review": "Apparently Tom Cruise made lots of adrenaline movies in the 90s. Maybe a movie about lawyers doesn’t sound too exciting, but Colonel Jessup (Jack Nicholson) is always a scary villain, and Cruise is awesome as a witty lead. Demi Moore’s Lt. Galloway has great chemistry with Cruise, and is a strong female character, and Kevin Bacon and Keifer Sutherland are a good supporting cast. Music is pretty good too.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Of course, this movie is HELLA quotable, particularly the end court scene - “YOU CANT HANDLE THE TRUTH” and “You’re under arrest you son of a bitch.” Mega boss moves.",
    "tmdbId": 881
  },
  {
    "id": "a-silent-voice-2016",
    "title": "A Silent Voice",
    "releaseDate": "2016-01-01",
    "genres": [
      "Coming-of-age",
      "Romance",
      "Drama",
      "Anime"
    ],
    "rating": 8.9,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Teens, for sure",
    "rewatchability": "It’s 2h, and quite emotional",
    "bestCharacterWinner": "TBD",
    "review": "The number of times I yelled at the screen… this movie is OUTRAGEOUS. There’s tugging at the heartstrings, and then there’s ripping them out. Violently. Take a guess which one this movie chooses. There’s so much tragedy in each character’s mind that you don’t know who to hate and when (lesson: kids suck). The director, Naoko Yamada, does a great job with motifs and visual storytelling for Ishida’s (Miyu Iruno) character. His relationship with the other characters in school, mainly the deaf Nishimiya, is the main plot of this movie. But it is TRAGIC. Not in the Julius Caesar way, but in a really psychologically probing way. The animation is great, the voice acting is wonderful (especially for the Winner) and the plot is something that no one should miss out on. The entire ensemble of characters, Yuzuru (Ao Yuki), Ueno (Yuki Kaneko), Nagatsuka (Kensho Ono), Kawai (Megumi Han), and Sahara (Yui Ishikawa) all represent distinct types of people with real flaws, making the movie hit home to that many more people. The parents, especially Nishimiya’s mom (Akiko Hiramatsu) and Ishida’s mom (Satsuki Yurino) have such devastating reactions to the events in the movie as well. Definitely important to watch, if you’re prepared to understand many complex characters. And if you’re like me, you’ll definitely appreciate the messages about the unseen struggles that deaf people endure - I’m going to try and learn ASL as soon as possible.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The first 20 minutes of the movie? I was absolutely ready to SHOOT THOSE KIDS. I’m not a fan of kids as it is, but when Nishimiya’s ears started bleeding, I was going to throw hands. It took me almost the whole movie to forgive Ishida. But kids are going to be horrible, right? So it made sense. And that’s why I was that much angrier at Ueno when she started messing with Nishimiya when they were older. And Kawai’s random outbursts? Loathing. The number of suicide attempts in this movie, too… it’s definitely an important thing to recognize the reactions of the family and friends. So yeah, not the most rewatchable movie, not the most consistently comfortable, but it’s powerful and has a great message.",
    "tmdbId": 378064
  },
  {
    "id": "a-star-is-born-2018",
    "title": "A Star is Born",
    "releaseDate": "2018-01-01",
    "genres": [
      "Drama",
      "Hollywood",
      "Romance"
    ],
    "rating": 7.3,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like musicals, realistic dramas, and mature romance movies",
    "rewatchability": "It’s 2h15, and LONG, but the songs definitely keep it fresh",
    "bestCharacterWinner": "TBD",
    "review": "I feel like this movie was just a great opportunity for everyone to show off their skills. Lady Gaga was awesome at flexing her voice, as well as her emotional acting, and Bradley Cooper as Jackson Maine was definitely a really cool deuteragonist. They had great chemistry, and Cooper’s directing was really complimentary to stressing the emotional instability of both of the main characters. Bobby (Sam Elliot) was definitely a good emotional backup to Jackson’s story, Ramon (Anthony Ramos) was funny, and Rez (Rafi Gavron) played a vital role in delving into the effects of going into showbusiness and the kind of people who have influence over artists’ creativity. Shallow is the highlight, of course, just an absolute great song, and I’m glad that they used it so well in the movie. The intimacy between Ally and Jackson was really unique and personal, and Jackson’s drinking issues were definitely a factor in everything that happened. The ending wasn’t bad, but they did manage to capitalize on the opportunity to be idealistic with the quotes.",
    "reviewDate": "2024-01-15",
    "tmdbId": 332562
  },
  {
    "id": "ae-dil-hai-mushkil-2016",
    "title": "Ae Dil Hai Mushkil",
    "releaseDate": "2016-01-01",
    "genres": [
      "Drama",
      "Romance",
      "Hindi"
    ],
    "rating": 7.6,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Hindi movie fans, romance drama fans",
    "rewatchability": "2h30, so definitely only like once in a couple years",
    "bestCharacterWinner": "TBD",
    "review": "I don’t know what it is about unrequited love that makes for just the most dramatic stories, but it seems to be working its magic here as well. Ayan (Ranbir Kapoor) is actually a really relatable hero in the sense that he’s really vulnerable, and his chemistry with Alizeh (Anushka Kapoor) was so strong in the first half of the movie that I couldn’t help but feel a strong attraction to her myself. Saba (Aishwarya Rai) and Ali (Fawad Khan) were the supporting cast, and I thought Rai did a pretty great job, but Shah Rukh Khan’s one-scene cameo absolutely stole the show, his lines completely summing up what the movie was about. The dialogue is actually great for the most part, particularly the banter between the characters and the poetry-type scenes. Obviously, music was great, especially the wedding scene. Theme-wise this movie was also really mature, and I was glad that it didn’t have any gimmicky elements that were a staple of this genre. Definitely a solid effort all around.",
    "reviewDate": "2024-01-15",
    "tmdbId": 393445
  },
  {
    "id": "alien-1979",
    "title": "Alien",
    "releaseDate": "1979-01-01",
    "genres": [
      "Sci-Fi",
      "Horror"
    ],
    "rating": 6.4,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "70s and 80s kids who like sci-fi",
    "rewatchability": "Probably wouldn’t",
    "bestCharacterWinner": "TBD",
    "review": "Yeah, I don’t even know. It took me 3 days to watch this, which is crazy, since I can actually watch 3 movies a day. But yeah, it’s got suspense. And aliens. And blood. The pacing is weird, the characters (with the exception of Ripley) are forgettable, the lighting is awful (like really dark, I swear I couldn’t see anything), and the plot is really slow. Sure, there was a lot of set detail for 1979, but the story wasn’t much more than “there are aliens”. Still, the end scene got a reference in Avengers Infinity War, and there were a few dramatic scenes here and there, so I’ll give it a pass.",
    "reviewDate": "2024-01-15",
    "tmdbId": 348
  },
  {
    "id": "angels-and-demons-2009",
    "title": "Angels and Demons",
    "releaseDate": "2009-01-01",
    "genres": [
      "Action",
      "Drama",
      "Thriller"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Not kids, maybe not super conservative Christians",
    "rewatchability": "Once a year, max",
    "bestCharacterWinner": "TBD",
    "review": "Dan Brown is such a beast that I feel guilty rating these movies, because they’re just so impressive. The elements that he incorporates from history and religion are recognizable to the layman and are iconic references to those who are familiar with them. Not only the plot, but the characters in this movie are also quite fleshed out. Robert Langdon (Tom Hanks), Vittoria Vetra (Ayelet Zurer), Commander Richter (Stellan Skarsgard), and the Camerlengo were all main character material, with compelling moments and characteristics that made them all relevant to the plot. Even the Assassin’s (Nikolaj Lie Kaas) character was shockingly honourable. The music and pacing used to hold the audience in and create suspense are probably the best aspects of these movies, and you’ll definitely learn something that you didn’t know before.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Not exactly sure how they collected antimatter, but sure. The whole elemental part of the mystery, with Earth, Air, Fire, and Water, was really cool to watch, especially when he was looking for historical connections to each. The map drawing to show symmetry and the initial message deciphering was really cool. Also the Camerlengo burning himself was so metal; the whole business with the helicopter was pretty cool too. The Assassin’s scenes were quite entertaining also.",
    "tmdbId": 13448
  },
  {
    "id": "arrival-2016",
    "title": "Arrival",
    "releaseDate": "2016-01-01",
    "genres": [
      "Sci-Fi",
      "Hollywood"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like sci-fi movies and Nolan-type films",
    "rewatchability": "2h, pretty interesting plot",
    "bestCharacterWinner": "TBD",
    "review": "So in terms of subject matter, this movie is definitely really awesome. Just the colours when Louise and Ian (Jeremy Renner) interact with the heptapods, with the camera angles and the tension in the score are awesome, and I liked the design of the aliens. Their language was probably the star of this movie, as was the characters’ conversation of language’s connection to cognition and how we as a species think because of how we communicate. Watching Louise teach the aliens and learn their language was really cool to watch as time went on, and the world powers’ reaction to the situation looked pretty reasonable (unfortunately for us in the real world). Still, the ending moral of the movie was strong and had a sense of promise, even with some possible tragedy that needs to be embraced. Colonel Weber (Forest Whitaker) was surprisingly supportive, even if I felt Ian didn’t really do that much.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So the “offer weapon” thing was a really cool scene, and her figuring out it was actually a gift, and that she could look into the future, was really nice. The way they showed her using this power to influence what’s going on, especially with General Sang (Tzi Ma), was cool. And then the big reveal of her daughter actually being in the future and dying from an incurable disease, but her still choosing to go through with it was definitely something, although I didn’t care too much about the daughter. It was pretty sad watching the world stop talking to each other, and quite annoying when the podcasters were criticizing everything for no reason, but it was accurate.",
    "tmdbId": 329865
  },
  {
    "id": "austin-powers-international-man-of-mystery-1997",
    "title": "Austin Powers: International Man of Mystery",
    "releaseDate": "1997-01-01",
    "genres": [
      "Action",
      "Comedy"
    ],
    "rating": 6.8,
    "classRecommendation": "Guilty Pleasure",
    "intendedAudience": "Adults, teens",
    "rewatchability": "Might get on your nerves if you keep watching consistently",
    "bestCharacterWinner": "TBD",
    "review": "This movie is a meme, by all means, and is so frustrating to sit through, but it IS funny. Full credit to Mike Myers for playing both Austin Powers and Dr. Evil (I seriously didn’t catch this, somehow). They make fun of all the spy movie cliches, which is where Vanessa (Elizabeth Hurley) comes in, and she’s also fairly good in this role. Everything is really, really over-the-top, but I don’t think it ever gets too slow, particularly on first viewing. The storyline with the son is pretty random, as are the female robots and the transitions with the band, and Austin’s teeth are just not nice to look at. Lots of randomness.",
    "reviewDate": "2024-01-15",
    "tmdbId": 816
  },
  {
    "id": "avengers-endgame-2019",
    "title": "Avengers: Endgame",
    "releaseDate": "2019-01-01",
    "genres": [
      "Action",
      "Superhero"
    ],
    "rating": 9.3,
    "classRecommendation": "Must Watch",
    "intendedAudience": "MCU fans and anyone vaguely connected to them (basically everyone not living under a rock)",
    "rewatchability": "Once a year",
    "bestCharacterWinner": "TBD",
    "review": "If you need to wrap up a saga of twenty-two interconnected movies spanning decades and galaxies, it’s hard to do it much better than the Russo brothers did with Endgame. With all the OG Avengers at center stage, all the favorites had a healthy amount of screentime with decent to excellent resolutions/continuations of their character arcs. Score was decent (can’t go wrong with Silvestri), even if it didn’t seem to match up to Infinity War’s. Pacing felt kind of inconsistent, but there’s a lot going on, so it’s forgivable to have rushed in places. Though there are some really powerful shots, overall the visuals weren’t quite as stunning as Infinity War’s. The cinematography felt average, and the color palette was more muted for no particularly good reason, especially during the third act, which could not have chosen a more boring place to happen. Humor was on point, and this movie brought in ALL THE FEELS. Ton of fan service, which is to be expected. Thanos is a far less interesting villain than in his last outing, and his power scaling is a little messed up, but he remains as intimidating as ever. Very rewarding watch, even if those without prior MCU knowledge will be a bit lost. The greatest danger here is overwatching, since Endgame is meant as the culmination of everything that came before it, so it doesn’t work as well without that emotional setup.",
    "reviewDate": "2024-01-15",
    "tmdbId": 299534
  },
  {
    "id": "baby-driver-2017",
    "title": "Baby Driver",
    "releaseDate": "2017-01-01",
    "genres": [
      "Action",
      "Thriller"
    ],
    "rating": 7.9,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "People who like action movies",
    "rewatchability": "Action, 2h, I’d say once in a couple months",
    "bestCharacterWinner": "TBD",
    "review": "Edgar Wright has some die-hard fans, and even though I’m not a savant, I definitely think his method of direction is fabulous in this movie. The biggest thing is the MUSIC. This movie is basically just all bangers. There was one bit that looked like a music lyrics video, but still somehow fit into the scene wonderfully. Wonderful. Made use of Baby’s ear trauma masterfully. Then there’s Debora (Lily James), who’s basically cinderella, and pairs really well with Ansel. The supporting cast of John Hamm, Eiza Gonzalez (who are great looking and I can’t believe she has 3 z’s in her name), Jamie Foxx, and Kevin Spacey, all pull their weight and make the movie engaging from start to finish. The pacing is pretty good, there’s some good comedy, a few glimpses of heart, and really really good action. That’s the selling point, and it definitely delivers.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Is it just me, or is Kevin Spacey just meant to be the villain? I totally expected him to be the villain. Anyway, I felt like the step-dad knowing USL was an interesting touch, and it was cool how Baby handled the ending with him. There were quite a lot of endings, and even though they were all pretty satisfying, they didn’t all make sense. Debora waiting five years, the police not arresting Debora with Baby, etc. Still, the ending was cool, and Lily James is awesome, so we’ll let it slide.",
    "tmdbId": 339403
  },
  {
    "id": "ballerina-2016",
    "title": "Ballerina",
    "releaseDate": "2016-01-01",
    "genres": [
      "Family",
      "Coming-of-age",
      "Animated"
    ],
    "rating": 7.4,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids",
    "rewatchability": "Maybe once a year is possible",
    "bestCharacterWinner": "TBD",
    "review": "Super underrated. Didn’t even know about this movie until my roommate recommended it to me, and I’m so glad that he did. The relationship between Felicie (Elle Fanning) and Victor (Dane DeHaan) is honestly one of the most charming animated movie kid pairings, and watching them contend against the world is really inspiring. I felt like Odette’s kindness and calm, motherly personality was just spectacular in contrast to the kids, and they fit extremely well together - so glad that she got her respect at the end. Camille LeHaut (Maddie Ziegler) and Rudolph (Tamir Kepallan) kept the narrative interesting too, even if the Mrs. LeHaut (Kate McKinnon) was totally cartoonishly crazy. Luteau (Mel Brooks) was also really heartwarming at the end - shows the power of a good dream. Movie is also called LEAP! But I think the international release is Ballerina, and I think this movie’s charm is its European influence, so that’s what I’ve chosen.",
    "reviewDate": "2024-01-15",
    "tmdbId": 342473
  },
  {
    "id": "beauty-and-the-beast-2017",
    "title": "Beauty and the Beast",
    "releaseDate": "2017-01-01",
    "genres": [
      "Family",
      "Romance",
      "Fantasy"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, probably",
    "rewatchability": "It’s a little slow at times, and 2h, so maybe only a couple times ever",
    "bestCharacterWinner": "TBD",
    "review": "Okay, I can’t think of a way to describe this that’s not “Not bad”. I’ve been an Emma Watson fan for a while (like most other fantasy-loving kids) and it’s good to see that she does a good job acting in this movie. Unfortunately, there really isn’t much for her to do in this role (or in most roles in this movie, honestly). Everyone was par, is what I feel like. The beast (Dan Stevens) was a pretty cool character, but the supporting cast really stole the show, especially Lumiere and Cogsworth (Ian McKellen), who have hilarious banter, and LeFou (Josh Gad), who’s great comic relief. Gaston (Luke Evans) is really just the worst, and I didn’t really feel the movie’s heart too much, unfortunately. It’s cool that she likes books, though. And the songs and outfits and nice.",
    "reviewDate": "2024-01-15",
    "tmdbId": 321612
  },
  {
    "id": "bee-movie-2007",
    "title": "Bee Movie",
    "releaseDate": "2007-01-01",
    "genres": [
      "Family",
      "Comedy",
      "Animated"
    ],
    "rating": 7.4,
    "classRecommendation": "Guilty Pleasure",
    "intendedAudience": "Kids, adults with kids",
    "rewatchability": "Meme, so constantly",
    "bestCharacterWinner": "TBD",
    "review": "So the thing is, this movie is weird, but it’s funny. Barry (Jerry Seinfeld) is just such a bee version of Seinfeld, and his humour was just great for me. Seinfeld writes and delivers really well here too. Then Adam is Matthew Broderick, which is an instant bonus (I’m a bit of a superfan). Still, Barry’s relationship with Vanessa is just so absurdly funny to watch, and it’s arguably even funnier to watch the other characters react in outrage to the two of them - particularly Ken (Patrick Warburton). There’s so many little pop-culture inserts with Chris Rock as a mosquito, Larry King as himself, Ray Liotta as himself, etc. But the message of the movie is actually still decently meaningful in that it expresses the importance of bees’ existence to our ecosystems. They do slip in a bunch of pretty interesting bee facts too.",
    "reviewDate": "2024-01-15",
    "tmdbId": 5559
  },
  {
    "id": "before-sunrise-1995",
    "title": "Before Sunrise",
    "releaseDate": "1995-01-01",
    "genres": [
      "Romance",
      "Hollywood"
    ],
    "rating": 7.1,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens, adults",
    "rewatchability": "Probably once ever",
    "bestCharacterWinner": "TBD",
    "review": "Vienna is really nice. Super commercial for it. Also, this movie is basically 1h45 of two people talking, and it’s entirely carried by the chemistry between Jesse and Celine (Julie Delpy). It’s really cute, basically. It’s a date movie. The premise is some kind of meet-cute and a one-off wonderful night between two people. There isn’t really anything groundbreaking, but it’s just two attractive actors talking for a couple hours. Cinematography, dialogue is all great - it actually looks like they might have improvised many of the conversations, because they were really really casual and automatic.",
    "reviewDate": "2024-01-15",
    "tmdbId": 76
  },
  {
    "id": "black-panther-2018",
    "title": "Black Panther",
    "releaseDate": "2018-01-01",
    "genres": [
      "Superhero",
      "Drama"
    ],
    "rating": 8.1,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "There’s some violence, so pretty much everyone above like 5",
    "rewatchability": "Didn’t seem too long, even at 2h 15m",
    "bestCharacterWinner": "TBD",
    "review": "There’s nothing like a good superhero movie villain, and Killmonger’s foil-like nature when compared to T'Challa made him perfect as the antagonist. That, and his stylish yet intense arrogance, coupled with a great character story, created one of the best superhero movie villains of yet. The rest of the cast did great as well (Chadwick Boseman, Letitia Wright, Danai Gurira, Martin Freeman, Andy Serkis, Forest Whitaker, Winston Duke, Angela Bassett, Lupita Nyong’o), with both Shuri and Okoye balancing amusing and endearing moments with T’Challa, with more dramatic instances. The soundtrack and the direction was exemplary, building into the urban/rural mystical world that they’ve built in Wakanda.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Despite the obvious nature of T’Challa’s return, its execution was conducted fairly well, giving M’Baku some character as well as giving T’Challa’s mother more depth. Bucky’s exclusion was probably a good idea, since the film focused on entirely new characters. Killmonger’s death and final scene with T’Challa was probably one of the best in the movie, showcasing both Jordan and Boseman’s acting abilities.",
    "tmdbId": 284054
  },
  {
    "id": "black-swan-2010",
    "title": "Black Swan",
    "releaseDate": "2010-01-01",
    "genres": [
      "Drama",
      "Horror",
      "Hollywood"
    ],
    "rating": 6.2,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Adults",
    "rewatchability": "Never",
    "bestCharacterWinner": "TBD",
    "review": "I swear to god I wasn’t expecting this movie to be so damn scary. Well it was. Straight up, I watched it in the night thinking it was some ballet movie and I had the shock of my life. This is the scariest shit I’ve seen to date, and best believe I’m not watching it again. Of course, there’s a lot of imagery with Nina and Lily and the White and Black Swans, and the whole play is fine. But between Nina’s being crazy and her mom being the weirdest person to live EVER, this movie makes me feel SO UNCOMFORTABLE. But if you like horror and being creeped out and the ballet, then I’m betting you’re going to love this.",
    "reviewDate": "2024-01-15",
    "tmdbId": 44214
  },
  {
    "id": "black-widow-2021",
    "title": "Black Widow",
    "releaseDate": "2021-01-01",
    "genres": [
      "Superhero",
      "Action"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Superhero movie fans",
    "rewatchability": "It’s 2h15, action and comedy, but not mindblowing",
    "bestCharacterWinner": "TBD",
    "review": "I feel like my expectations for this movie were just too high - I have been a bit starved of movie trips recently. I kept waiting for the third act to start, but the movie kinda just ended, so I felt a little unsatisfied. I don’t remember anything wrong about the movie per se, maybe the pacing, but Natasha (Scarlett Johansson) is cool as always and Yelena is an awesome new addition to the MCU. I like the familial dynamic between the girls, Melina (Rachel Weisz) and Alexei (David Harbour). Supporting cast of Ross (William Hurt) and Valentina (Julia Louis-Dreyfus). The plug Agent (O. T. Fagbenle) was funny, but the villains were a little meh. Taskmaster’s concept was cool, but I felt they misused Olga Kurylenko and misplayed the emotional stakes with the whole Budapest callback. Dreykov (Ray Winstone) was interesting, but his menacingness did evaporate way too quickly. The action itself was pretty good though, even if it’s difficult to believe they survive so many explosions and car crashes. Also this movie is almost entirely women, and it worked so well that nobody really noticed or made a big noise about it. People were comparing it to Captain Marvel, and this movie isn’t perfect, but it’s less forced, and its focus is rightly on Natasha and her bond with family.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The starting was definitely awesome, and it was great to see young Natasha and Yelena together with their fake parents. Their young actresses (Ever Gabo Anderson and Violet McGraw respectively) did really well too. My favourite part of the movie was probably the montage with a slow acapella Smells Like Teen Spirit (by Malia J, original by Nirvana). Really really dark scenes, but they were really hard-hitting. Definitely great backstory to Natasha’s character that we’ve only heard of. I found Dreykov’s whole pheromone thing really stupid, and Natasha’s severed nerve thing was arguably even worse - him dying fell pretty flat too. The scene at the end where she looks into the distance as Ross and his cars show up really confused me, since they were just trying to arrest her earlier, and she ends up totally fine. So that was a little wack. I also really wanted Captain America to show up at the end, so that was sad.",
    "tmdbId": 497698
  },
  {
    "id": "blade-runner-1982",
    "title": "Blade Runner",
    "releaseDate": "1982-01-01",
    "genres": [
      "Hollywood",
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 7.1,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, realistic future sci-fi enthusiasts",
    "rewatchability": "Probably have to watch it twice to understand",
    "bestCharacterWinner": "TBD",
    "review": "So this movie also doesn’t exactly have the right branding for new-comers. I thought this would be a normal dystopian thriller with a charismatic lead in Rick Deckard (Harrison Ford). But it’s really more in line with ethical, speculative science-fiction that isn’t as popular as you’d think. The movie is based around human-like androids called ‘replicants’ having escaped some prison/factory and Rick having to kill them (he’s a space policeman, which they call Blade Runner). So the message here is asking the audience what really differentiates the replicants from humans, if anything - especially given the characters’ vast repulsion with replicants. Roy, Pris (Daryl Hannah), and Rachael (Sean Young) all give great performances, and the end scene from Roy is easily the best and most pronounced scene in the movie. Pacing is pretty slow, and you really have to stick in there to last to the last 20 minutes (the good bit).",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So the big question is: Is Rick a replicant? Definitely the right way to go with the movie, and the only way to make this premise interesting. The unicorn motif - I honestly missed this - was a good storytelling device, and the rain speech at the end was wonderful. I just wished they wasted less time. Also Roy’s acting was great, but he kept doing really weird things for no reason (especially in the third act). The conversation between him and Tyrell (Joe Turkel) was good though.",
    "tmdbId": 78
  },
  {
    "id": "blade-runner-2049-2017",
    "title": "Blade Runner 2049",
    "releaseDate": "2017-01-01",
    "genres": [
      "Hollywood",
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 8.2,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Adults, mostly",
    "rewatchability": "Depends on preference",
    "bestCharacterWinner": "TBD",
    "review": "I’ll just say it—whoever thought it was a good idea to put Denis Villeneuve in charge of a Blade Runner movie was absolutely cooking with gas. 2049 takes the questions and themes put forward in the original and makes them feel fresh and—ironically, given the setting and protagonist—human in a way they couldn’t quite manage to be in the original. Visually it’s obviously a huge step up from 1982, and Hans Zimmer is about as close as you can get to a spiritual successor for Vangelis’s iconic score. K (Ryan Gosling) shows a ridiculous amount of subtlety in his performance given how stoic his character is supposed to be outwardly, and his holographic girlfriend Joi (Ana de Armas) was both an interesting concept and enjoyable to watch. Some scenes run a little long probably—Villeneuve’s Achilles heel seems to be that he’s a little too fond of chewing up the scenery longer than he really needs to—which makes the pacing a little weird in the middle.",
    "reviewDate": "2024-01-15",
    "tmdbId": 335984
  },
  {
    "id": "bohemian-rhapsody-2018",
    "title": "Bohemian Rhapsody",
    "releaseDate": "2018-01-01",
    "genres": [
      "Hollywood",
      "Drama"
    ],
    "rating": 7.3,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like Queen",
    "rewatchability": "Just for the songs, you could rewatch daily",
    "bestCharacterWinner": "TBD",
    "review": "Weeeee are the Champions, my friends. Freddie Mercury is Freddie Mercury, and there will never be another, but Rami Malek does a wonderful job capturing his enigmatic, charismatic personality. The Queen members Roger (Ben Hardy), John (Joseph Mazello), Brian (Gwilym Lee) and Mary-Austin (Lucy Boynton) were an amazing supporting cast, and Paul (Allen Leech) was utilized wonderfully in the narrative. But the SONGS. Guys, the songs. Sure, the backstory with Freddie’s parents is great for general knowledge and serves as a heartwarming ending, but LIVE AID. Watch till the end, is all I can say.",
    "reviewDate": "2024-01-15",
    "tmdbId": 424694
  },
  {
    "id": "booksmart-2019",
    "title": "Booksmart",
    "releaseDate": "2019-01-01",
    "genres": [
      "Coming-of-age",
      "Comedy"
    ],
    "rating": 9.2,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Solo works, but probably stick to friends so you can laugh out loud without feeling like a loser",
    "rewatchability": "A year, give or take",
    "bestCharacterWinner": "TBD",
    "review": "The movie lets you know right away that it’s not afraid to make you uncomfortable. It  was sorta dialing everything up to eleven, but a couple other moments also were a little too real, which really shouldn’t work but it really really does. Absolutely HILARIOUS, couple of characters are straight up iconic, and a couple of scenes had me almost laughing aloud on the plane. What made the movie for me was that everything, no matter how weird, always tied into the protagonists and their friendship (chemistry was ON POINT). Balances the humor and super emotional character moments really well, and the soundtrack definitely helped with that (standout: Slip Away by Perfume Genius).\n\nSpoilers: GIGI. Give this woman her own movie. Also, the Cardi B and not-really-cocaine moments were iconic. The hookup scene was def an L, but also pretty funny, so that works ig. Felt really bad for the panda, and Lisa Kudrow being Lisa Kudrow was great. I guess the kid with the car (idr his name) was kinda annoying, and Hope was forgettable ish (her relationship w/ Amy was not set up AT ALL, and she had no character except for being a sarcastic girl who’s actually nice on the inside. Wanted to like her, but nooooo.) The movie’s about the friendship though, not the love interests, so I’m okay with it.",
    "reviewDate": "2024-01-15",
    "tmdbId": 505600
  },
  {
    "id": "borat-subsequent-moviefilm-2020",
    "title": "Borat Subsequent Moviefilm",
    "releaseDate": "2020-01-01",
    "genres": [
      "Comedy",
      "Hollywood"
    ],
    "rating": 5.9,
    "classRecommendation": "Guilty Pleasure",
    "intendedAudience": "NOT KIDS",
    "rewatchability": "This one’s super specific to 2020, and works best as a one-off",
    "bestCharacterWinner": "TBD",
    "review": "Okay, so I was wrong - someone CAN beat Sacha Baron Cohen apparently. Watching this in 2020 is likely the only option here, and I feel like it manages to convey its political point fairly well without any direct exposition. It’s still weird as hell, and apparently these movies do shoot without scripted extras, so MASSIVE respect to them for being camera-worthy. My main issue with this is that I don’t know whether this is fiction or reality, which worries me a LOT. Otherwise, Tutar as a kid was hilarious, and she’s got a lot of heart that was a nice change-up from the first movie (although this one does borrow a LOT of elements from that one). And it goes without saying that it’s definitely a meme, because if it wasn’t, I don’t really know what I’d do with myself.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Big respect for the movie for actually crashing a Trump rally (with footage of Pence) and managing to get a real Rudy Guilliani interview. The whole COVID-19 plot was pretty funny in the end too. Once again, the religious scenes were the funniest (the church scene from the first one and the synagogue scene from this one) and there was a lot of heart from the women extras. I feel like the abortion scene was pretty funny too, since it was objectively a misunderstanding between the pastor and both of them.",
    "tmdbId": 740985
  },
  {
    "id": "borat-cultural-learnings-of-america-for-make-benefit-glorious-nation-of-kazakhstan-2006",
    "title": "Borat: Cultural Learnings Of America For Make Benefit Glorious Nation of Kazakhstan",
    "releaseDate": "2006-01-01",
    "genres": [
      "Comedy",
      "Hollywood"
    ],
    "rating": 5.7,
    "classRecommendation": "Guilty Pleasure",
    "intendedAudience": "Honestly no idea",
    "rewatchability": "Either never or every week",
    "bestCharacterWinner": "TBD",
    "review": "Okay, I think it’s impossible for Sacha Baron Cohen not to win in a movie that he stars in. That’s just how it works. But after watching, I can confidently say that I hope this never shows up on TV. Don’t get me wrong, it was obviously entertaining, and it definitely got more than a few laughs out of me, but a fair number of cringes as well. I decided to play it safe and slap it in the Meme, since I’m pretty confident that I’m not rewatching it, and Existent doesn’t do it justice. So yeah, definitely an experience. It’s like the Office meets Deadpool meets the Dictator. I don’t even think an R rating is enough. That said, movie-wise it’s got all the artistic chops - dialogue was memorable (“Ma name Borat”), shooting style was unique, and the plot was definitely something to behold. So yeah, entertaining as ever, but I’m definitely scarred by a lot of the scenes. Meme it is.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Ouch. Yeah, I feel that. I’m really sorry for all those explicit scenes, but if you watch these kinds of movies, I guess that’s a given. The slapstick is always funny, I guess. I didn’t really understand the kazakh, so that was a little meh. The main thing is that I felt like a lot of scenes were so well shot that I wondered if maybe they shot them without telling the extras - like the subway scene - but maybe that’s just me being naive. Either way, extras were phenomenal.",
    "tmdbId": 496
  },
  {
    "id": "brave-2012",
    "title": "Brave",
    "releaseDate": "2012-01-01",
    "genres": [
      "Family",
      "Coming-of-age",
      "Animated"
    ],
    "rating": 7.9,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, teens",
    "rewatchability": "Can do once a week if you want",
    "bestCharacterWinner": "TBD",
    "review": "“Touch the Sky” is one of the best songs I’ve heard in a WHILE. Disney don’t sleep. It’s such a pity that this movie gets slept on because of Frozen, but it’s actually a solid (very similar) story that’s totally watchable. I thought the over-ethnic scottishness would put me off, but Merida is kinda awesome. The parents, King Fergus (Billy Connoly) and Queen Elinor (Emma Thompson) were some of the best, most realistic parents I’ve seen in Disney movies, and the triplets were cool. All the bear scenes were pretty funny, and Merida overall is such a compelling protagonist. The story isn’t at all complicated, and the archery scene is pretty amazing. Animation is great too. Overall a solid movie.",
    "reviewDate": "2024-01-15",
    "tmdbId": 62177
  },
  {
    "id": "breakfast-at-tiffany-s-1961",
    "title": "Breakfast at Tiffany’s",
    "releaseDate": "1961-01-01",
    "genres": [
      "Hollywood",
      "Romance"
    ],
    "rating": 7.1,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like old movies, romance-type",
    "rewatchability": "It’s almost 2h, but I wouldn’t rewatch more than once - it’s more like an experience-type movie",
    "bestCharacterWinner": "TBD",
    "review": "Aaaaand I’m in love with Audrey Hepburn. What an absolute legend. Even if the movies she’s in aren’t all that amazing, her acting is always super entertaining. Holly’s basically some kind of female Ferris Bueller x Summer (500 days of Summer), so just existing makes her interesting. The nameless cat is hilarious, and shows really good writing in the end. The plot itself was pretty thin, and it’s easy to not like it, but there are loads of quotable lines from Hepburn. “Quelle night!” was super funny to me, but the monologues her character has are also super eloquent. Also the score for this movie is so iconic that I knew what it was without even knowing that I knew it. Still, Holly’s journey is definitely a struggle, and it’s good to watch once.",
    "reviewDate": "2024-01-15",
    "tmdbId": 164
  },
  {
    "id": "captain-america-the-first-avenger-2011",
    "title": "Captain America: The First Avenger",
    "releaseDate": "2011-01-01",
    "genres": [
      "Superhero",
      "Family"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like superhero movies",
    "rewatchability": "This is a classic type movie, so probably like once a couple months",
    "bestCharacterWinner": "TBD",
    "review": "This movie is 2h long, but it’s really an illusion. They have you in the first half an hour, when Steve first takes the serum, and then the last scene is payoff. Everything in between is very classic - you’ve seen it all before, and it’s worth watching again, but it won’t blow your mind. Still, the bar is pretty high, given the MCU’s reputation now. Evans pulls off Rogers in a way that isn’t appreciated nearly enough (for this movie at least), and it’s impossible not to root for him. He’s not as flashy as the other heroes, but nobody can’t like Cap. As for the supporting cast, Bucky (Sebastian Stan) has a wholesome relationship with Steve, Peggy (Hayley Atwell) is kindred spirit, Red Skull (Hugo Weaving) is an okay foil I guess, but Dr. Erskine (Stanley Tucci) would probably be runner-up in this movie - his role in the start is just so important to drawing the audience in. So there’s nazis and flags and stuff, and it’s a very nice hero’s journey to set up the Avengers.",
    "reviewDate": "2024-01-15",
    "tmdbId": 1771
  },
  {
    "id": "carol-2015",
    "title": "Carol",
    "releaseDate": "2015-01-01",
    "genres": [
      "Romance",
      "Drama"
    ],
    "rating": 8.5,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Older teens to adults",
    "rewatchability": "Not exactly light viewing—twice a year tops",
    "bestCharacterWinner": "TBD",
    "review": "As a bit of a skeptic towards romances, the fact that this movie actually impressed me is a pretty solid testament to its quality. Of course, putting Cate Blanchett in a title role isn’t ever going to hurt your film, but the electric chemistry between her character and Rooney Mara’s Therese, the captivating story, and the melancholic score all come together to form a wholly engaging experience. \n\nGiven that Carol comes off as confident and refined past what any actual person would be like, Therese seems to be the character the audience is expected to relate the most to. Her most prominent character struggle is one of what she wants for herself versus what others (her boyfriend, her colleagues, Carol, society) want for her, which is definitely something almost everyone has faced on some level. The only problem is that that indecisiveness makes her a little bland and lacking in agency right up until the very end. We never really get to learn what makes her (or Carol) tick, since their most profound bonding moments are either really meaningful eye contact or chatting drowned out by music. We don’t learn what draws Carol to Therese, which feels like a betrayal of how the movie constantly reminds us how hopelessly lost in love the two of them are. The actual relationship plays second fiddle to the characters’ individual struggles, and I’m fine with that, but not having your central romance hold up feels like a betrayal of your genre. All that said though, great movie, go watch it.",
    "reviewDate": "2024-01-15",
    "tmdbId": 258480
  },
  {
    "id": "casablanca-1942",
    "title": "Casablanca",
    "releaseDate": "1942-01-01",
    "genres": [
      "Romance",
      "Hollywood",
      "Drama"
    ],
    "rating": 7.6,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, people who like war-era movies",
    "rewatchability": "Once in a year, maybe",
    "bestCharacterWinner": "TBD",
    "review": "“Of all the jin joints in all the world… ”, this movie is easily the most quotable. In a way, it shows such an advanced, mature version of “love” not seen in most romance movies. It’s black and white, but it doesn’t seem too old, and it still captures the “war” atmosphere that it no doubt was made in (1942 things). Rick (Humphrey Bogart) was a charismatic protagonist, and had great chemistry with Ilsa (Ingrid Bergman, who’s fairy-like). There’s great performances by Victor Laszlo (Paul Henreid) and Sam (Dooley Wilson), with my personal favorite coming from Louis. I wouldn’t have dreamed of giving a win to a Nazi before, but this guy is hilarious (and, like, barely a nazi anyway). Rick’s cafe is iconic, and this movie has straight up made Casablanca (the city) known. The plot is actually interesting too, and if you don’t know the ending already, it’s definitely something to look forward to. Good production value, too.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So the best things about this movie were all spoilers, even if its premise was pretty good too. “Here’s looking at you, kid” is obviously the first thing—absolute legends moves. Probably one of the most recognizable catchphrases of a character in movies (if people watch older movies, I guess). And then, of course, the ending line “Louis, I think this is the beginning of a beautiful friendship.” I was so happy. Louis is the best. I laughed when he was like “round up the usual suspects” after Rick literally shot his boss in front of him. Take the win. Then the piano song was super iconic. Also Rick gets maturity points in the end for finding the right solution to the situation (also that one scene where he helped that one kid get money, perfect). And shoutout to Victor for being understanding about Ilsa when she thought he was dead. Everyone in this one is a homie, even if Rick tries to be a tsundere.",
    "tmdbId": 289
  },
  {
    "id": "chhichhore-2019",
    "title": "Chhichhore",
    "releaseDate": "2019-01-01",
    "genres": [
      "Drama",
      "Coming-of-age",
      "Bollywood (Hindi)"
    ],
    "rating": 8.5,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "IF YOU’RE AN INDIAN KID IN HIGH SCHOOL OR COLLEGE THIS IS MADE FOR YOU",
    "rewatchability": "Once a year, to keep the sentiment fresh",
    "bestCharacterWinner": "TBD",
    "review": "In honour of ‘3 Idiots’ and college movies everywhere, I present ‘Chhichhore’. I’m an Indian kid in university right now (off-campus, because pandemic) and I was super happy with my decision until I watched this movie - the spirit of Indian unis is so overpowering and familial that it’s impossible not to yearn for that camaraderie. Maybe it’s just me, since I’m the target audience. The core message of this film is this: you’re only a loser if you think you are, and fighting for yourself is all you can do - and it’ll be enough. Just don’t give up. And I think that’s a message that can be appreciated by everyone. Throw in a cute love story between Anni (Sushant Singh Rajput, who’s great, RIP) and Maya (Shraddha Kapoor, who I love) that’s actually mature enough to be a lesson in and of itself, and an absolutely wonderful supporting cast - Derek (Tahir Basin), Acid (Naveen Polishetty), Mummy (Tushar Pandey), and Bevda (Saharsh Kumar Shukla) - to the greatness that is Sexa, and you have a comedy classic with insane amounts of heart that touches on important issues in society and portrays an authentic (well, mostly, come on) Indian college experience.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "I have to say, that buzzer beater at the end of the basketball game could have gone either way, but I’m glad that’s the message that they went with. The nicknames from all the gang and the kids’ stress about all-india-ranks (btw good job as Raghav, Mohammad Samad) are super relatable, as is, sadly, the boy’s reaction to failure. I do wish they’d given Maya more to do, but it was 2h30, so I understand having to cut out some parts. Still, replaying the doctor scenes wasn’t too integral to the plot or pacing. Of course, the villain appreciating them in the end is a good moral ending, but I also would’ve liked to see a more concrete ending for Anni and Maya’s relationship. Apart from that, the end monologue was great. Oh also, there were basically no songs. Go figure. Anyway, it’s great, and this proves that movies don’t need songs to be good (@Bollywood). Don’t commit suicide, and in honour of Sushant, I hope you enjoy this one.",
    "tmdbId": 596650
  },
  {
    "id": "clueless-1995",
    "title": "Clueless",
    "releaseDate": "1995-01-01",
    "genres": [
      "Comedy",
      "Romance",
      "Coming-of-age"
    ],
    "rating": 7.5,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens, not young kids, not adults",
    "rewatchability": "Couple times a month if you want; wildly rewatchable",
    "bestCharacterWinner": "TBD",
    "review": "What if Ferris Bueller had a kid with Regina George? I present the original spoilt, rich girl of the 90s: Cher. This movie is maddd rewatchable, and its high school culture is just really cute to go through. The driving scenes are all hilarious, and the relationships between all the characters are still pretty well fleshed out. Of course, Cher’s house and wardrobe are fabulous, as is the chiq 90s styling for the retro-plastics. Paul Rudd’s Josh stole the show with most scenes (almost enough for me to give him the win), and his chemistry with Silverstone made watching them together really entertaining. Plus, they were both super attractive back in the day. A chick-flick to the finish, this one’s in the bank to keep you entertained on a rainy day.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Sure, there’s not exactly an important plot, but still, spoilers. I have to say, I don’t know if it’s ambiguous writing, but I didn’t know who was going to end up with who at the end. The only indicator could have been the lack of screentime for Travis, and the fact that Paul Rudd is a lot better known. Their pairing in the end was a little awkward, ex-step siblings and all, but they were both charming enough to pull it off.",
    "tmdbId": 9603
  },
  {
    "id": "coco-2017",
    "title": "Coco",
    "releaseDate": "2017-01-01",
    "genres": [
      "Coming-of-age",
      "Family (Animated)"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, probably",
    "rewatchability": "Pretty sad story, so maybe once in a year or two",
    "bestCharacterWinner": "TBD",
    "review": "This was a good movie, no doubt - I just think that my expectations had been loaded after hearing everyone else’s reviews, and it didn’t feel as mind-blowing as I’d been led on to believe. The theme of remembering family was certainly extremely impactful, and the characters were well-crafted, if a bit annoying. The songs were a highlight, with the acoustic guitar serving as the keystone of the score, with a couple beautiful scenes from Hector. The bridge and guitar design was fabulous to watch, and the idea of ‘spirit guides’ was cool, even if it wasn’t completely necessary. Ernesto’s character was pretty predictable, if one-dimensional, and it might have been a good idea to showcase another aspect of the villain.",
    "reviewDate": "2024-01-15",
    "tmdbId": 354912
  },
  {
    "id": "coming-2-america-2021",
    "title": "Coming 2 America",
    "releaseDate": "2021-01-01",
    "genres": [
      "Comedy",
      "Hollywood"
    ],
    "rating": 6.8,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "People who like western comedy",
    "rewatchability": "Probably wouldn’t",
    "bestCharacterWinner": "TBD",
    "review": "So this one was a nice parody of the first one, with way way less charm and originality. I think they focused on way too many advocacy issues with the characters, and that really took away from the enjoyment of the story. That, and Eddie Murphy works a lot better as the main protagonist as opposed to the antagonist. The funeral scene was super iconic in the start, and I think all the cameos from black celebrities were really cool. Rehashing the barbershop, reverend, McDowell’s, etc. was all okay, I guess.",
    "reviewDate": "2024-01-15",
    "tmdbId": 484718
  },
  {
    "id": "coming-to-america-1988",
    "title": "Coming to America",
    "releaseDate": "1988-01-01",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "rating": 7.3,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like western comedy",
    "rewatchability": "Quite funny overall, could do once in three months",
    "bestCharacterWinner": "TBD",
    "review": "I thought Eddie Murphy sounded like Chris Rock, for some reason. Between him and Arsenio Hall, they’re actually really really awesome comedic actors. Around a cast of Lisa (Shari Headley), Patrice (Allison Dean), the King (James Earl Jones), and the Queen (Madge Sinclair), they double and triple-roled their way to a classic. Akeem’s dignity and the movie’s pursuit of challenging western stereotypes about Africa are particularly refreshing. It’s a happy story, but just different enough from modern romcoms to provide that bit of originality to keep you interested.",
    "reviewDate": "2024-01-15",
    "tmdbId": 9602
  },
  {
    "id": "creed-2015",
    "title": "Creed",
    "releaseDate": "2015-01-01",
    "genres": [
      "Drama",
      "Hollywood"
    ],
    "rating": 6.9,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens and up",
    "rewatchability": "Once or twice ever",
    "bestCharacterWinner": "TBD",
    "review": "Michael B Jordan is a pretty good actor, for sure, and Adonis Creed is an awesome name. The story has a lot of heart, and the boxing scenes are super cool, but the villains are pretty wack. Rocky was the most charismatic person in the movie, and I haven’t even seen the original series yet, so that just does Stallone credit. Tessa Thompson’s Bianca was fun to watch, and Adonis’ step mother was hilarious throughout. The whole Philadelphia feeling was pretty authentic (I think?) and the movie had a nice uprising vibe.",
    "reviewDate": "2024-01-15",
    "tmdbId": 312221
  },
  {
    "id": "crouching-tiger-hidden-dragon-2000",
    "title": "Crouching Tiger, Hidden Dragon",
    "releaseDate": "2000-01-01",
    "genres": [
      "Action",
      "Romance",
      "Drama",
      "Chinese"
    ],
    "rating": 7.1,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like action movies, people who don’t mind watching subbed movies",
    "rewatchability": "For the action itself, you could watch this every month",
    "bestCharacterWinner": "TBD",
    "review": "Can I just say, coolest name for any movie ever. Now, it’s pretty long and has a long plot, but the fight scenes are what make this movie iconic. Li Mu Bai (Chow Yunfat), Yu Shu Lien (Michelle Yeoh), and Jen Yu all fly through the air and over water like it’s nothing, and the effects give it a certain reality that even more modern movies fail to achieve. Definitely something that’s unmatched. Also, this movie is more progressive than most would expect, encouraging an engaged girl to seek her own personal identity and representing two fierce female warriors. The Jade Fox (Cheng Peipei) was a bit much, but Jen Yu’s storyline with The Dark Cloud (Chang Chen) in the desert was fairly enjoyable.",
    "reviewDate": "2024-01-15",
    "tmdbId": 146
  },
  {
    "id": "dead-poets-society-1989",
    "title": "Dead Poets Society",
    "releaseDate": "1989-01-01",
    "genres": [
      "Coming-of-age",
      "Drama"
    ],
    "rating": 9.6,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Literally everyone",
    "rewatchability": "Couple times a year, since it’s so dramatic",
    "bestCharacterWinner": "TBD",
    "review": "O CAPTAIN MY CAPTAIN. I don’t think there’s an actor in history as Robin Williams, and his performance in this movie is just as good as Sean in Good Will Hunting. This is one of the most quotable movies ever, since it literally has some of humanity’s best literature to draw from, but also because of its iconic as hell characters: Charlie/Nuwanda (Gale Hansen), Neil (Robert Sean Leonard), Knox (Josh Charles), and Todd (Ethan Hawke). As a teen, this is literally the story of our lives, and it’s safe to say that we’d all kill for a teacher like Mr. Keating. Welton has a really elite, Hogwarts-y feeling to it that makes us want to go there, despite how horrible it is. The Dead Poets Society itself is like Terabithia—it might seem like a fantasy, but it’s the truth.",
    "reviewDate": "2024-01-15",
    "tmdbId": 207
  },
  {
    "id": "definitely-maybe-2008",
    "title": "Definitely, Maybe",
    "releaseDate": "2008-01-01",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "rating": 6.4,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Teens",
    "rewatchability": "Maybe a couple times, depends",
    "bestCharacterWinner": "TBD",
    "review": "So yeah, Ryan Reynolds and his daughter (Abigail Breslin) just have fun trying to out-quip each other in a game of ‘How I Met Your Mother’. It is funny, but there are so many outrageous jokes. There’s a solid cast, with Rachel Weisz and Elizabeth Banks, who are both great too. It suffers the same romcom pitfalls as most, and it does drag on a little bit (2h), and has a LOT of endings (which is funnily most peoples’ criticism of HIMYM). Still, Reynolds is funny, and the daughter is funny too.",
    "reviewDate": "2024-01-15",
    "tmdbId": 8390
  },
  {
    "id": "despicable-me-2010",
    "title": "Despicable Me",
    "releaseDate": "2010-01-01",
    "genres": [
      "Family",
      "Animated"
    ],
    "rating": 7.8,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, max 18 (apart from parents)",
    "rewatchability": "Whenever, it’s pretty light-hearted",
    "bestCharacterWinner": "TBD",
    "review": "The music in this movie is way better than you’d think. Most people don’t remember it either, but it really helps build the required mood at any point in the story. The minions are great at first watch, especially for kids, if they are in small doses. Overall, the movie has a lot of heart - carried by the girls and Gru’s relationship - which is what makes the story worth the watch. It’s a fun movie, and there’s enough comic relief and standard animated movie things to make it rewatchable.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Gru’s character arc is great, with his hilarious initial characterisation and his somewhat relatable troubles, to his eventual maturity and happiness with the girls. Vector is surprisingly funny, even if he probably dies in the end. The plot with the bank was pretty boring, and the orphanage lady was pretty much the worst. Agnes’ unicorn obsession is an acceptable amount of cute, and Miranda Cosgrove’s Margot makes up most of the movie along with Steve Carrell’s now-iconic Gru.",
    "tmdbId": 20352
  },
  {
    "id": "django-unchained-2012",
    "title": "Django Unchained",
    "releaseDate": "2012-01-01",
    "genres": [
      "Hollywood",
      "Action"
    ],
    "rating": 7.9,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Tarantino fans, western fans",
    "rewatchability": "Every week if you want, but it’s kinda long",
    "bestCharacterWinner": "TBD",
    "review": "Yeah, I like it. Coming from someone who isn’t an out-and-out Tarantino admirer, I think this movie was always a lot easier to get invested with than some of his others, given that it had a plot that was set up from the start. The protagonists - the doctor and Django (Jamie Foxx) - had great chemistry and you could really appreciate the teacher-student bond there. Of course the use of racial profanity for alleged historical accuracy is still pretty uncomfortable for me, but the antagonists were also portrayed with some solid performances including Calvin Candie (Leonardo Di Caprio) and Steven (Samuel L Jackson). Broomhilda’s (Kerry Washington) metaphoric connection to the Poetic Edda was cool, and I think Django’s arc was just really satisfying in the end. Shultz was someone who you always rooted for, and his dialogue (Tarantino special) was always great.",
    "reviewDate": "2024-01-15",
    "tmdbId": 68718
  },
  {
    "id": "dune-2021",
    "title": "Dune",
    "releaseDate": "2021-01-01",
    "genres": [
      "Sci-Fi",
      "Action",
      "Hollywood"
    ],
    "rating": 7.9,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Book fans definitely, but really anyone into the genre",
    "rewatchability": "Depends on preference",
    "bestCharacterWinner": "TBD",
    "review": "If I had to sum up my take on this one, I’d probably say that the top-notch direction was masterclass-worthy, but the relatively average script kept it from being something really special. The entire movie is a joy to look at—for a relatively limited color palette, Denis Villeneuve does an incredible job crafting beautiful shots that perfectly convey the movie’s scale and overall atmosphere. Visual storytelling and attention to detail is unbelievable too. I’m serious, if it was possible to have a director win one of these, I would absolutely give Villeneuve first place without hesitation. Acting was pretty great across the board, but there weren’t particular standout performances. The narrative structure was a little wonky, probably because this was a part one, and I think that the lack of proper setups and payoffs made it harder to get properly invested in the plot. Pretty great overall though, definitely an impressive adaptation of some weighty source material.",
    "reviewDate": "2024-01-15",
    "tmdbId": 438631
  },
  {
    "id": "easy-a-2010",
    "title": "Easy A",
    "releaseDate": "2010-01-01",
    "genres": [
      "Comedy",
      "Coming-of-age",
      "Drama"
    ],
    "rating": 6.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens (bit edgy)",
    "rewatchability": "3,4 times a year maybe",
    "bestCharacterWinner": "TBD",
    "review": "I’m not going to say that Emma Stone saved this movie, but her unique voice gave the “narration”-type structure a lot of life, and her acting was certainly fresh and believable in the teen-protagonist role (particularly with sarcasm). If there was any movie that I’d compare this movie to, it’d be Mean Girls - there’s an impressive cast (Stanley Tucci, Amanda Bynes, Lisa Kudrow, Patricia Clarkson), a unique protagonist, and an awkward, self-aware tone that hits home for a very specific audience. And while both were incredibly similar in terms of tone, I feel like this movie was a little less well-executed, and more awkward (not in a good way). But might be cool to watch with friends.",
    "reviewDate": "2024-01-15",
    "tmdbId": 37735
  },
  {
    "id": "ender-s-game-2013",
    "title": "Ender’s Game",
    "releaseDate": "2013-01-01",
    "genres": [
      "Sci-Fi",
      "Thriller",
      "Coming-of-age"
    ],
    "rating": 8.5,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, Adults",
    "rewatchability": "The first time is the most important, but it’s really entertaining for 2h",
    "bestCharacterWinner": "TBD",
    "review": "Can I just say, SUPER underrated movie. Let’s set the record straight - plotwise, we have the novel by Orson Scott Card to thank, and it is SPECTACULAR. You’ll be hard-pressed to find a more compelling sci-fi plot than this one. The conclusion alone is worthy of classifying the whole movie as a thriller. Then the acting; Asa is wonderfully expressive as the young Ender (his voice cracks are especially emotive), and Harrison Ford as Colonel Graff is pretty great to watch too. Petra (Hailee Steinfeld before she was famous), Valentine (Abigail Breslin) and Mazer Rackham (Ben Kingsley) are both also pretty great supporting characters. The technology and word-building of the future - the space stations and battle room in particular - is beautiful, and the score and direction (zooming into Ender’s eyes a lot) really helps develop the emotion of the characters.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "THAT ENDING. Definitely one of the best endings in movie history. And the expression on Ender’s face is definitely powerful enough to capture just how terrible his realization felt. The buildup to the final scene, with the Mind Game and whatnot, was all done pretty well, and the pressure definitely progressed in a way that kept the stakes higher than ever. Plus, the battle room scenes are just the most fun ever.",
    "tmdbId": 76274
  },
  {
    "id": "enola-holmes-2020",
    "title": "Enola Holmes",
    "releaseDate": "2020-01-01",
    "genres": [
      "Coming-of-age",
      "Hollywood",
      "Family"
    ],
    "rating": 7.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Young generation to take action, older generation to check their biases, sherlock holmes fans",
    "rewatchability": "Once a year maybe",
    "bestCharacterWinner": "TBD",
    "review": "So this wasn’t bad. It was a netflix movie, and it was marketed pretty well. Enola breaks the fourth wall a lot, so that’s definitely fun to watch. Obviously, this movie isn’t perfect, with Mycroft (Sam Claflin) being completely intolerable for the first half, and Sherlock (Henry Cavill) being completely watered down (especially after watching the BBC Sherlock). But otherwise, Enola was likeable, and she had great chemistry with Lord Tewksbury (Louis Partridge). A supporting cast of Helena Bonham Carter as the mom and Fiona Shaw was fun, staying true to the British theme of the cast. The story itself wasn’t bad, if a little disjointed, but the moral was extremely relevant to 2020’s audience (what with all the protests and human rights campaigns), and it was pulled off well.",
    "reviewDate": "2024-01-15",
    "tmdbId": 497582
  },
  {
    "id": "eternal-sunshine-of-the-spotless-mind-2004",
    "title": "Eternal Sunshine of the Spotless Mind",
    "releaseDate": "2004-01-01",
    "genres": [
      "Romance",
      "Drama",
      "Hollywood"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Adults, older teens",
    "rewatchability": "You might have to rewatch a couple times, but it’s pretty exciting for most of it",
    "bestCharacterWinner": "TBD",
    "review": "I quite like the premise of the movie - the ability to erase someone from your memory is definitely a unique idea in regards to romance movies, and I think they pulled it off pretty well. Joel Barrish (Jim Carrey) and Clementine had great chemistry; I didn’t know Jim Carrey was a good dramatic actor, but I do now. There’s a massive supporting cast here, too, with Stan (Mark Ruffalo), Mary (Kirsten Dunst), Patrick (Elijah Wood), Rob (David Cross), and Howard (Tom Wilkinson), and their exciting little characters all help compensate for the lack of action for the leads. That said, the memory jumping structure and direction was outstanding and unique, if a little jarring, and the cuts really helped the pacing of the movie. A lot of the dialogue was great (Nietzsche quotes) and Patrick’s manipulation of the memory-wipe system is also super important in terms of speculative science fiction. Still, Clementine’s Manic Pixie Dream Girl persona shines through and her bright hair and clothes definitely contrast well with Joel’s. There’s some comedy there, lots of drama, and a compelling romance. Definitely an interesting romance movie.",
    "reviewDate": "2024-01-15",
    "tmdbId": 38
  },
  {
    "id": "ex-machina-2014",
    "title": "Ex Machina",
    "releaseDate": "2014-01-01",
    "genres": [
      "Sci-Fi",
      "Thriller",
      "Hollywood"
    ],
    "rating": 6.5,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Adults, realistic future sci-fi enthusiasts",
    "rewatchability": "You wouldn’t really, but it’s 1h45 and mostly idealistic",
    "bestCharacterWinner": "TBD",
    "review": "Damn, this was pretty jarring. So basically it’s about Caleb (Domnhall Gleeson) who’s selected to go meet the famous Zuckerberg-type Nathan (Oscr Isaac) to Turing Test out the new AI, Ava (Alicia Vikander). The idea and the execution is definitely very professional and well-researched, creating the uncomfortable mood that would no doubt surround any ordeal of that sort - this helps keep tension, but it’s also hard to watch. The direction, music, cinematography, dialogue is all great, and I think Ava is definitely an interesting take on an inorganic human. The plot does make sense in its own little arc, but it does give off a relatively cautionary feeling that would have been identified regardless of the ending.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Oof. Nathan was super creepy. His relationship with Ava creeped me out. Ava was super sweet at the start, but her totally abandoning Caleb at the end was pretty weird for me, even if she did just manipulate him (which is disappointing). I pretty much guessed Kyoko/Katie (Sonoyo Mizuno) was a robot also, but the cupboard full of extras was creepy. Pretty scary overall.",
    "tmdbId": 264660
  },
  {
    "id": "ferris-bueller-s-day-off-1986",
    "title": "Ferris Bueller’s Day Off",
    "releaseDate": "1986-01-01",
    "genres": [
      "Comedy",
      "Coming-of-age",
      "Hollywood"
    ],
    "rating": 10.0,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Wonderful for teens and below; Adults should enjoy too",
    "rewatchability": "Pretty rewatchable, just don’t overdo it",
    "bestCharacterWinner": "TBD",
    "review": "Honestly this is the best movie ever made. From the first second of it to the last, I wasn’t once tempted to take my eyes off of it. The characters were great, and they complimented each other well. This movie has some heart, and is just a whole lot of fun. There’s a lot of different tones in the movie, but they never feel disjointed. Of course, the soundtrack is legendary, featuring songs by the Beatles and even the Star Wars Theme. The movie’s representation of peak 1900s culture is so good that if I had to show aliens one movie to give them an impression of humans it would be this. Ferris Bueller’s effortless charm and wit makes him possibly the most likeable character of all time - certainly in my book. Mia Sara’s Sloane is insanely good looking and has a sophisticated grace that makes her character so much more than just a supporting role. Of course, Cameron was the heart of the movie, and his relationship with the Ferrari was both hilarious and fabulous character growth. Gene’s character growth was also immensely satisfying, as was Rooney’s ultimate downfall. This will forever be my go-to movie.",
    "reviewDate": "2024-01-15",
    "tmdbId": 9377
  },
  {
    "id": "five-feet-apart-2019",
    "title": "Five Feet Apart",
    "releaseDate": "2019-01-01",
    "genres": [
      "Romance",
      "Drama",
      "Hollywood"
    ],
    "rating": 8.8,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Solo is best, maybe with a quiet friend",
    "rewatchability": "Once a year",
    "bestCharacterWinner": "TBD",
    "review": "The chemistry between Hayley Lu Richardson and Cole Sprouse is adorable and completely believable - makes the movie. Doesn’t hurt that they’re super attractive, either. Score wasn’t exactly legendary, but it played its part really well, upheld the feels whenever it needed to. Has an incredible amount of heart, and it’ll get you thinking about things you might not think about usually - privilege of being healthy, having the chance to be with others, taking chances, etc. Better to watch alone, or at least with people who don’t talk a lot, so that you can appreciate it.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Ending messed me up. Straight up. Crying. Ending messed me up. Straight up. Crying. The pool scene was adorable, of course. Abby’s whole existence was alright at first, but a bit annoying later on; I recognize her importance to Stella’s character, so all is forgiven. Poe was much better than I thought he’d be – Moises Arias did a pretty solid job. The nurse’s relationship with her was really sweet, and I think that the youtube highlights were Stella’s opus. Birthday scene was great, and Cole really showed off his acting chops – facial expressions especially. May have been a bit long, but is definitely worth rewatching once a year.",
    "tmdbId": 527641
  },
  {
    "id": "flavors-of-youth-2018",
    "title": "Flavors of Youth",
    "releaseDate": "2018-01-01",
    "genres": [
      "Family",
      "Coming-of-age",
      "Anime"
    ],
    "rating": 7.6,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, teens, adults",
    "rewatchability": "1h15, but it’s also like 3 episodes, so you can spread it out",
    "bestCharacterWinner": "TBD",
    "review": "Bruh get that kid his noodles. Get that woman her sister. Get the guy Xiao Yu. That’s basically what the three episodes are about (they link up in the post-credits). I personally liked the third the best, but this is why the audience is so wide - each of them appeal to different age groups. Overall, the animation is pretty good, and the music and narration are the cornerstones of what makes the episodes so heartfelt. The first part will make you hungry with all that noodle talk, but it shows how much affect you might have on the lives of people you don’t even know. The second part is probably for more mature-minded viewers, having to do with self-realization. Yi Lin (Minako Kotobuki) and Lulu (Jona Xiao) have a really touching sibling relationship as adults, which isn’t depicted too often. The third part is a romance-drama (which I really liked) with Xiao Yu (who’s adorable) and Li Mo (Takeo Otsuka), in circumstances that you might even recognize.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "REAL QUICK: Xiao Yu throwing the exam for Li Mo got me BAD. I realized it just before she said it, and it hit so hard when the scene came around. Tears. Also her abusive dad is really not okay (who puts their own kid in the hospital?). But yeah, I think some aspects of all three stories are relatable to any viewer, and the ending really shows that there’s a happy possibile future for any past.",
    "tmdbId": 513347
  },
  {
    "id": "ford-v-ferrari-2019",
    "title": "Ford v Ferrari",
    "releaseDate": "2019-01-01",
    "genres": [
      "Hollywood",
      "Thriller",
      "Drama"
    ],
    "rating": 8.0,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Pretty family friendly",
    "rewatchability": "Action is great, but story hits the hardest the first time",
    "bestCharacterWinner": "TBD",
    "review": "I didn’t know who Ken Miles and Carroll Shelby were before watching, and now I have such a profound respect for them. Racing is sometimes a niche sport - I always thought it was too dangerous and unrelatable - but it’s definitely wonderful to watch in movies. Matt Damon is great as Shelby, and even though Christian Bale’s cockney accent was a little surprising, I think he did a phenomenal job as Ken (who I think deserves a lot of the credit here too). Mollie (Caitriona Balfe) is awesome in support, and Peter (Noah Jupe) has some important scenes. The shooting was great, the practical effects were wonderful, and the costumes were definitely awesome. Solid job.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "THEY WARNED US! They hinted at it. It wasn’t enough. I took such a blow when Ken died, man. That just seemed cruel. And what’s worse is that this all actually happened in real life. Honestly that Ford executive dude was the absolute most annoying antagonist I’ve ever seen - and I mean including Joffrey and Ramsay. The slowing down thing was more insufferable than if he’d crashed out. That voice over and the last scene are really nice though, and I hope the kid has a nice life.",
    "tmdbId": 359724
  },
  {
    "id": "forrest-gump-1994",
    "title": "Forrest Gump",
    "releaseDate": "1994-01-01",
    "genres": [
      "Drama",
      "Romance",
      "Hollywood"
    ],
    "rating": 8.8,
    "classRecommendation": "Must Watch",
    "intendedAudience": "With some censorship, maybe kids could watch it",
    "rewatchability": "2",
    "bestCharacterWinner": "TBD",
    "review": "For a movie that tackled subject matter as heavy as this one did, watching it was considerably easier than one would think. Personally, the anti-tarantino style of historical narration and modification was addictively entertaining, and the plot itself was well crafted. Of course, Hanks’ most iconic role is that for a reason, and Forrest Gump is probably one of the most likeable movie protagonists ever - his straightforward demeanor and underdog persona makes rooting for him completely seamless and fulfilling. The subtle musical and theatrical expertise of the crew make this movie what it is, with the narrative style and the opening and closing shots adding an artistic edge to an already thematically sound film. The supporting cast did well, with Lieutenant Dan (Gary Sinise) completing his own meaningful character arc adjacent to Forrest’s. Add a couple lines of completely iconic dialogue, and it makes a solid council class movie.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "I guess I feel for Jenny, given that she has a tough childhood and all, but Forrest deserved better.",
    "tmdbId": 13
  },
  {
    "id": "friends-with-benefits-2011",
    "title": "Friends With Benefits",
    "releaseDate": "2011-01-01",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "rating": 7.9,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens, young adults",
    "rewatchability": "Once in a couple months",
    "bestCharacterWinner": "TBD",
    "review": "So I originally thought this movie would be a lot dirtier than it was, and I think it’s important that people know that it’s really not. It’s got the standard romcom ratio of that stuff, nothing disproportionate. Jamie and Dylan (Justin Timberlake) are the mains, and they have pretty great chemistry. Even though both of their characters are messed up, they both seem interesting enough to be super likeable. Both NY and LA are exploited to the fullest, and I quite enjoy it. My only problem with the plot was the third act, which slowed the tempo in a pretty romcom way, and I felt like maybe it wasn’t the best move for this story. Still, the ending was cool, and all the interactions between the mains were hilarious and entertaining. Solid romcom.",
    "reviewDate": "2024-01-15",
    "tmdbId": 50544
  },
  {
    "id": "frozen-2-2019",
    "title": "Frozen 2",
    "releaseDate": "2019-01-01",
    "genres": [
      "Family (Animated)"
    ],
    "rating": 7.5,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids movie, but pretty much everyone",
    "rewatchability": "Once a month-ish should be okay if wanted, it’s not too long",
    "bestCharacterWinner": "TBD",
    "review": "Although Disney sequels to classics are typically subpar in comparison to its predecessors, Frozen 2 holds its ground quite well, which is impressive considering how good the original is. Elsa was a lot more likeable this time around - and this is coming from an Anna stan - and all of the songs that she was involved in were stellar. Anna’s plot wasn’t as refined as it was in the first one, but her song at the end of the movie more than made up for it. Kristoff, Olaf, and Sven were decent comedy aids, keeping the tempo of a generally somber movie relatively upbeat, while managing to not disrupt its tone. The main issue with this film, though, was pacing. The movie spends most of its time setting up its character conflicts instead of developing them, so the ending is forced to tie everything together with a neat little bow. Frozen II’s final half hour or so felt a bit disjoint from the rest of the movie because of that.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The movie’s premise itself was a lot more interesting than I had thought it would be, and full credit is due to the scriptwriters. The whole plot line with the mother was really cool too, so much so that I was considering giving her the win over Elsa, despite her lack of actual presence in the movie. Even though it was obvious, the resurrection of both Elsa and Olaf simultaneously was pretty off-putting, but the final proposal made the feels seem requited. The water-horse was pretty cool too.",
    "tmdbId": 330457
  },
  {
    "id": "ghostbusters-1984",
    "title": "Ghostbusters",
    "releaseDate": "1984-01-01",
    "genres": [
      "Comedy",
      "Sci-Fi"
    ],
    "rating": 7.5,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Retro movie fans, sci-fi fans",
    "rewatchability": "Pretty funny, once in a couple years",
    "bestCharacterWinner": "TBD",
    "review": "Who you gonna call? That song is still awesome. The cast for this movie is great, and it’s not hard to see why it’s a cult classic - Venkman, Ray (Dan Aykroyd), Egon Spengler (Harold Ramis), and later Winston (Ernie Hudson) were the perfect nuclear team, and between their chemistry and the movie’s fun premise and upbeat tone, it’s definitely a fun watch. There is a lot of wasted time with Dana (Sigourney Weaver) and her plot with Louis (Rick Moranis), but the ending scene was definitely hilarious. Big shout to Janine (Annie Potts), who’s hilarious.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Crossing streams is now like a big thing in pop-culture, which just goes to show how cool the ending was. Of course, the marshmallow man scene is absolutely wonderful. Also, I really really hate that environmental agency guy. Couldn’t tolerate him at all, and I wasn’t entirely sure what turning the machine off would do. Still, the ending was nice, and the music is awesome.",
    "tmdbId": 620
  },
  {
    "id": "gifted-2017",
    "title": "Gifted",
    "releaseDate": "2017-01-01",
    "genres": [
      "Hollywood",
      "Drama",
      "Family"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, probably",
    "rewatchability": "Maybe once every few years to see if you get anything new out of it",
    "bestCharacterWinner": "TBD",
    "review": "Wow yeah, pretty good movie. It’s a little weird seeing Chris Evans as anything other than Captain America, but he keeps his honest, good-natured face with Frank Adler. His interactions with Mary are really cute, and they have really great chemistry. McKenna Grace is crazy good for a child actor in drama. Evelyn (Lindsay Duncan) is the biggest part apart from those two, and I think she’s played pretty well, which makes me absolutely hate her that much more. Bad parenting in movies really really triggers me. But yeah Frank’s story was really well done, and I have to say he’s ridiculously well adjusted (although that might just be the captain america residue). The music was nice, the dialogue was pretty good, and I thought the direction was interesting too. There’s a lot of heart and a real debate as to how to treat a kid’s potential, and all the math scenes are pretty cool. It’s definitely important to see what makes the difference in these arguments, and I think Frank’s sincerity is the most important thing to take away. Fred the Cat gets extra points because Mary loves him.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The shadow of Mary’s mom was important, and the reveal at the end was definitely awesome. I definitely thought that Evelyn got a way better ending than she deserved, and that Frank should have absolutely dunked on her. But I guess that’s his charm. Bonnie (Jenny Slate) was pretty funny and important in the first half, but she fades a bit in the finale. Roberta (Octavia Spencer) is really nice as well, and helped share information with the audience without exposition. Plus her karaoke scene was funny.",
    "tmdbId": 400928
  },
  {
    "id": "goal-2-living-the-dream-2007",
    "title": "Goal 2: Living the Dream",
    "releaseDate": "2007-01-01",
    "genres": [
      "Drama"
    ],
    "rating": 5.1,
    "classRecommendation": "Guilty Pleasure",
    "intendedAudience": "Football fans, I guess",
    "rewatchability": "Prob wouldn’t",
    "bestCharacterWinner": "TBD",
    "review": "Yeah so this movie isn’t exactly something you would look forward to, especially since it doesn’t really have a plot. The fact that there are a bunch of famous footballers is quite impressive, but also the movie itself could have done better with what was undoubtedly a big budget. The whole Enrique plot kinda pised me off too.",
    "reviewDate": "2024-01-15",
    "tmdbId": 9815
  },
  {
    "id": "gods-of-egypt-2016",
    "title": "Gods of Egypt",
    "releaseDate": "2016-01-01",
    "genres": [
      "Fantasy"
    ],
    "rating": 7.4,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like mythology, people who like fantasy",
    "rewatchability": "Couple times a year",
    "bestCharacterWinner": "TBD",
    "review": "It looks bad, but it’s really not. Films like this are usually marketed in a way that just makes them seem useless, but it was enjoyable. Bek and Zaya’s (Courtney Eaton) romance was heart-warming, Horus (Nikolaj Coster-Waldau) and Hathor (Elodie Yung) were pretty god-like, and Thoth (Chadwick Boseman) was so weird. So hit and miss, I guess, but mostly pretty solid. Set (Gerard Butler) was a cool villain, and his arc made sense mostly. Either way, watching a mortal talk back to gods is entertaining enough to come back to. I don’t really mind the whitewashed cast, but I’m not Egyptian, so… either way, I would definitely choose acting over accuracy in that way, even if it’s just me. CGI really didn’t hold up in some fights, and one of the initial cuts was SO BAD, but mostly it’s good to watch. Bit overstuffed with myths and stuff, but the main story isn’t bad.",
    "reviewDate": "2024-01-15",
    "tmdbId": 205584
  },
  {
    "id": "good-will-hunting-1997",
    "title": "Good Will Hunting",
    "releaseDate": "1997-01-01",
    "genres": [
      "Hollywood",
      "Drama"
    ],
    "rating": 9.4,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Not a light-hearted film, so definitely for a more mature kind of audience",
    "rewatchability": "Couple times a year, since it’s so dramatic",
    "bestCharacterWinner": "TBD",
    "review": "Another classic - I’d watch this movie any day. To think that it was written by Matt Damon and Ben Affleck too makes it that much more special, and its sheer genuine-ness makes it easy to love. Will is a legendary protagonist, with the whole movie being centered around his character arc, facilitated by Sean (Robin Williams), who was a close second-best performance. Their chemistry was indescribable, and made the movie to such an extent that most of the movie was just them sitting in a room and talking to each other. Lambeau (Stellan Skarsgard) was a believable human character, Skylar (Minnie Driver) was a likeable human love-interest, and Chuckie and Morgan (Ben and Casey Affleck) were a great complementary cast to round out Damon’s scenes. The dialogue was incredibly iconic, with “Carmine Scarpaglia”, “How’d you like them apples”, and a lot of outbursts making the movie insanely entertaining. Artistically, the movie wasn’t lacking either, and its background music was a solid complementary piece whenever it appeared.",
    "reviewDate": "2024-01-15",
    "tmdbId": 489
  },
  {
    "id": "hamilton-2020",
    "title": "Hamilton",
    "releaseDate": "2020-01-01",
    "genres": [
      "Hollywood",
      "Drama",
      "Historical",
      "Musical/Stage Play"
    ],
    "rating": 8.8,
    "classRecommendation": "Must Watch",
    "intendedAudience": "People who like musicals, people who are interested in history",
    "rewatchability": "Not frequently, maybe once a year max",
    "bestCharacterWinner": "TBD",
    "review": "Well I’m not a broadway guy, but I appreciate vocals, and Lin Manuel Miranda is a certified legend. From the opening scene (which kinda spoils itself) the music is great, and all the performers really fit their parts wonderfully. Miranda is great and captivating as Alexander Hamilton. Thomas Jefferson (Daveed Diggs) and George Washington (Christopher Jackson) are really fitting as the respected presidents, while Leslie Odom Jr.’s Aaron Burr is a pleasant surprise (but also the character that takes the most Ls). Jonathan Groff’s King George III was a really nice comedic angle, reminiscent of Shakespeare’s Puck. Most characters had really fulfilling and believable arcs, and I feel like I learned a bit, so that’s good. If you’re going to give oscars to any non-commercial movies, this is the way to go.",
    "reviewDate": "2024-01-15",
    "tmdbId": 556574
  },
  {
    "id": "harry-potter-and-the-prisoner-of-azkaban-2004",
    "title": "Harry Potter and the Prisoner of Azkaban",
    "releaseDate": "2004-01-01",
    "genres": [
      "Fantasy",
      "Coming-of-age"
    ],
    "rating": 8.0,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Fantasy fans",
    "rewatchability": "2h20, but the plot is great, and you’re invested throughout",
    "bestCharacterWinner": "TBD",
    "review": "Probably the best one out of the 8 movies, if it’s possible to rank them. This one utilizes Harry’s backstory to the absolute maximum, bringing back characters with such an emotional stake in his life that the plot actually seems like it might affect his development. Harry (Daniel Radcliffe), Ron (Rupert Grint), Hermione (Emma Watson) were hitting their stride as actors in this movie, Daniel in particular, and I think Draco (Tom Felton) played a really important comedic role. The adults were obviously more prolific; Michael Gambon’s Dumbledore was probably at his best in his debut here, while Snape (Alan Rickman), Sirius (Gary Oldman), and Remus were all phenomenal near the end. Hagrid (Robbie Coltrane) and Buckbeak’s storyline wasn’t the most exciting, but it worked really well with the plot in the end. The DADA class remains one of the best scenes overall, and of course the Patronus scene was probably the most iconic Harry Potter scene ever.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Well everyone’s already seen this, but I’m sure the twist with Peter Pettigrew (Timothy Spall) being Scabbers and the real traitor was pretty shocking at the time. The reunion between Sirius and Remus is great to watch, as are both of their reactions to Harry (recognizing his eyes, etc.). I think the Marauders storyline is one of the absolute best parts of Harry Potter, and this movie utilizes it the most out of any of them. Hogsmeade, the Marauders’ Map, everything was pretty well done. Ron was pretty annoying in this one though, even if that scene with them eating the beans was cool. Marge was awful (rightly so) and the Knight Bus scene was pretty random, I guess. Dementors were definitely on point.",
    "tmdbId": 673
  },
  {
    "id": "hitman-s-bodyguard-2019",
    "title": "Hitman’s Bodyguard",
    "releaseDate": "2019-01-01",
    "genres": [
      "Thriller",
      "Comedy"
    ],
    "rating": 7.0,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Not bad for large groups, but not with parents",
    "rewatchability": "No spoilers really, and mostly action and comedy",
    "bestCharacterWinner": "TBD",
    "review": "This movie is what you’d expect from a Sam Jackson and Ryan Reynolds movie. The action is entertaining, there’s a bit of heart, and they have decent chemistry. Between Elodie Yung and Salma Hayek, the cast are pretty good looking, and the comedy is definitely worth a watch. Lots of swearing, as you’d think, and some decent dialogue from Jackson.",
    "reviewDate": "2024-01-15"
  },
  {
    "id": "hotarubi-no-mori-e-2011",
    "title": "Hotarubi no Mori e",
    "releaseDate": "2011-01-01",
    "genres": [
      "Coming-of-age",
      "Anime"
    ],
    "rating": 7.8,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Teens, people who remember their childhoods fondly",
    "rewatchability": "45m only, so you can rewatch weekly",
    "bestCharacterWinner": "TBD",
    "review": "These kinds of movies are just so artsy that sometimes it’s hard to appreciate them. This movie, though, has the iconic cat-mask-wearing Gin, who’s got a tragic backstory that means he can’t touch anyone. Then there’s Hotaru (Ayane Sakura) who grows up from a six year-old to a high school student, and her journey in this short movie is almost as tragic as Gin’s. They do have a pretty heartwarming relationship, but the animation, music, narration, and supporting characters really do help to build a world that supports their story and seems authentic. The last scene is honestly really sad, but felt inevitable, and there are a lot of beautiful shots in the movie. I feel like it might be an allegory for children and their imagination, but I’m not sure how the ending would factor into that. Still, it was definitely great value for time, and I think it’s worth a recommend.",
    "reviewDate": "2024-01-15",
    "tmdbId": 92321
  },
  {
    "id": "howl-s-moving-castle-2004",
    "title": "Howl’s Moving Castle",
    "releaseDate": "2004-01-01",
    "genres": [
      "Anime",
      "Family",
      "Fantasy"
    ],
    "rating": 7.0,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Studio Ghibli fans, anime fans, animation fans",
    "rewatchability": "I think rewatches are necessary to understand",
    "bestCharacterWinner": "TBD",
    "review": "Bruh why are these movies so hard to understand. Straight up, apart from marvelling at how good everything looks, I really don’t see what’s going on with this movie. The antiwar message was pretty overt, but it was conveyed more through the setting and visuals than the actual plot progression. I guess the characters and the art style were super abstract, which is cool, and very typical Miyazaki, but the plot itself was so hard to make concrete sense of. The castle design was cool, for sure, too. I know it’s based on a book, and from what I can tell, the original narrative made way more sense. Still, it’s interesting to watch and think about, so give it a try.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Let’s see if we can understand this, shall we? So someone cursed a prince and turned him into a turnip scarecrow (best character), which started a war. Suliman used the war as an excuse to fight all other wizards, including Howl, who rejected her teachings and became a half-demon with the help of Calcifer (also a legend). They fight a lot, and Suliman tricks the Witch of the Waste and steals her power. More fighting, more drama, until eventually Sophie kisses the turnip and his curse is lifted, ending the war. Pretty random way to go about it. Howl I guess has a character arc, which is nice. Markl, the kid, is pretty much just there, though his dynamic with Sophie is pretty cute to watch. The witch gets annoying near the end. The whole aging business is super motif-like, which I guess is cool. Still hella confusing.",
    "tmdbId": 4935
  },
  {
    "id": "in-the-heights-2021",
    "title": "In the Heights",
    "releaseDate": "2021-01-01",
    "genres": [
      "Hollywood",
      "Drama",
      "Musical"
    ],
    "rating": 6.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults",
    "rewatchability": "2h30, but good songs",
    "bestCharacterWinner": "TBD",
    "review": "Usnavi is a pretty cool name, even if its origin is super stupid (still realistic). Lin-Manuel Miranda is awesome at writing, and Anthony Ramos is a pretty good protagonist, even if this movie is carried by its “community” feeling and cast. Vanessa (Melissa Barrera) is pretty cool, and Nina (Leslie Grace) is a cool kind of character who goes through a journey that isn’t too prominent in the movies. Plus, Leslie Grace is awesome. Carla (Stephanie Beatriz) is funny, and Benny (Corey Hawkins) has some really great scenes - especially the gravity-defying dance. There’s a lot of heart in this movie, and I enjoyed the little insertions of Spanish here and there in the dialogue. The changing POVs gave us the chance to view the community from every perspective. Sonny (Gregory Diaz IV) was definitely a great piece to add, and the colours everywhere made the movie much easier to watch.",
    "reviewDate": "2024-01-15",
    "tmdbId": 467909
  },
  {
    "id": "independence-day-1996",
    "title": "Independence Day",
    "releaseDate": "1996-01-01",
    "genres": [
      "Action",
      "Thriller",
      "Hollywood"
    ],
    "rating": 7.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like alien thrillers",
    "rewatchability": "2h30, start is slow, end is awesome",
    "bestCharacterWinner": "TBD",
    "review": "Think about the two most typecast actors in Hollywood, and put them in the same movie. This movie has Will Smith as Steve and Jeff Goldblum as David as its leads, and it somehow makes both of them seem even more charismatic than they usually are. A supporting cast of Bill Pullman, Randy Quaid as the legend himself, and Margaret Colin as Connie all give great dramatic performances in the tense atmosphere that this movie thrives on. The start is definitely slow, the second act has its gems, but the third act of this movie is one of the best third acts you’ll see in action movies. Also the dialogue here is insanely iconic, so shoutout to the writers; for a 2h30 movie to be so rewatchable is definitely a credit.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "HELLO BOYS, I’M BAACK. That was definitely awesome, come on. Also THAT presidential speech gave me total goosebumps and won Pullman the movie then and there - man, I wish the US had a president like that. But yeah, Will and Goldblum both do phenomenal jobs with what they’re given, and it’s a pity they only meet in the third act, because their chemistry in that last scene is so eyecatching. And that final shot with them walking in the desert? Chef’s kiss. I’ll also never stop laughing at Will Smith punching an alien.",
    "tmdbId": 602
  },
  {
    "id": "indiana-jones-and-the-temple-of-doom-1984",
    "title": "Indiana Jones and the Temple of Doom",
    "releaseDate": "1984-01-01",
    "genres": [
      "Action",
      "Thriller",
      "Horror"
    ],
    "rating": 7.0,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like action movies",
    "rewatchability": "Whenever you’re bored",
    "bestCharacterWinner": "TBD",
    "review": "Yeah no it was pretty weird man. Every non-white character was insufferable, and out of the two white ones, the girl (Winnie, Kate Capshaw) was really annoying for like 95% of the movie. Indiana Jones himself makes the movie worth watching, kinda like Jack Sparrow in the later Pirates of the Caribbean movies. The kid (Shortie, Jonathan Ke Quan) was so annoying and unnecessary, and I didn’t even understand what he was saying most of the time. The music, however, was great throughout, and the costumes weren’t bad at all. Cast chemistry was pretty good, and the action was nice- particularly the minecart scene at the end. The bridge scene had pretty good suspense too. The main reason it’s not just Existent is that it’s got a lot of heart (and not just the ones that are ripped out of peoples’ chests).",
    "reviewDate": "2024-01-15",
    "tmdbId": 87
  },
  {
    "id": "inglourious-basterds-2009",
    "title": "Inglourious Basterds",
    "releaseDate": "2009-01-01",
    "genres": [
      "Hollywood"
    ],
    "rating": 7.8,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Tarantino fans, but also anyone who isn’t a nazi",
    "rewatchability": "Every week if you want, but it’s kinda long",
    "bestCharacterWinner": "TBD",
    "review": "I’m not exactly a Tarantino fan, but I was pleasantly surprised with this movie. Its “highs” were really high, and I bet it definitely goes down as a guilty pleasure movie for a lot of people. Tarantino’s reinvention of history is really entertaining, especially with the characters of Hans Lamda and Brad Pitt’s Aldo Raine, both of whose unique characters are insanely entertaining to watch. The length of this movie is an issue, as it is with most Tarantino movies, taking out some of the urgency from the story. Otherwise, the opening was constructed beautifully, and the character introductions were iconic. The cast was certainly impressive; Brad Pitt, Christoph Waltz, Michael Fassbender, Diane Kruger, Melanie Laurent, Daniel Bruhl. The portrayal of Hitler is also pretty hilarious to watch, and is very much in tone with the rest of the movie’s theme - the cinemafiction of one of the biggest tragedies in human history (WWII).",
    "reviewDate": "2024-01-15",
    "tmdbId": 16869
  },
  {
    "id": "interstellar-2014",
    "title": "Interstellar",
    "releaseDate": "2014-01-01",
    "genres": [
      "Sci-Fi"
    ],
    "rating": 9.6,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Solo, maybe a quiet group",
    "rewatchability": "SUPER emotive, so maybe once in a couple years (?)",
    "bestCharacterWinner": "TBD",
    "review": "As he tends to do, Nolan brings in the powerhouses for Interstellar’s cast, including but not limited to Matthew McConaughey, Anne Hathaway, Michael Caine, Matt Damon, and surprisingly not Leo DiCaprio. The premise is solid, and the visuals and score are on another level. The movie plays with different aspects of humanity, celebrating our legacy as pioneers and our capacity for love while looking down on our drive for individual self-preservation and fear of the unknown. The chemistry between McConaughey’s character and his daughter is played to its fullest, and their connection is a focal point for the entire movie. There’s a fair amount of religious symbolism as well, but it all takes the form of concrete human achievement, which seems to tell us that even miracles can be made possible by ingenuity and perseverance.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "I'm gonna lead off by saying that the moment where Mann betrays Cooper, Brand rescues him, the camp explodes, and Murph torches the cornfield might just be my favorite scene in all of cinema. There are probably more iconic or critically acclaimed examples out there, but everything about this set piece is just amazing. From the nerve-wracking score to the constant cutting between everything going around to the exceptional performances from literally everyone, I can never take my eyes off the screen when this part is on.\n\nOn another note, I totally get the criticisms of how the third act tried to be too brilliant for its own good. I find myself having to explain the tesseract scene to basically everyone I watch this movie with, which is fair, since I spent an hour or so reading about it after I first saw it in theaters. But hey—this is a Nolan movie, after all, and that pitfall was completely to be expected.\n\nSeeing Murph on her deathbed hit different. I don't know what to say. The words \"No parent should have to watch their own child die\" left me feeling devastated at all the years she and Cooper should've been able to spend together as father and daughter that she'd had to live out on her own.",
    "tmdbId": 157336
  },
  {
    "id": "ip-man-2008",
    "title": "Ip Man",
    "releaseDate": "2008-01-01",
    "genres": [
      "Action",
      "Drama",
      "Historical",
      "Chinese"
    ],
    "rating": 6.8,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "People who like martial arts movies",
    "rewatchability": "1h40, and lots of action, but pretty serious subject matter",
    "bestCharacterWinner": "TBD",
    "review": "So apparently this is basically a true story, which is crazy. It’s about this guy called Ip Man (that’s his actual name) in the 1940s when Japan took over China. He’s great at fighting the wing chun style, and he taught Bruce Lee. So you already know he’s going to be THAT guy. It’s mostly a historical (dramaticized, of course) rendition of the occupation in the eyes of the Chinese, and Ip’s reaction to the situation. Great fight scenes, Lynn Hung is great as Cheung, and it’s good as a fighting movie.",
    "reviewDate": "2024-01-15",
    "tmdbId": 14756
  },
  {
    "id": "jumanji-the-next-level-2019",
    "title": "Jumanji: The Next Level",
    "releaseDate": "2019-01-01",
    "genres": [
      "Comedy",
      "Romance",
      "Action"
    ],
    "rating": 7.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who enjoy funny blockbuster-type movies",
    "rewatchability": "Once a month if you want, but you probably wouldn’t want",
    "bestCharacterWinner": "TBD",
    "review": "Gotta love Jumanji, huh? This movie is always going to be thought of in terms of the first movie (Jumanji: Into the Jungle), whose blending of cast in the ‘real’ and video-game worlds made a uniquely impactful movie that was also fun to watch repeatedly. This movie has that too, just to a lesser precedent. The emotional quotient was kept high throughout, with solid acting from Danny DeVito, Danny Glover, and Alex Wolff, while the action is handled by Dwayne Johnson and Karen Gillan, leaving the comedy to Kevin Hart and Jack Black. Suffice to say, the cast speaks for itself in terms of competence, and they definitely have chemistry too, with everyone doing what they were expected to, and also working a little outside of their comfort zones. The world was also enhanced from the previous movie, while not seeming much like a ret-con, which was also a welcome addition to the story and continuity of the movies. The grievances lie mostly in that it tried to do a lot, and that the execution was a bit less on-the-nose as it had been in the previous movie. Overall, still a fun watch.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The horse thing was a bit much, and the pegasus thing was sufficiently much. Again, the viking villain guy was pretty bad, meaning that they really didn’t learn from their mistakes from the last movie. They lost way too many lives throughout, and Milo’s (Danny Glover) way of talking was proper annoying.",
    "tmdbId": 512200
  },
  {
    "id": "juno-2007",
    "title": "Juno",
    "releaseDate": "2007-01-01",
    "genres": [
      "Coming-of-Age",
      "Romance",
      "Drama"
    ],
    "rating": 6.8,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Teenagers, probably",
    "rewatchability": "Couple times ever",
    "bestCharacterWinner": "TBD",
    "review": "So this is basically Quirkiness: The Movie. I guess that’s what you should expect from Ellen Page and Michael Cera. It’s not bad, and there’s some pretty good banter throughout the movie. Jennifer Garner was kinda annoying in it, but JK Simmons wasn’t bad. Juno pretty much carried it by herself, and it really helped show how charming Ellen Page is. Otherwise, the whole story about teen pregnancy is all believable and feels important. It’s portrayed in a way that feels really chill and easy to watch. I really didn’t like Michael Cera’s outfit, though.",
    "reviewDate": "2024-01-15",
    "tmdbId": 7326
  },
  {
    "id": "jurassic-park-1993",
    "title": "Jurassic Park",
    "releaseDate": "1993-01-01",
    "genres": [
      "Thriller",
      "Action"
    ],
    "rating": 7.8,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Anyone really, might be scary for kids",
    "rewatchability": "Multiple times a month, but novelty plays a big part",
    "bestCharacterWinner": "TBD",
    "review": "So I don’t think I was meant to watch Jurassic World before this one, so my pov might be a little unfair, but I still thought this movie was pretty good. The b-plots were pretty annoying, and the setup at the beginning wasn’t really too required, but the main cast of Sam Neill, Laura Dern, and Jeff Goldblum carried pretty well. The kids weren’t too annoying, and their relationship with Alan (Neill) was pretty nice to watch as the movie progressed. Action-wise it was pretty good for 1993, and a few set-pieces still hold up pretty well. Music fits wonderfully, because JOHN WILLIAMS. I wish there was a proper main character in this movie though, it might have helped with clarity.",
    "reviewDate": "2024-01-15",
    "tmdbId": 329
  },
  {
    "id": "jurassic-world-2015",
    "title": "Jurassic World",
    "releaseDate": "2015-01-01",
    "genres": [
      "Thriller",
      "Action"
    ],
    "rating": 8.6,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Everyone that likes blockbuster movies",
    "rewatchability": "Once a month if you want",
    "bestCharacterWinner": "TBD",
    "review": "Yeah, I loved it. As someone who hasn’t ever seen any one of the original Jurassic Park movies from start to finish, but still has a general idea of the iconic scenes, this was perfect for me. Definitely makes sense that this is the 6th highest grossing movie ever, and I think it did justice to the originals. The cast is loaded, with Chris Pratt (Owen) and Bryce Dallas Howard (Claire) leading the movie as adults (with pretty great chemistry and dialogue) and Ty Simpkins (Gray) and Nick Robinson (Zack) playing the child-self-insert characters that visit the resort. Vincent D’Onofrio, Irrfan Khan, Katie McGrath, Judy Greer, etc. make a pretty stellar supporting cast too. The visual experience was awesome, and the colors made the park seem like a lot more than just a CGI paradise. The dinosaurs were cool, and the park was impressive. Giacchino’s score was pretty beautiful, and it took from the original Jurassic Park theme (if it ain’t broke) too, so best of both worlds. The plotlines make a lot of sense, and none of the characters seem unjustified in their actions, which is a refreshing surprise for a blockbuster. The action also really doesn’t disappoint. The acting is great, and the relationships between the brothers, the adults, and Claire and the kids have a lot of heart too, which keeps the stakes high. Blue was awesome, and he gets a honorary win (everyone did pretty well this time around, which is part of what made this movie that good).",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Bruh that final fight tho. Like I’d seen what happened before, but with context, that SLAPS. The TRex and raptor vs Indominus? Get outa here. I should have seen this in the cinema ngl. The final KING roar at the end gave me goosebumps, so good job guys. The shot with the flare and the TRex is cool, and the raptor scene w Owen as the alpha is cool too. Solid effort.",
    "tmdbId": 135397
  },
  {
    "id": "jurassic-world-fallen-kingdom-2018",
    "title": "Jurassic World: Fallen Kingdom",
    "releaseDate": "2018-01-01",
    "genres": [
      "Thriller",
      "Action"
    ],
    "rating": 7.5,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who liked the first one, people who like action movies",
    "rewatchability": "Once a month if you want",
    "bestCharacterWinner": "TBD",
    "review": "This one starts a bit slow, especially in comparison to the first movie, and its cast isn’t as stacked. Still, it has a good progression, and a lot of the set-pieces are really fun to watch. Pratt and Bryce Dallas Howard’s chemistry is once again really captivating, and even though the Maisie Lockhart (Isabella Sermon) b-story might seem frustrating at first, it pays off with some pretty good story potential in the end. The villain wasn’t really as good as last time, and the new comic relief duo weren’t as relatable as the brothers from the last film, but in terms of watchability, it’s pretty solid.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So the scene with them floating away from the park on the barge, watching the bracchio die was pretty sad. The whole die-hard thing that they had going on at the estate was cool too, and would have been fun to see more of. The TRex didn’t do much, but its establishing ‘roar’ shot was pretty satisfying. The science guys were pretty boring. Indo Raptor was a discount Indominus Rex, really nothing in comparison to the first villain in terms of awesomeness. Blue did clutch up though, which is good. The ending was pretty mad in terms of consequences, and it’ll be cool to see how they continue. Also Goldblum’s cameo wasn’t the best.",
    "tmdbId": 351286
  },
  {
    "id": "just-go-with-it-2011",
    "title": "Just Go With It",
    "releaseDate": "2011-01-01",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "rating": 7.3,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Definitely great to watch with friends",
    "rewatchability": "Total popcorn, would be fine to rewatch in a couple months",
    "bestCharacterWinner": "TBD",
    "review": "Haha. I’ve been searching for an alternative movie to We’re the Millers for a while now, and I’m really glad to have found this. Sure, it’s not exactly the same, and I might not have laughed as hard consistently, but it’s really a great time. Daniel (Adam Sandler) and Katherine have ridiculous chemistry throughout, and Palmer (Brooklyn Decker) is a darling, not to mention a real-life model. The kids are also hilarious plot devices, and I think that the sheep scene with Eddie (Nick Swardson) was probably the one that got me laughing the hardest.",
    "reviewDate": "2024-01-15",
    "tmdbId": 50546
  },
  {
    "id": "karate-kid-2010",
    "title": "Karate Kid",
    "releaseDate": "2010-01-01",
    "genres": [
      "Family",
      "Coming-of-age"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, teens, people who like happy-message movies",
    "rewatchability": "Quite rewatchable, but 2h, so maybe once in a couple of  weeks is possible",
    "bestCharacterWinner": "TBD",
    "review": "I feel like this movie gets way less credit than it deserves. I understand that the original was super iconic to some people, but there’s a distinct difference between the two movies (even if the plot itself was starkly similar) - The first was about visiting oriental culture in the west, while this one was about a westerner dealing with chinese culture IN china. There’s a difference. Oh, and the other one was actually Karate and Japan/Okinawa. Still, both are great. Jaden smith was a pretty loveable protagonist, and his chemistry with both Mr. Han (Jackie Chan) and his mom (Taraji P Henson) was great. Wenwen Han was cute as Meiying, and the exploration of cultural divide and assimilation was great to view from a kid’s eyes. I actually loved how nice this movie was to China - even the opening credits were in Chinese, which I found really cool. The music, score, and everything was phenomenal, the cinematography and establishing shots were great, and there was a lot of emotional weight in the main character’s arc, which is what made the final scene so great. Anyway, it’s a fun watch for kids, and definitely helps capture the experience of overcoming challenges as a kid.",
    "reviewDate": "2024-01-15",
    "tmdbId": 38575
  },
  {
    "id": "knives-out-2019",
    "title": "Knives Out",
    "releaseDate": "2019-01-01",
    "genres": [
      "Drama (Detective)"
    ],
    "rating": 8.2,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Pretty universal; maybe not the youngest of kids, since swearing and explicit language",
    "rewatchability": "Once or twice a month if wanted, but it’s 2+ hours long, so time-constraints might be an issue",
    "bestCharacterWinner": "TBD",
    "review": "This movie’s cast was so stacked that pretty much everyone in the world would have to know at least one of them: Ana de Armas, Daniel Craig, Michael Shannon, Chris Evans, Katherine Langford, Jamie Lee Curtis, and more. For a two-hour movie, it didn’t ever feel overly boring, but I guess that’s the plus point of detective stories. Christopher Plummer’s Harlan Thrombey started the film out on a really sincere note, and his chemistry with Ana was pretty good to watch. Chris and Ana also carried the middle section of the movie, while Craig held all of it together. There’s enough comedy in it to keep the movie from getting too stale, even if some of it is rather tasteless, but the tone of the film is the real hero, keeping it light hearted through the color palette and dialogue.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Craig may have been a standout acting-wise, but mixed feelings on the accent. Definitely wasn’t the James Bond voice we’ve come to expect from him. The ending wasn’t bad, but it wasn’t exactly revolutionary either. Definitely a lot of heart though, and it was great to see Marta (de Armas) come into her own. While the specifics of how may have been a mystery, though, it felt inevitable from the start that she’d come out on top. Overall, I think it is a good watch, especially in recent years, since it fits in with the anti-money-grab message that needs to be heard at the moment.",
    "tmdbId": 546554
  },
  {
    "id": "kung-fu-panda-2008",
    "title": "Kung Fu Panda",
    "releaseDate": "2008-01-01",
    "genres": [
      "Family (Animated)"
    ],
    "rating": 8.4,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids movie, but pretty much everyone",
    "rewatchability": "Once a month-ish should be okay if wanted, it’s not too long",
    "bestCharacterWinner": "TBD",
    "review": "The cast of this movie is so distinguished that there’s almost no one alive who would feel estranged (Jack Black, Angeline Jolie, Jackie Chan, Lucy Liu, Seth Rogen, Dustin Hoffman). And while they all did phenomenally, my two personal favorite characters in this movie were Tai Lung (Ian McShane) and Oogway, both of whom brought their own comedic-but-deep qualities to the film whenever they were involved. Jack Black is always fun to watch, and he carries the movie well, and a generally solid plot and entertaining visuals places this really high by default. The comedy does get taken a bit too far at times, not in the offensive sense, but just a bit annoying at times. The color palette was pretty bland throughout as well, and for an animated film, it definitely could have used a little more lively colors.",
    "reviewDate": "2024-01-15",
    "tmdbId": 9502
  },
  {
    "id": "la-la-land-2016",
    "title": "La La Land",
    "releaseDate": "2016-01-01",
    "genres": [
      "Hollywood",
      "Romance",
      "Drama"
    ],
    "rating": 7.3,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, college students",
    "rewatchability": "Catchy, good songs, fun dialogue, 2h",
    "bestCharacterWinner": "TBD",
    "review": "Emma Stone and Ryan Gosling are like a proper pairing now, huh? They’re pretty solid, to be fair. Mia (Emma Stone) and Sebastian have great chemistry and have pretty relatable career struggles in acting and music respectively. Even though the songs and choreographies are what make this movie a little more poetic than its base content, I think it’s Sebastian’s jazz obsession that was the show-stealer. I wasn’t expecting it at all, and the movie somehow converted me to a jazz purist in the middle there. “Someone in the Crowd” and “A Lovely Night” are probably my favourite songs, but the final sequence with the alternate timeline was probably the most eloquent sequence in the movie - good, mature ending.",
    "reviewDate": "2024-01-15",
    "tmdbId": 313369
  },
  {
    "id": "legend-1985",
    "title": "Legend",
    "releaseDate": "1985-01-01",
    "genres": [
      "Fantasy",
      "Romance"
    ],
    "rating": 6.0,
    "classRecommendation": "Guilty Pleasure",
    "intendedAudience": "People who like fantasy, have a little time to spare",
    "rewatchability": "Whenever, but it doesn’t feel like a ‘movie’ movie in the 21st century way",
    "bestCharacterWinner": "TBD",
    "review": "I’m going to confess, I only watched this movie because I love Ferris Bueller’s Day Off, and I heard Sloane (Mia Sara, who I’m kind of in love with) from that was going to be in this. But then I saw Tom Cruise in the cast, and I thought, huh, “why not?” Turns out it’s pretty interesting. 80s movies were just something else. Mia Sara (Lily) and Tom Cruise (Jack) are both really pretty in this one, but there isn’t too much chemistry. It’s not easy to have chemistry with Tom Cruise, so not a big deal. Supporting cast are better than you’d think acting-wise, but VERY campy costumes. The first scene was pretty rightly terrifying and disgusting, if slightly campy, and the villain monologue was pretty impressive. Mia Sara’s introduction was, of course, awesome - a fairy if I ever saw one. Adorable. The costumes and sets have a very Star Wars feel to them, which I’m here for. Highkey the bad guy is the best character in the story. The bad guy’s design is completely awful, but scary, and his voice is AWESOME. His end monologue is great, and the conclusion isn’t bad. Cinematography and particularly the main score was quite good (reminiscent of Leia’s theme in star wars).",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The whole “instant night” thing that happened was pretty unexpected. The random kid, Gump, who woke Jack up was pretty weird, “I know everything”. But the kid’s acting was pretty great. And he almost died of frustration? Whatever, that whole riddle scene was pretty wack. The whole river scene with the weird cannibal witch thing was pretty scary and awesome, so props to Jack for that. Also Jack rejecting the fairy was good. The ballet scene with Mia Sara is actually so well done, too.",
    "tmdbId": 11976
  },
  {
    "id": "les-miserables-2012",
    "title": "Les Miserables",
    "releaseDate": "2012-01-01",
    "genres": [
      "Drama",
      "Romance"
    ],
    "rating": 5.8,
    "classRecommendation": "Guilty Pleasure",
    "intendedAudience": "French people?",
    "rewatchability": "Never",
    "bestCharacterWinner": "TBD",
    "review": "Yeah, no. It was pretty messed up how such good actors could get pulled into such a long, drawn out movie. Seriously, the cast was so broken (Hugh Jackman, Russel Crowe, Anne Hathaway, Eddie Redmayne, Amanda Seyfried, Helena Bonham Carter, Sacha Baron Cohen). And yet, this was probably the weirdest, most depressing movie I’ve seen from start to finish. Honestly, the Bishop by himself is just a legend, everyone else is hella annoying.",
    "reviewDate": "2024-01-15",
    "tmdbId": 82695
  },
  {
    "id": "little-women-2019",
    "title": "Little Women",
    "releaseDate": "2019-01-01",
    "genres": [
      "Hollywood",
      "Drama"
    ],
    "rating": 8.2,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "I’d imagine it’s an inspirational film for women, but everyone can benefit from this story",
    "rewatchability": "2 hours and then some, so maybe once a year",
    "bestCharacterWinner": "TBD",
    "review": "When I started, I wasn’t a fan of Saoirse Ronan. By the end, I’d consider watching anything she was in. Her chemistry with all of the star-studded cast was amazing (Emma Watson, Florence Pugh, Timothee Chalamet, Laura Dern, Meryl Streep), and she carried her character unbelievably credibly. All of the characters’ arcs were satisfying and complemented each other inside the whole story. The artistic talents of the sisters were all refreshing and illustrated their uniqueness and solidarity simultaneously in a form that was pleasing to watch. Of course, the setting allowed for beautiful shots, which completed an original plot with great acting and a meaningful theme.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "RIP Beth :(. She was adorable. Meryl Streep did her stuff, but I’d have liked to see her in more of the plot. The father’s inclusion was pretty ornamental - maybe he should have like… had a conversation. I didn’t really understand Laurie’s (Timothee Chalamet) sudden change of heart to marry Amy, especially because it was completely unwarranted. Meg’s arc with John was pretty solid. The end scene with Jo and the publisher was cool, and Jo’s relationship with Friedrich (Louis Garrel) was good, since we finally got to see her happy.",
    "tmdbId": 331482
  },
  {
    "id": "love-and-monsters-2020",
    "title": "Love and Monsters",
    "releaseDate": "2020-01-01",
    "genres": [
      "Coming-of-age",
      "Comedy",
      "Sci-Fi"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Sci-fi fans, teens",
    "rewatchability": "Maybe a couple times ever based on quality",
    "bestCharacterWinner": "TBD",
    "review": "Yeah, I’m a pretty big Dylan O’Brien fan, so it’s great to see him star in movies like this. Definitely entertaining as ever, popcorn flick if I ever saw one, with just enough heart to keep you in your seat. Joel has chemistry with all the other characters that he interacts with (including a dog and a robot, so that’s impressive). I like the motivation and the whole arc that the movie tries to get across - it’s idealistic but also not cliche and perfect, and it tells you to go take your chances. Solid message. Aimee (Jessica Henwick) is pretty cool, but both Minnow (Ariana Greenblatt) and Clyde (Michael Rooker) have more screentime than her, and are pretty funny. Watching Minnow and Joel interact is great. The ship stuff at the end was okay, and the crab scene was actually pretty cool, if you can suspend your disbelief.",
    "reviewDate": "2024-01-15",
    "tmdbId": 590223
  },
  {
    "id": "love-letter-1995",
    "title": "Love Letter",
    "releaseDate": "1995-01-01",
    "genres": [
      "Japanese",
      "Hollywood",
      "Drama"
    ],
    "rating": 8.8,
    "classRecommendation": "Must Watch",
    "intendedAudience": "You can probably only best appreciate this when you’re out of school",
    "rewatchability": "Winter night, bundled up under a warm blanket",
    "bestCharacterWinner": "TBD",
    "review": "I don’t really know what it is about this movie. If you asked me, I don’t think I could give you any one reason that makes it better than Recommendable. And I usually love movies with emotional climaxes, that cut deep and scar you, that make me want to shake the screen. But my heart feels at peace after watching this movie. And better yet, it somehow got me to appreciate the beauty of winter. There were moments in the movie when I could recognize imperfections, but it wasn’t really the perfection of the movie that made it what it was. Its appreciation of the nature of humanity - from Itsuki (girl) stumbling around with her slippers at the beginning, to the classic childhood days that stay with us, to the importance of family, and the beauty of love. This isn’t a love story, certainly, but its really an ode to life and nature. You never know what things you do will make a difference in others’ lives - something as stupid as a doodle, a weird habit, or a song you like can become the reason relationships start or reignite. I didn’t realize that Itsuki (girl) and Hiroko were both played by the same actress (Miho Nakayama), but I guess it really does mean a lot - she’s asking herself to remember Itsuki (boy) who she will and has loved. There’s no aspect of time with this movie. There’s just memory, and I love it. The cinematography is great, the relationships are great, and of course, the mountain scene in the snow is phenomenal acting. Still, for some reason, when the grandfather talked I couldn’t help but feel like there was the weight of the world on his heart.",
    "reviewDate": "2024-01-15",
    "tmdbId": 47002
  },
  {
    "id": "man-of-steel-2013",
    "title": "Man of Steel",
    "releaseDate": "2013-01-01",
    "genres": [
      "Superhero",
      "Action"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "People who like action movies",
    "rewatchability": "It’s 2h30 and has a long story, but it’s also quite enjoyable",
    "bestCharacterWinner": "TBD",
    "review": "Underrated. If you watched this movie in the cinema, I GUARANTEE you would love it. It’s got the Zack Snyder, Scorsese-esque style and grit, but also has a plot and characters you want to follow. Superman (Henry Cavill) and Lois Lane are wonderfully cast, and have surprisingly great chemistry with each other. The supporting cast of General Zod (Michael Shannon, who’s a little intense here), Jor-El (Russell Crowe), and Perry White (Laurence Fishburne) definitely boosted the star power; I thought Superman’s parents (Diane Lane and Kevin Costner) were probably the best performances too, and they would have got the win if they’d had a little more effect on the plot. Still, this movie tells a new, captivating story that explores themes of loyalty, choice vs fate, conservatism vs trust - it’s not easy. They pull it off remarkably well, and they set up a cinematic universe at the same time. Great job, overall. Fight scenes are also unique because of the direction and colour schemes selected; make them seem a lot more grave and realistic.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "That scene at the end was definitely a clincher. Henry Cavill as farmboy Clark was good, as Superman he was great, but that last scene where he smiled as nerdy Clark? Perfect. Christopher Reeves would have said the same. The last fight against Zod may have gotten a little out of hand, but the climax where Clark yells after killing him is really powerful. The story treats the whole ‘superhero’ concept very seriously and somehow manages to pull it off relatively well, all things considered. The world engine scene and even the destruction of Krypton were super powerful, but my favourite from this movie would be the one where Jonathan Kent dies and Clark’s watching, knowing he could have stopped it. That really sums up his whole struggle, and it’s awesome that they went through with that Uncle Ben-type moment.",
    "tmdbId": 49521
  },
  {
    "id": "meet-joe-black-1998",
    "title": "Meet Joe Black",
    "releaseDate": "1998-01-01",
    "genres": [
      "Hollywood",
      "Drama",
      "Comedy"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, comedy fans, romance fans",
    "rewatchability": "Once in like half a year might work",
    "bestCharacterWinner": "TBD",
    "review": "I did quite like it, even if it was longer than it needed to be. The office scenes were all pretty funny, and the supporting cast were all memorable enough not to be boring. The dynamic between Bill (Anthony Hopkins) and Joe was pretty cool to see, especially since the actors usually do different kinds of movies, and Susan (Claire Forlani) is cool too. The first scene with her meeting Joe is cute, and all of his fish-out-of-water stuff is pretty endearing, even if most of it is just Brad Pitt looking like Brad Pitt. Still, all the peanut butter stuff, “death and taxes” and everything was funny. Final scene with the fireworks was really nice, even if the ending might have been a little confusing for some people.",
    "reviewDate": "2024-01-15",
    "tmdbId": 297
  },
  {
    "id": "meet-the-robinsons-2007",
    "title": "Meet the Robinsons",
    "releaseDate": "2007-01-01",
    "genres": [
      "Family",
      "Coming-of-age",
      "Sci-Fi",
      "Animated"
    ],
    "rating": 8.5,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, Adults who feel stuck",
    "rewatchability": "Whenever you feel stuck",
    "bestCharacterWinner": "TBD",
    "review": "I remember watching this as a kid and just thinking about the wide range of emotions that I felt. There’s the wonder of the future, curiosity of the weirder elements, fear at the dystopian visions, elation at the conclusion, and lots of anticipation throughout. Like most movies adapted from books, the plot is just exemplary, and the suspense is held for just long enough for the reveal to be cathartic. The animation itself does a great job of making the future seem awesome (from Lewis’ eyes), and in particular, meeting the Robinsons is so fun. They all seem like such a chaotic group, but if there was ever a way to elicit envy of a family in the future, this is it. So yeah, all the loose ends type up horrendously well, and I just feel really sentimental now. That quote at the end hits really hard - Walt Disney is the man.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Young Goob was hilarious, and I didn’t actually think he would become a supervillain (even after having watched this in the past) because that’s just how most kids are now. Scary. Future Goob was a little creepy, but his arc was great, and even DORIS was a decent antagonist, all things considered. Anyway, Mildred (orphan house lady) gets MVP for best pep talk ever, but honestly all the adults in this movie are just insanely supportive. Wilbur and Lewis’ relationship is cool, and I just LOVE the time machine designs. Franny is adorable as both a kid and adult, and older Cornelius is just so relieving to watch (Tom Selleck is cool, and the joke was pretty on point too).",
    "tmdbId": 6499
  },
  {
    "id": "moon-2009",
    "title": "Moon",
    "releaseDate": "2009-01-01",
    "genres": [
      "Sci-Fi",
      "Hollywood"
    ],
    "rating": 6.6,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Adults, realistic future sci-fi enthusiasts",
    "rewatchability": "Probably wouldn’t, it’s 1h30 and pretty reveal-centric",
    "bestCharacterWinner": "TBD",
    "review": "I do have to say, this movie was a lot better than I thought at first. It started pretty slow, and I thought it was really boring, but as soon as the plot started, it was hard not to be interested. The main reveal and the interactions between the main characters were definitely something to watch. Sam Rockwell is a better actor than I thought before, and Kevin Spacey does an okay job with Gertie (who was pretty cool). Plot was good, if a little ambiguous, and the pacing was probably the best thing about the movie. The cautionary message about the potential of future technology is also well put, and I think the movie did well to find as much heart as it did.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "This movie was BUILT on spoilers. So obviously the first big reveal was that the guy he saved was also him - there were a few ways to go from there, but it was easy to be interested already. Then the realization that they were clones, along with the pretty real reactions from both of them. The idea that the Tess (Dominique McElligott) and Eve (Kaya Scodelario) messages were actually from the past was heartbreaking to watch when Sam talks to older Eve, so that was well done. It’s also refreshing to see that the computers aren’t the villains for once - Gertie can take a bow. Then the idea that there were tons of clones there was also pretty scary, and I feel like the ending was the best way to handle the situation and characters respectfully.",
    "tmdbId": 17431
  },
  {
    "id": "mr-and-mrs-smith-2005",
    "title": "Mr. and Mrs. Smith",
    "releaseDate": "2005-01-01",
    "genres": [
      "Action",
      "Romance",
      "Drama"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, probably",
    "rewatchability": "Pretty much whenever, it’s kinda a popcorn flick",
    "bestCharacterWinner": "TBD",
    "review": "There’s not a lot wrong with this movie; between Brad Pitt and Angelina Jolie, there’s something in it for everyone. It’s pretty good as an action movie, and the romance is bearable. Eddie’s character is a typical Vince Vaughn comedic relief, and he does his job to perfection. The tech is cool, the cars are cool, the chemistry is there. There’s enough humor in there to keep you entertained, and is a decent enough popcorn flick for anyone that just wants a movie to kill some time once in a while.",
    "reviewDate": "2024-01-15",
    "tmdbId": 787
  },
  {
    "id": "mulan-1998",
    "title": "Mulan",
    "releaseDate": "1998-01-01",
    "genres": [
      "Family",
      "Animated",
      "Coming-of-age",
      "Comedy"
    ],
    "rating": 8.2,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, young girls and boys",
    "rewatchability": "1h30, but quite fast paced",
    "bestCharacterWinner": "TBD",
    "review": "LETS GET DOWN TO BUSINESS. That song will never not be awesome. Overall, this movie’s pacing - and most Disney classic movies’ pacing - is probably what makes them so great. There’s always something happening, and there’s great comedy in between important plot points. Grandma Fa (June Foray) was hilarious in every single line she spoke, and Mushu was a blessing. Take the win. Mulan’s parents weren’t outlandishly traditional or anything, and their reactions to everything were fairly believable. The villain was a little cartoonish, but it kinda is a cartoon, and the huns were so broken in terms of military strength that it might have been hard for people to look past that. Shang was cool too, and apart from his great song, Reflection was really important in terms of driving the plot.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Ah, Disney. 2D animation can be really powerful, and that scene with the reflection really pulled through. Also when she took her dad’s armor to go to war… that was great. Mushu’s whole secret guardian plot was pretty smart, and the ancestors were all quite funny also. It was good to see that the emperor was forward-thinking, even if that seems a little idealistic. Still great.",
    "tmdbId": 10674
  },
  {
    "id": "mulan-2020",
    "title": "Mulan",
    "releaseDate": "2020-01-01",
    "genres": [
      "Family",
      "Coming-of-age"
    ],
    "rating": 6.6,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Disney fans, young girls",
    "rewatchability": "Maybe once or twice ever",
    "bestCharacterWinner": "TBD",
    "review": "So this movie was really hard to classify, especially given that I have a lot of exposure to the original. Still, it wasn’t really an action movie, but it wasn’t comedy either. It felt most like a war movie in the middle, and there was definitely an element of hollywood magic when it came to the relationship between Mulan and Xianniang (Gong Li, who does a great job here). The ensemble cast for this movie was really impressive: Jet Li, Donnie Yen, Tzi Ma. Overall, it wasn’t bad by any means, it just wasn’t as consistently engaging as one would have expected from a disney movie plot. That said, it’s important to recognize that they emphasized the reality of the movie’s themes, at the expense of iconic characters and songs, which may leave a bad taste in some of our mouths. Still, the movie had heart, and even if it wasn’t the most watchable, it didn’t underperform drastically at any point. Yifei is also incredibly cute whenever she smiles, so take that as you will.",
    "reviewDate": "2024-01-15",
    "tmdbId": 337401
  },
  {
    "id": "murder-mystery-2019",
    "title": "Murder Mystery",
    "releaseDate": "2019-01-01",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "rating": 7.6,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens, immature adults",
    "rewatchability": "Whenever, it’s an Adam Sandler rom-com",
    "bestCharacterWinner": "TBD",
    "review": "Have some time on your hands? Want a couple laughs? 1.5 hours is a fair trade off for this movie. A cast of Adam Sandler, Jennifer Aniston, Luke Evans, Gemma Arterton (etc.) make it pretty entertaining throughout. And although the movie’s structure mocks that of classic murder mysteries, it does suffer (ironically) from some of the same cliches. But the chemistry between Aniston and Sandler, and the abundance of non-forced funny moments more than makes up for any kind of unoriginality in the plot. Sandler’s moustache does kind of piss me off though.",
    "reviewDate": "2024-01-15",
    "tmdbId": 514999
  },
  {
    "id": "my-neighbour-totoro-1988",
    "title": "My Neighbour Totoro",
    "releaseDate": "1988-01-01",
    "genres": [
      "Animated (Anime)",
      "Coming-of-age",
      "Family",
      "Fantasy"
    ],
    "rating": 7.6,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, Japanese People",
    "rewatchability": "Once in a couple months",
    "bestCharacterWinner": "TBD",
    "review": "Definitely one of the most peaceful movies I’ve seen, and it’s got all the standard Shinto charm and weirdness. Music is calming and the scenery in this movie is especially nice. I know it has a lot of symbolism for Japanese people, but it’s not a bad watch. The sister dynamic between Satsuki and Mei (Chika Sakamoto) is pretty cute and makes up most of the movie. Takamoto and the Cat Bus are pretty cool but also the Cat Bus scares the hell out of me and Takamoto looks pretty weird. Also the ‘plot’ of the whole movie is a little meh, since it’s just them chilling for most of it. Still, it’s a pretty accurate representation of a challenging coming-of-age (you know, minus all the kami).",
    "reviewDate": "2024-01-15",
    "tmdbId": 8392
  },
  {
    "id": "ocean-s-eight-2018",
    "title": "Ocean’s Eight",
    "releaseDate": "2018-01-01",
    "genres": [
      "Comedy",
      "Thriller"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Pretty much everyone, but it’s a heist film, so people who like that",
    "rewatchability": "Only 1",
    "bestCharacterWinner": "TBD",
    "review": "So I watched this after Ocean’s 11,12, and 13, and I didn’t expect it to live up to the others (which I did like), but it was actually really watchable. The casting in particular was great - Sandra Bullock and Cate Blanchett have great chemistry, Anna Hathaway is great, there’s lots of diversity in Mindy Kalling and Awkwafina (both of whom acted the best I’ve seen from them). Helena Bonham Carter, Sarah Paulson, and Rihanna were all funny and the plot itself wasn’t half bad. It didn’t feel like a deliberately “girl-power” movie either, and it was great to see an ensemble cast of just women (and James Corden). Definitely worth a rewatch.",
    "reviewDate": "2024-01-15",
    "tmdbId": 402900
  },
  {
    "id": "once-upon-a-time-in-hollywood-2019",
    "title": "Once Upon a Time in Hollywood",
    "releaseDate": "2019-01-01",
    "genres": [
      "Hollywood"
    ],
    "rating": 6.8,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Definitely for adults, or film buffs in particular",
    "rewatchability": "Prob wouldn’t",
    "bestCharacterWinner": "TBD",
    "review": "I have literally no idea what this movie was about. I don’t know if it’s just me being stupid, or Tarantino’s weird style, but the plot made pretty much no sense to me. Stuff kinda just happened. Stylistically, the period-piece/60s style kinda slapped, and the cast was loaded (Leo Di Caprio, Brad Pitt, Margot Robbie, Al Pacino). The chemistry between Leo and Brad was pretty good, but Margot’s plot was pretty much just there and totally unrelated.\n\nLOTS of blood, typical Tarantino. Lots of swearing too.",
    "reviewDate": "2024-01-15",
    "tmdbId": 466272
  },
  {
    "id": "paper-towns-2015",
    "title": "Paper Towns",
    "releaseDate": "2015-01-01",
    "genres": [
      "Coming-of-age",
      "Comedy",
      "Hollywood"
    ],
    "rating": 8.1,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "High schoolers about to graduate, adults thinking back to their younger days",
    "rewatchability": "Could do once in a couple years, but it’s mostly for young people",
    "bestCharacterWinner": "TBD",
    "review": "I really like how wholesome this one is. Honestly not surprised that it was based on a John Green novel. Quentin is relatable in a natural, authentic sense, and Margo (Cara Delevingne) is a manic-pixie-dream-girl, but it’s okay because the message of the movie is that no one is actually as one dimensional as they are in the minds of others. The real heart of this movie is Quentin’s pining for Margo, his chemistry with Radar (Justice Smith) and Ben (Austin Abrams), and the upbeat tone and shenanigans that they actually get up to while trying to find Margo. Lacey (Halston Sage) was cool too, and did shake up the whole standard clique-bashing in these kinds of movies. I watched this soon after high school, so it did hit me in the feels quite a bit, but I think the authenticity of this movie will get through to anyone who watches. Might be fun to watch with friends before you graduate.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The comedy in this one is also outstanding. Ben’s entire character is hilarious; his banter with Radar, peeing in the car, dodging the cow. Singing the pokemon theme was probably the best scene for me because it just seemed so real and fun - and obviously I can relate. The ending scene wasn’t the perfecting ending Quentin wanted, but I think it might have struck home a little harder with some better delivery from Margo - Delevingne did a great job in the first part of the movie, though. The outro scenes were satisfying, and it was generally the bittersweet ending I’d come to expect from such a movie, but it’s good to see that Quentin grows over the course of the plot.",
    "tmdbId": 286565
  },
  {
    "id": "parasite-2019",
    "title": "Parasite",
    "releaseDate": "2019-01-01",
    "genres": [
      "Drama",
      "Thriller",
      "Korean"
    ],
    "rating": 8.1,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "People who like suspense movies",
    "rewatchability": "2h20, but has a good mix of enjoyable and serious parts",
    "bestCharacterWinner": "TBD",
    "review": "I swear this movie was marketed wrong. I would have seen it so much earlier if the posters didn’t look like every other horror movie ever - which it really isn’t. I’m not typically a dark, grimy realism movie kinda guy, but Bong Joonho definitely knew what he was doing (and has the bag to show for it). I can’t guarantee that everyone will like it, but I can assure you that you won’t be bored watching… one way or another. The plot, the sets, the dialogue, the characters all scream for your attention continuously, and the pacing keeps the suspense real until the very end. The cast is extremely versatile, from the expressive Mrs Park (Cho Yeojeong, who’s just beautiful) and classist Mr. Park (Lee Sungyun), to Ki-Jung - who’s just the funniest and most likeable - to the crafty Mr. Kim (Song Kangho), the loud Mrs. Kim (Jang Hyejin), and the relatable Ki-Woo (Choi Woosik). The supporting cast of Dahye (Jeong Jiso) and Dasong (Jeong Hyunjoong) as comedic sides and Moongwang (Lee Jeongeun) with Geunse (Park Myunghoon) as dramatic sides worked really well to keep the balance as well. The gritty tone somehow managed to persist through the comedic moments, and there was always a sense of mystery that kept me interested.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "I have to say: that one scene with Ki-Jung smoking over the toilet during the flood? Cinematic gold. What a gangster. Anyway, the movie held together the tension pretty well throughout, with the third act basically just ending like a Shakespearean tragedy (with a little promise at the end). So yeah, that house was awesome. Shots were wonderful. Acting was great. The scene with them all drinking in the living room is also one of my favourites (Ki-Jung is hilarious). There’s an authentic family feeling to the characters, even with all the crazy things they go through. Ki-Jung’s death didn’t really hit as hard as I would’ve hoped, but the morse code thing and the smell motifs were both utilized to good effect.",
    "tmdbId": 496243
  },
  {
    "id": "percy-jackson-and-the-olympians-the-lightning-thief-2010",
    "title": "Percy Jackson and the Olympians: The Lightning Thief",
    "releaseDate": "2010-01-01",
    "genres": [
      "Fantasy"
    ],
    "rating": 6.8,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "8-20 year olds probably",
    "rewatchability": "It’s not AMAZING, so you can rewatch at will without losing too much quality",
    "bestCharacterWinner": "TBD",
    "review": "In this movie’s defence, it’s not half as bad as everyone makes it out to be. Personally, I don’t have a big problem with the casting of Annabeth, especially considering Alexandra Daddario is super attractive anyway, and has pretty solid chemistry with Logan Lerman’s Percy Jackson. The standout scenes from this movie would probably be the capture the flag fight at camp, and then the Vegas Poker Face montage. Brandon T. Jackson was pretty funny in what was an otherwise more expository type of movie, with even super talented cast members (Sean Bean, Pierce Brosnan) being underwhelming. Rosario Dawson’s Persephone was pretty random, but it was funny nonetheless. The villains in this movie were the main issue, with Luke being pretty much a million times worse as a villain than as a hero. Seemed like the movie might have been able to benefit from a little more budget, but it was still rewatchable if only for the nostalgia of Riordan’s books.",
    "reviewDate": "2024-01-15",
    "tmdbId": 32657
  },
  {
    "id": "perks-of-being-a-wallflower-2012",
    "title": "Perks of Being a Wallflower",
    "releaseDate": "2012-01-01",
    "genres": [
      "Drama",
      "Coming-of-age",
      "Romance"
    ],
    "rating": 7.8,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Teens, Adults",
    "rewatchability": "Definitely first time when you’re in high school/college, and once a year after maybe",
    "bestCharacterWinner": "TBD",
    "review": "This is definitely a tragic movie, but it’s got MAD heart. And if you’re a silent, introverted type, you probably will feel a little emotional kick from it (but really like nobody can get through to you, so I’m not promising anything). If you’re an extrovert who pretends to be an introvert, well this is probably your fav movie (that’s also how you check for these people btw). Logan Lerman’s Charlie and Emma Watson’s Sam are really cute (and it’s like Percy Jackson and Hermione Granger chilling together), not to mention Ezra Miller’s hella chill Patrick (He’s basically the Flash too, so this is like the Young Fiction Avengers). The music is cool, and just edgy enough to match the audience, and the subject matter is pretty serious. Overall, it’s definitely not UPLIFTING, but it puts you in a place that makes you feel a little more complete than when you started. Nina Dobrev and Paul Rudd are a pretty solid supporting cast too.",
    "reviewDate": "2024-01-15",
    "tmdbId": 84892
  },
  {
    "id": "pirates-of-the-caribbean-at-world-s-end-2007",
    "title": "Pirates of the Caribbean: At World’s End",
    "releaseDate": "2007-01-01",
    "genres": [
      "Thriller",
      "Action"
    ],
    "rating": 8.4,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "People who like action movies",
    "rewatchability": "Once a month is possible, it’s just great",
    "bestCharacterWinner": "TBD",
    "review": "I don’t know why exactly people don’t like this one so much - it might be too outlandish for some, I guess - but I definitely thought it was one of the most awesome movies I’d ever seen when I first watched it. Depp’s Captain Jack is still awesome, supported by a great cast of Lord Beckett (Tom Hollander), Davy Jones (Bill Nighy), Captain Barbossa (Geoffrey Rush), Will Turner (Orlando Bloom), and Elizabeth Swann (Keira Knightley). Then the supporting characters like Gibbs (Kevin McNally), Tia Dalma (Naomie Harris), Pintel and Ragetti, Mullroy and Murtogg, Bootstrap Bill (Stellan Skarsgard), and James Norrington (Jack Davenport) are also iconic. The introduction of Singapore and Sao Feng’s (Chow Yunfat) crew was really cool leading up to the Brethren Court, which I just wholly enjoyed. Action was great, all the plotting was awesome, the characters were all handled really well, especially given the cliffhanger from the last movie, and it’s always a thrill to watch.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Elizabeth’s speech and the whole final battle was to die for. I will say I would have liked a little less Calypso stuff, but it was good character building for Davy Jones. Also Keith Richards as Jack’s dad was hilarious, since he was the inspiration for Depp’s mannerisms. But yeah, Barbossa was almost as wonderful as Jack, their dialogue is actually really meaningful, and the resolution to the arc was all pretty good - it made us like Will more than we would have otherwise. Beckett was a really annoying person, but we love to hate him, even when he’s bullying Davy Jones. Elizabeth is also just a badass in this one. Oh, also, the whole song stuff is really cool mood-building, but the Locker scene with the hallucinations and crabs was weird.",
    "tmdbId": 285
  },
  {
    "id": "pitch-perfect-2012",
    "title": "Pitch Perfect",
    "releaseDate": "2012-01-01",
    "genres": [
      "Comedy",
      "Coming-of-age"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, teens",
    "rewatchability": "Very poppy and has funny scenes",
    "bestCharacterWinner": "TBD",
    "review": "So this is where the cup song is from. In middle school it was a really big thing, and I thought my classmates were really just great at percussion, but this makes more sense. So Beca here is cool, since Anna Kendrick refuses to ever play a character awkwardly. There’s a quirky mix of characters with Fat Amy (Rebel Wilson), Jesse (Skylar Astin), etc. before quirky became obnoxious. The riff-off scene is iconic, and the song choices are pretty cool for me since early 2010s pop is really my default genre of music. The romance between Beca and Jesse is okay - a little underdeveloped - but the camaraderie within the Bellas is much more prominent and central to the story. It follows the romcom template, except instead of a guy, Beca has relationship issues with her friends. That’s basically it. And the last song medley is quite great too.",
    "reviewDate": "2024-01-15",
    "tmdbId": 114150
  },
  {
    "id": "pride-prejudice-2005",
    "title": "Pride & Prejudice",
    "releaseDate": "2005-01-01",
    "genres": [
      "Romance",
      "Drama",
      "Hollywood"
    ],
    "rating": 6.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like soap operas",
    "rewatchability": "2h, pretty dramatic, good to vaguely know the plot",
    "bestCharacterWinner": "TBD",
    "review": "So yeah, the music was nice. The scenery was definitely cool. Elizabeth and Darcy (Matthew Macfayden) have some pretty emotional scenes, and Mr. Bennet (Donald Sutherland) and Lady Catherine (Judy Dench) gave some really good performances, for sure. This movie is basically a soap opera, with all the emphasis on marriage and status, even though Elizabeth has some pretty mold-breaking dialogue. A lot of the story is irrelevant to the main plot, and many characters’ arcs aren’t utilized to their full potential. Also, I’m just not really into this kind of movie, I guess. It does really seem like a “feel-good” kind of romance movie, with some Shakespearean influence, and even though I haven’t read the novel by Jane Austen, I believe that the norm is true here: the book is truly better than the movie.",
    "reviewDate": "2024-01-15",
    "tmdbId": 4348
  },
  {
    "id": "ratatouille-2007",
    "title": "Ratatouille",
    "releaseDate": "2007-01-01",
    "genres": [
      "Family",
      "Romance",
      "Animated"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, Adults",
    "rewatchability": "It’s 1h50, but the story is cool, and extremely rewatchable",
    "bestCharacterWinner": "TBD",
    "review": "Gotta love this one. I will admit, there’s a little bias here because I’ve seen it so much in the past, but it really is a great movie. It’s kinda like ‘How to train your dragon’, except it’s more grounded in reality yet more experimental with its characters (but a little less compelling in terms of storytelling). Linguini (Lou Romano) and Remy have a hilarious symbiotic relationship that goes against not only everything the world and their families/friends are saying, but the natural order of biology (and possibility, but it’s Pixar). The simple message here is “Anyone can cook”, and it’s said countless times in the story - this really is a stand-in for “don’t judge a book by its cover”, which is more general (albeit overused). The music, the visuals, the plot, the supporting cast of Colette (Janeane Garofalo), Gusteau (Brad Garett), Ego (Peter O’Toole), and Skinner (Ian Holm) all help make the movie a compelling and lasting story, centered around its worthwhile moral.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "I didn’t understand a lot of what happened with the second act of the movie when I was younger, including the scene where Linguini is hungover, so there’s that to consider. Shoutout to Emile (Peter Sohn) and Remy’s dad (Brian Dehenny) for coming in clutch at the end. Also the plotline with Remy helping his rat-bros when he becomes famous is seriously underrated and is definitely something that really happens in life. Ego’s epiphany scene was pretty awesome too, and his entire character until then was SUPER menacing.",
    "tmdbId": 2062
  },
  {
    "id": "raya-and-the-last-dragon-2021",
    "title": "Raya and the Last Dragon",
    "releaseDate": "2021-01-01",
    "genres": [
      "Coming-of-age",
      "Family",
      "Animated"
    ],
    "rating": 7.7,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "People who like disney movies",
    "rewatchability": "1h35, and decently entertaining",
    "bestCharacterWinner": "TBD",
    "review": "The south-east-asian influence was quite strong with this one. Naming the 5 lands after parts of the dragon is cool, and honestly just including dragons is always a plus. The idea that they incorporated the ASIAN dragon (water-centric, more snake-like and long) is definitely really cool. Raya (Kelly Marie Tran) is definitely a likeable protagonist, and the initial scene does a great job of introducing her, her father (Daniel Dae Kim), and the cutest ever baby armadillo-looking-thing Tuk Tuk (Alan Tudyk). Big props to the animators for that. I’m usually not too into Awkwafina’s humour, but her quips are pretty funny coupled with Raya’s more badass personality. Then there’s Namari (Gemma Chan, who’s beautiful) who does have good chemistry with Raya - their little slang that the creators made up (binturi, dep la, etc.) was really cool and brought a new level to their dynamic, especially since they’re based on real languages. The supporting cast of Raya’s friends are pretty funny too, but the visuals and the music do some REALLY heavy lifting, especially near the end, and got me in the feels. That’s what gets this movie this high. They really capture the right tone in the climax, and their command over emotion is definitely really impactful. Good show all around.",
    "reviewDate": "2024-01-15",
    "tmdbId": 527774
  },
  {
    "id": "ready-player-one-2018",
    "title": "Ready Player One",
    "releaseDate": "2018-01-01",
    "genres": [
      "Action",
      "Sci-Fi",
      "Coming-of-age"
    ],
    "rating": 7.5,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Anyone who plays video games, kids and teens",
    "rewatchability": "It’s 2h20, and I physically couldn’t finish it in one sitting, but it’s a good watch, for sure",
    "bestCharacterWinner": "TBD",
    "review": "Yeah, definitely worth it. Spielberg things, you know? I actually didn’t until I’d finished, but it made sense. I feel like as a part of the target audience, it was a really interesting watch, and a lot of thought was put into the world and characters (of course, it’s from a book). So the plot was pretty sound. Parzival/Wade (Tye Sheridan) was an okay protagonist, and his motivation was really the best thing about him - he was a fan. That, and his camaraderie with his gamer friends - especially Artemis - gave the movie a lot of heart. The ways that they solved the challenges were cool, and cameos from Simon Pegg as Ogden, Hannah John-Kamen as F’Nale and Mark Rylance as Halliday helped give the movie a solid acting backbone. My personal favorite was Artemis - she was a real strong female character without any of the cliches that are usually attached to that mold. Overall, this movie is basically nerd paradise - making pop-culture the center of the universe is the dream. It’s got a lot of emotion and is enjoyable, and made well. The pacing is a little questionable, and it feels really long to sit through, which might make rewatching an issue. TJ Miller as i-R0k was honestly hilarious too, and he’s almost deserving of the win.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So Nolan Sorrento (Ben Mendelsohn) and IOI weren’t awful villains - they were the antithesis to what the gamers stood for. Makes sense. His final hesitant moment at the end, and his persistent tentativeness to get his hands dirty, made him believable as just a corporate money-seeker. F’Nale - I swear I never heard her name in the movie - was cool too, even if it was kinda sad to see her get OHKOed at the end. The Samantha birthmark thing was cool, and Wade’s aunt and uncle did die, so there are a few loose ends that were kinda glossed over. H (Lena Waithe) as a big dude was pretty funny too.",
    "tmdbId": 333339
  },
  {
    "id": "rise-of-the-planet-of-the-apes-2011",
    "title": "Rise of the Planet of the Apes",
    "releaseDate": "2011-01-01",
    "genres": [
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 7.4,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Sci-fi fans",
    "rewatchability": "It’s 1h45, weirdly paced",
    "bestCharacterWinner": "TBD",
    "review": "Pretty solid. Caesar is awesome. James Franco does a pretty great job as Will, and Caroline (Freida Pinto), Charles (John Litgow), and Dodge (Tom Felton) are a decent supporting cast. All the apes scenes were the highlights; I think Serkis needs big props for his performance. The motion capture and effects were all wonderful. It did get a little slow in the middle, but the message about the dangers of genetic modification is pretty relevant, and I think it was a good plot point. I felt like Charles’ arc didn’t need so much screentime, but you should definitely watch for the apes.",
    "reviewDate": "2024-01-15",
    "tmdbId": 61791
  },
  {
    "id": "rush-hour-1998",
    "title": "Rush Hour",
    "releaseDate": "1998-01-01",
    "genres": [
      "Comedy",
      "Action"
    ],
    "rating": 9.5,
    "classRecommendation": "Must Watch",
    "intendedAudience": "There’s a lot of non-PC offense to be found here for those looking for it, so you have to be able to look past that",
    "rewatchability": "Constantly",
    "bestCharacterWinner": "TBD",
    "review": "HILARIOUS. Whoever thought of putting Chris Tucker and Jackie Chan in a movie together is a certified legend. Everything about this movie SENDS. The 90s references, the physical comedy, the ostentatious dialogue, the music, it was all beyond hilarious. It makes fun of both Asian and American culture in equal measure, and the chemistry it finds is just great. It has action, it has comedy, it’s probably the ultimate popcorn flick.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Of course, Thomas being Juntao was a big ouch for Han, and he wasn’t a BAD villain, but the movie was obviously dominated by the underdog protagonists. The airport scene always has me rolling on the floor. And the last scene at the gate with the FBI guys? Quoted that for YEARS.",
    "tmdbId": 2109
  },
  {
    "id": "rush-hour-2-2001",
    "title": "Rush Hour 2",
    "releaseDate": "2001-01-01",
    "genres": [
      "Comedy",
      "Action"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "People who like comedy",
    "rewatchability": "You could watch once a week",
    "bestCharacterWinner": "TBD",
    "review": "Although this one doesn’t hold the same comedic significance in my heart as the first, it’s definitely nothing to scoff at. Funny as hell, Tucker and Jackie Chan combine again for an extremely amusing sequel, complete with more great music, fighting, and cultural adjustment. Hu Li (Zhang Ziyi) and Isabella (Roselyn Sanchez) provide good diversity in the cast, but the refined focus on the villains and the jumpy setting takes away from the magic of Lee and Carter. Still, their interactions are as golden as ever, and this is a popcorn flick if there ever was one.",
    "reviewDate": "2024-01-15",
    "tmdbId": 5174
  },
  {
    "id": "say-anything-1989",
    "title": "Say Anything…",
    "releaseDate": "1989-01-01",
    "genres": [
      "Romance",
      "Drama"
    ],
    "rating": 6.9,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Probably young adults who like romance movies",
    "rewatchability": "1h40, and is very comforting, but wouldn’t rewatch exactly",
    "bestCharacterWinner": "TBD",
    "review": "So this is the movie with the boombox outside the window. Not gonna lie, I was originally only watching for that scene, but it’s not even played up so much here. Still iconic though. This is a weird romance movie because it pretty much doesn’t have any of the classic tropes that we’re used to - it’s a regular guy and girl just hanging out for most of the movie. Lloyd and Diane Court (Ione Sky, awesome name, really cute) have really cute chemistry, and the writers manage to make the dialogue very conversable - you wouldn’t feel weird saying it to a friend. I think the subplot with Diane’s dad (John Mahoney) was pretty auxiliary, and Lloyd’s friends were really funny. So yeah, good movie to watch once - it’s comforting and subverts your romance expectations in a wholesome way.",
    "reviewDate": "2024-01-15",
    "tmdbId": 2028
  },
  {
    "id": "scent-of-a-woman-1992",
    "title": "Scent of a Woman",
    "releaseDate": "1992-01-01",
    "genres": [
      "Hollywood",
      "Drama"
    ],
    "rating": 7.8,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Adults, wouldn’t be bad in groups",
    "rewatchability": "Enjoyable, but 2h30 and emotional so once a year maybe",
    "bestCharacterWinner": "TBD",
    "review": "And the Academy Award goes to… was there ever any question? Al Pacino is just that guy. His chemistry with Charlie (Chris O’Donell), who’s a great main character in his own right, is awesome to follow throughout the story. His atmosphere, the “Hoo-Ah” humming, his dialogue delivery, his performance as a blind man… all on top. The moral lesson about integrity and believing in yourself is great, and there’s some really iconic scenes here. The supporting cast of Donna (Gabrielle Anwar, who’s gorgeous) and Frank’s family all help build his overall characterization, and the final speech as well as the last scene in New York are all-timers.",
    "reviewDate": "2024-01-15",
    "tmdbId": 9475
  },
  {
    "id": "seventh-son-2014",
    "title": "Seventh Son",
    "releaseDate": "2014-01-01",
    "genres": [
      "Action",
      "Fantasy"
    ],
    "rating": 6.7,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Fantasy movie fans",
    "rewatchability": "1h45, but effects are cool",
    "bestCharacterWinner": "TBD",
    "review": "Tom and Alice’s (Alicia Vikader) scenes together made up almost all of the good moments here, and I could rarely be asked to care about the plot. Kit Harrington’s cameo was cool, but I really couldn’t understand what Spook (Jeff Bridges) was saying throughout the whole movie. The effects were cool, with all the witches turning into massive birds, and Julianne Moore was okay as the antagonist, too.",
    "reviewDate": "2024-01-15",
    "tmdbId": 68737
  },
  {
    "id": "she-s-the-man-2006",
    "title": "She’s the Man",
    "releaseDate": "2006-01-01",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "rating": 6.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens, probably",
    "rewatchability": "Once in a couple months",
    "bestCharacterWinner": "TBD",
    "review": "Pretty fun, overall, but also pretty weird. The movie quality wasn’t all that impressive, and Bynes came on a bit hard at the beginning, but her portrayal of a boy was pretty funny, and the juxtaposition with Viola’s character was definitely a good contrast. There was a lot of good comedy, and Channing Tatum had decent chemistry with Bynes. The moral of girls being able to do anything guys can was probably progressive for the time, but is rather commonplace nowadays - regardless, it is meaningful, even if it ended up being a love story.",
    "reviewDate": "2024-01-15",
    "tmdbId": 9655
  },
  {
    "id": "shrek-2-2004",
    "title": "Shrek 2",
    "releaseDate": "2004-01-01",
    "genres": [
      "Family",
      "Comedy",
      "Fantasy",
      "Animated"
    ],
    "rating": 7.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, younger teens",
    "rewatchability": "It’s 1h45, but pretty engaging throughout",
    "bestCharacterWinner": "TBD",
    "review": "This movie is like the Pokemon Gold of animation. It’s better than the first in that it tones down its brashness while maintaining everything that made the first so original and iconic - the music, the satirical cliche-calling, and the heart. In particular, the characters in this movie were just outstanding. Shrek (Mike Myers), Fiona (Cameron Diaz), and Donkey (Eddie Murphy, who’s hilarious) are the mainstays, but The Fairy Godmother (Jennifer Saunders) was so entertaining that I almost gave her the win. Throw in notable character arcs for the King (John Cleese) and Puss in Boots (best character, SO funny) and a host of little fairy tale references, and you definitely have a fun experience. Also apparently Julie Andrews is the Queen, so yay. But yeah, everything is great. Still a little annoying, but that’s definitely intentional.",
    "reviewDate": "2024-01-15",
    "tmdbId": 769
  },
  {
    "id": "silver-linings-playbook-2012",
    "title": "Silver Linings Playbook",
    "releaseDate": "2012-01-01",
    "genres": [
      "Drama",
      "Romance",
      "Hollywood"
    ],
    "rating": 7.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, probably",
    "rewatchability": "Once in a couple years, it’s pretty emotional",
    "bestCharacterWinner": "TBD",
    "review": "2012 was probably Jennifer Lawrence’s prime, and even though I was a fan of her as a person, I never really understood why people considered her such a good actor - until I saw this movie. Not gonna lie, Tiffany is easily one of my favourite characters in recent memory, and JLaw’s performance is definitely winning and hella attractive. Bradley Cooper and Robert Deniro fill out the rest of the heavy hitters, and Chris Tucker and Anupam Kher are comic relief (which is fine, I guess). The chemistry between Pat (Bradley Cooper) and Tiffany is great, even if they don’t know it to start with, and it carries the movie. Deniro is obviously a good actor, but most of his arc was just the most annoying thing ever.",
    "reviewDate": "2024-01-15",
    "tmdbId": 82693
  },
  {
    "id": "slumdog-millionaire-2008",
    "title": "Slumdog Millionaire",
    "releaseDate": "2008-01-01",
    "genres": [
      "Drama",
      "Hollywood"
    ],
    "rating": 8.1,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Adults",
    "rewatchability": "It’s super story-based, so probably only once",
    "bestCharacterWinner": "TBD",
    "review": "Man, the acting in this one was definitely something. Even the child actors seemed to pile on the emotions. As adults, Latika (Freida Pinto) and Salim (Madhur Mittal) both did great as well, but their screen time was so limited that it wasn’t comparable to Patel. Anil Kapoor and Irrfan Khan did decent jobs as veteran actors in their respective roles too, considering they were effectively acting in a second language. The story itself is really great, and keeps the suspense building in a way that keeps the drama, fulfills some happiness for the audience and characters, but doesn’t break the “realism” that’s been established as the USP of this movie. Of course, Jamal, Salim, and Latika’s stories as orphans or “slumdogs” and their suffering might be portrayed in a manner that might seem completely unimaginable and detached from most western viewers, but such a story is seldom out of the public eye in developing countries - it’s good to see that they’re being recognized and elevated to a larger global audience.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The whole movie is pretty much spoilers, isn’t it? Pretty much every scene from Jamal’s childhood pays off during the game-show, and all the adult scenes are a part of the short arc in the present. My favourite was probably the whole ‘3 Musketeers’ motif that was going on - made the last scene super powerful. But also Jamal having the brain to realize that Prem, the host, was lying to him was definitely a power move (because a liar definitely knows a liar). But yeah, I like how Jamal never gives up on Latika. On paper, Salim’s character is so complex and messed up that it would be the best, but I don’t know how I’d feel about him if I was Jamal. Then again, that ending scene was pretty cool. And Jai Ho is nice.",
    "tmdbId": 12405
  },
  {
    "id": "snowden-2016",
    "title": "Snowden",
    "releaseDate": "2016-01-01",
    "genres": [
      "Hollywood"
    ],
    "rating": 7.3,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Adults",
    "rewatchability": "Wouldn’t, it’s a one-off and 2h15",
    "bestCharacterWinner": "TBD",
    "review": "So yeah I now have massive respect for this guy Edward Snowden. The movie’s basically a dramatic documentary, so there’s no real spoilers, but I felt like when they showed him at the end it was even better than seeing someone play him. Otherwise, Lindsay Mills (Shailene Woodley) was definitely a breath of fresh air in front of his dark and brooding lifestyle. The supporting cast was actually quite good: Corbin O’Brien (Rhys Ifans) was intimidating and cool, Glenn Greenwald (Zachary Quinto) was reassuring, Ewen MacAskil (Tom Wilkinson) and Laura Poitras (Melissa Leo) definitely showed off the best of journalism. But yeah more than the movie itself, which was cool (if a little slow), I just find it really impressive that someone actually did what Snowden did. Definitely an inspiration to the rest of the tech-types.",
    "reviewDate": "2024-01-15",
    "tmdbId": 302401
  },
  {
    "id": "soul-2020",
    "title": "Soul",
    "releaseDate": "2020-01-01",
    "genres": [
      "Family",
      "Drama",
      "Animated"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, younger teens",
    "rewatchability": "It’s 1h45, and not as smooth as you’d like, so maybe only a few times ever",
    "bestCharacterWinner": "TBD",
    "review": "So yeah, I guess it’s pretty interesting. The whole ‘soul’ premise is obviously vastly derivative from monotheist religions, and the whole ‘personality assignment’ does undermine individual accountability, even if it is a fun scene to watch. I particularly liked the fact that a bunch of really famous people were 22’s mentors. Joe (Jamie Foxx) was a decent lead, and his infatuation with jazz music was pretty well displayed. I guess I’m a little older than the target demographic for this movie, so it doesn’t really resonate as purely with me as it might with someone a little more impressionable.",
    "reviewDate": "2024-01-15",
    "tmdbId": 508442
  },
  {
    "id": "spencer-2021",
    "title": "Spencer",
    "releaseDate": "2021-01-01",
    "genres": [
      "Hollywood",
      "Drama"
    ],
    "rating": 6.9,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Adults, people who have lives that are too structured",
    "rewatchability": "Maybe once more when I’m an adult",
    "bestCharacterWinner": "TBD",
    "review": "Never thought I’d write that name in the winner’s column, but here we are. Kristen Stewart acts in this movie almost completely alone, and she’s actually phenomenal. She’s always been beautiful, but as an incarnation of everyone’s beloved Princess Diana, she gains the dignity and purity that will make anyone sympathetic to her struggles. Knowing that something similar to this happened in real life is only that much more impactful, and she pulls off the tragic helplessness brilliantly. The direction is actually amazing too - I usually like bright colours in a movie, but the filter that they put on the camera really fits the royal palette. The costumes are great, especially the one with the veil. Of course, the subject matter can be really really heavy, which is part of what makes this movie so important, but you also can’t rewatch too often. The bulimia scenes and the mass eating were both heartbreaking. The scenes with Diana and the kids are particularly endearing, and Maggie (Sally Hawkins) is a welcome surprise in the third act. The Anne Boleyn comparisons are interesting, but went a little over my head. Jack Farthing’s Charles is just so annoying, which means he’s probably about right. The end scene is really nice to watch, and I love how at peace she is - saying Spencer and taking back whatever ground she can is definitely really meaningful. I quite liked the movie, even if it made me pretty sad.",
    "reviewDate": "2024-01-15",
    "tmdbId": 716612
  },
  {
    "id": "spider-man-far-from-home-2019",
    "title": "Spider-Man: Far From Home",
    "releaseDate": "2019-01-01",
    "genres": [
      "Superhero",
      "Coming-of-age"
    ],
    "rating": 7.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "MCU fans, Action movie fans",
    "rewatchability": "2h, and pretty big twists, so once in a year",
    "bestCharacterWinner": "TBD",
    "review": "Just rewatched, and surprisingly enough, it’s pretty much the same as I remember it. Holland was great as Peter once again, obviously, and both Happy (Jon Favreau) and Aunt May (Marisa Tomei) were great as supporting cast. Betty (Angourie Rice) and Ned (Jacob Batalon) were cute, Nick Fury (Sam Jackson) and Maria Hill (Cobie Smulders) were fun too. MJ (Zendaya) wasn’t actually as iconic as in Homecoming, and she seemed a little too uncomfortable. The theme was great, and the plot was fine, but I felt like there was a little left to be desired from the story even though it ticked most of the right boxes—maybe I was looking for the same kind of heart that was in the first movie. Jake Gyllenhaal wasn’t bad either, but Tom Holland (and EDITH) really did have to carry this movie.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So Beck’s a villain. Pretty much everyone figured that, and I think even though it was obvious, his hero scenes were so much better than his villain scenes that I guess we kinda wished that he was a real hero. Then the business with Fury and Hill being Skrulls is cool but a little confusing, given that we don’t really know what they’re trying to do with that. Anyway, Iron Man’s shadow doesn’t just still rest over the MCU universe, but even their actual films, and I feel like he was the center of the story without even having been there. Not exactly ideal for the future of the universe. But again, Holland was cool. J Jonah Jameson’s cameo was awesome, and the cliffhanger was great.",
    "tmdbId": 429617
  },
  {
    "id": "spider-man-across-the-spider-verse-2023",
    "title": "Spider-Man: Across the Spider-Verse",
    "releaseDate": "2023-01-01",
    "genres": [
      "Superhero",
      "Coming-of-age"
    ],
    "rating": 7.6,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Literally however, it’s fun either way",
    "rewatchability": "Depends on preference",
    "bestCharacterWinner": "TBD",
    "review": "As a sequel, there’s basically nothing more you could ask for out of this. Following up Into the Spider-Verse was always gonna be a herculean task, and this sequel had a pretty good handle on what people loved about the original. A lot of the appeal of ITSV was that it looked and sounded incredible, and ATSV just casually one-upped maybe the most groundbreaking animated movie since Toy Story. The character progression is seamless too—Miles (Shameik Moore) is more confident and assertive, Gwen (Hailee Steinfeld) is given some much-needed depth and vulnerability, and the first ten minutes where she’s introduced are pretty much perfect.\n\nThe biggest issue holding the movie back is probably the pacing; the overload of random fluff and joke breaks is a far cry from the tight economy of runtime in the original. It sets up a bunch of stakes and conflicts and doesn’t really give any of them room to breathe because there’s so much being introduced. Gonna have to reserve more complete judgment until the next one is out, but as it stands, it feels like despite running (in gorgeously exhilarating fashion) over two hours, this movie doesn’t seem to really get anywhere.",
    "reviewDate": "2024-01-15",
    "tmdbId": 569094
  },
  {
    "id": "spider-man-into-the-spider-verse-2018",
    "title": "Spider-Man: Into the Spider-Verse",
    "releaseDate": "2018-01-01",
    "genres": [
      "Superhero",
      "Coming-of-age"
    ],
    "rating": 9.6,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Anything",
    "rewatchability": "Max twice a year",
    "bestCharacterWinner": "TBD",
    "review": "Not gonna lie, didn’t expect this to be any good at all - didn’t even bother watching it in the cinema. BIGGEST RIP EVER. Movie smashed everything ever. Miles is a protagonist that you want to root for and be friends with and BE (period). Completely relatable, and still comes off as original. Movie itself is beautiful, and they use the fact that it’s animated to their full advantage - lots of frames look like they’ve been taken straight from the comics. Worth watching purely for the visuals. Soundtrack slapped, but more on that below. Suffice to say, this movie ended the debate about who the best spiderman is - and it’s none of the ones that were considered before (sorry Tom Holland, ur cool). Regardless, LOTS of heart, and one for the ages. Only thing that would be cautioned is not to rewatch too frequently, or the emotional impact loses its value.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "I don’t think there’s a single character in the movie that wasn’t phenomenal. Villains killed it - Doc Ock was set up wonderfully and was a great variation from the Spiderman 2 “Octavius” dude. Kingpin was intimidating af, and Prowler managed to be believable as both an uncle and an assassin - his death was sad, but it was a great moment for both Miles’ and his dad’s development, and their relationship. ALL THE SPIDERMEN were iconic AF (exception being the pig, that one falls a little flat). Gwen and Miles had INSANE chemistry in every scene, and both Blonde and Fat Peter were standouts in their own ways. Weirdo spidermen did their job, and the third act did the movie justice. Scene with Miles jumping off the building in the night with music was the best scene, and that’s that.",
    "tmdbId": 324857
  },
  {
    "id": "spider-man-no-way-home-2021",
    "title": "Spider-Man: No Way Home",
    "releaseDate": "2021-01-01",
    "genres": [
      "Superhero",
      "Coming-of-age"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "General audiences",
    "rewatchability": "Depends on preference",
    "bestCharacterWinner": "TBD",
    "review": "Probably for the best that I got to writing this after the hype died down. First thing is that this movie is a LOT of fun in theaters, and at its best is genuinely magical to watch. Wraps up the Tom Holland trilogy reasonably well, but what holds it back (as with the other movies) is that it feels like it needs to take one step back for every two steps forward in Peter’s (Holland’s) arc, retreading points in his development out of fear of audience backlash. Supporting cast is great as always—Marisa Tomei really gets the chance to shine here as Aunt May, even if Ned (Jacob Batalon) and MJ (Zendaya) get a little sidelined to make way for all the MCU newcomers. In trying to be a perfect conclusion, No Way Home sometimes forgets to be a movie with any sort of meaning behind it—as in Endgame, the jokes, callbacks, and “now clap” moments tend to stifle the actual tension and emotion in the film’s own story. It’s great to see for the first time, but it just doesn’t have the kind of staying power that I’d hoped for.",
    "reviewDate": "2024-01-15",
    "tmdbId": 634649
  },
  {
    "id": "spirited-away-2001",
    "title": "Spirited Away",
    "releaseDate": "2001-01-01",
    "genres": [
      "Animated (Anime)",
      "Fantasy",
      "Coming-of-age"
    ],
    "rating": 8.8,
    "classRecommendation": "Must Watch",
    "intendedAudience": "This will scare the life out of little kids, so definitely like 15+",
    "rewatchability": "This is one of those once in a lifetime movies, so rewatch with a gap of like 4+ years",
    "bestCharacterWinner": "TBD",
    "review": "Straight up, this movie is creepy, but it’s beautiful. You have to watch it alone and without anticipation to get the full feel of it, but the story is really cool to watch. The setting and characters are super super weird, sometimes even scary, but I think that’s the point of the film—to explain that not everything around you is as bad as it looks, and that you shouldn’t judge entirely based on what you see. The relationship between Haku and Chiriho (Rumi Hiiragi) is really cute, and Lin (Yumi Tamai) is a pretty good complement to Chiriho too. And as great as the story is, the animation and the music of this movie are just in another world. First, every one of Haku’s scenes is wonderful cuz the guy just looks awesome. The setting and buildup are all great too, animation-wise. But THE MUSIC. The main piano theme for this movie is the BEST PIANO I have heard in my entire life. So if anything, just listen to that. But overall, this is definitely great. Won the Oscar for best animated movie, so there’s that too.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Haku looks awesome as it is, but DRAGON-HAKU? DUDE. Man is awesome. The twin grannys were creepy as hell, but also it was good to see them being brought down to their level by Chiriho. No Face was cool, if a little weird and unusual. The Baby was just weird. AND THE PARENTS. Chiriho’s parents are literally the worst parents in the world. That is all. But you will love this movie.",
    "tmdbId": 129
  },
  {
    "id": "superman-1978",
    "title": "Superman",
    "releaseDate": "1978-01-01",
    "genres": [
      "Superhero",
      "Family"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like retro movies, people who like superhero movies",
    "rewatchability": "It’s a classic, but 2h30",
    "bestCharacterWinner": "TBD",
    "review": "There’s no word for this movie other than classic. The theme itself is just breathtaking, and Christopher Reeve was perfect as Superman. His interactions with Lois Lane were great (and a little hilarious) and the tone of the movie fit his character a lot. Marlon Brando as Jor-El and Jene Hackman as Lex Luthor were decent cameos, even if Lex was a little more comical than I would have expected, because of his henchmen. The pacing of the plot was pretty offputting, but they did explain Clark’s origin in the most complete way, so new watchers won’t miss out. The last act is pretty interesting too, and helps redeem the plot from being too stagnant. So yeah, watch for the music and nostalgia.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Bro Lois is actually so thirsty in this, it’s so funny. Also how come Marlon Brando can’t pronounce Krypton? It’s pretty funny that nobody told him how it’s meant to be said. Anyway, yeah, that ending was pretty wild, huh? Nobody ever uses time travel so casually any more. But this guy was just like “nah it’s cool” and reversed time. Hilarious. Also the first scene with the floating diamond prison for Zod and co. didn’t age well, but I like how they set up their villains for the sequel already.",
    "tmdbId": 1924
  },
  {
    "id": "sword-in-the-stone-1963",
    "title": "Sword in the Stone",
    "releaseDate": "1963-01-01",
    "genres": [
      "Family",
      "Coming-of-age"
    ],
    "rating": 7.0,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Definitely kids",
    "rewatchability": "Multiple times a day, if you want",
    "bestCharacterWinner": "TBD",
    "review": "So yeah, this was just a really cute movie. 1963, and the 2D animation really really holds up, all things considered. The main spoiler for this movie is really pop culture by this point, but it has very little to do with the plot, and the movie focuses on preaching a pro-education message for their target audience. The scenes with the animal transformations are cool, and the squirrel scenes were especially funny - I had to give that crying squirrel the win, come on. That was precious. But yeah, Merlin (Karl Swenson) and Archimedes (Junius Matthews) had really funny banter throughout, and Arthur (Rickie Sorensen) was the perfect wide-eyed representative of the audience. Overall, it does have the antique disney feel, even if they couldn’t resist a few quirks with Merlin’s powers. Luckily for parents, there’s enough there for you to laugh about with your kids.",
    "reviewDate": "2024-01-15",
    "tmdbId": 9078
  },
  {
    "id": "ta-ra-rum-pum-2007",
    "title": "Ta Ra Rum Pum",
    "releaseDate": "2007-01-01",
    "genres": [
      "Family",
      "Drama",
      "Thriller",
      "Hindi"
    ],
    "rating": 8.8,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Kids, parents",
    "rewatchability": "It’s 2h30, but lots of action, songs, etc",
    "bestCharacterWinner": "TBD",
    "review": "Obviously I’m extremely biased with this one, because it’s one of my childhood movies. I grew up on this one. RV (Saif Ali Khan) and Radhika (Rani Mukherji) go from being confused young adults to struggling parents to finally getting their act together, and we get to see their whole journey. With princess (Angelina Indani) narrating, and the cute scenes featuring her and Champ (Ali Haji), their family dynamic is really wholesome and endearing. The second act of the movie does explore a lot of the struggles that Indian expats go through when they emigrate to the US, and showcases the trademark camaraderie that we’re so proud of. The friendship between RV and Harry (Javid Jaffrey), whose accent is virtually incomprehensible, but he’s hilarious, is one of the best parts of the movie. And of course, the songs and the racing. Almost all the songs and even the score are iconic to me, and the three races that they show are all really cool. RV’s struggles were devastating to watch as a kid, but the final race really made up for everything. Also Sasha was just so funny in her limited screen time that I had to give her the win, but Princess would probably have got it otherwise (her hairstyle is half of a win alone).",
    "reviewDate": "2024-01-15",
    "tmdbId": 14165
  },
  {
    "id": "tenet-2020",
    "title": "Tenet",
    "releaseDate": "2020-01-01",
    "genres": [
      "Hollywood",
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Teens and above; people who have patience for sci-fi and appreciate complex story-telling",
    "rewatchability": "You DEFINITELY need to watch this more than once to understand it completely",
    "bestCharacterWinner": "TBD",
    "review": "Yeah! Science! So after Avengers: Endgame I thought that I’d have had enough time-travel movies for a while. Turns out I was wrong - there’s no rejecting Nolan. So yeah, Tenet. Not gonna lie, didn’t understand everything (mostly because the version of the movie I saw wasn’t exactly the clearest), so I’m going to have to rewatch, just like everyone else who saw it the first time. That said, I did understand the plot, characters, score, etc. and they were all Nolan-esque as ever. I’d never heard of John David Washington before this role, but he’s actually a lot different from what I expected - in a good way. He comes off as likeable from the start, but still a kind of underdog. He’s got great chemistry with Neil (Robert Pattinson, who has redeemed himself as a great actor) and Kat (Elizabeth Debicki), both of whom could just as easily have been winners. Pattinson’s character always seems out of place throughout the story, and watching his arc unfold at the end of the movie is great to see. Kat and Andrei (Kenneth Branagh) have an interesting relationship too, providing most of the heavy-duty acting to the film. Supporting cast of Aaron Taylor-Johnson, Clemence Poesy, Michael Caine, Martin Donovan and Dimple Kapadia doesn’t hurt either. Of course, the score was great, loud in just the right places, though I think I wasn’t able to appreciate it to its utmost on first viewing. Otherwise, Nolan’s idea is once again entertaining as hell, pseudo-science to the core, and a must-watch for people who want a little confusion in their lives.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So that machine though. That’s probably my favourite part of the whole thing. The backwards bullets and all the scenes with the reverse shots - especially the ones where some people are inverted and others aren’t - are PHENOMENAL and look like they would be SUPER hard to film, so kudos. Neil having been from the future was definitely a good twist - even if time-travel veterans might think it obvious, it was done in a way that still made it valuable. Then the end scene with Kat diving off the boat was great too. Just Nolan things, you know? And of course the I AM THE PROTAGONIST scene was hella satisfying to watch.",
    "tmdbId": 577922
  },
  {
    "id": "terminator-2-judgement-day-1991",
    "title": "Terminator 2: Judgement Day",
    "releaseDate": "1991-01-01",
    "genres": [
      "Action",
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Action movie fans, Sci-fi fans, fans of the first one",
    "rewatchability": "Once a month",
    "bestCharacterWinner": "TBD",
    "review": "“I’ll be back.” Man wasn’t lying. This one is better than the first one, I can say that pretty confidently. It had everything that the first had (except maybe romance, which wasn’t a big deal) and it did it all better, and MORE. Super fun, for sure. The acting was great here too: Sarah Connor (Linda Hamilton) was again the best dramatic actor here, but Edward Furlong was actually great as John, both in comedic and dramatic scenes - his chemistry with Arnold was amazing. T-800 was great this time around, and Arnold did an even better job with his visual acting. His stale delivery is the only thing that stopped me from giving him the win, even if he gave us some really iconic lines in this one too. Supporting cast of Robert Patrick and Joe Morton, as T-1000 and Miles Dyson respectively, were both great too - T-1000 is straight up the stuff of nightmares, and Patrick is great in the role. Villains are unexpectedly great in this movie. So yeah, definitely a great action movie. If you liked the first one, or Die Hard and stuff, this is for you. Also the costumes in this one are to die for - whoever thought up the iconic Sarah Connor vest is a legend.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So yeah that end scene was pretty emotional, with T-800 dying. Making John a senator was a bit strange, but I get the message they were trying to offer in the end. Honestly Miles could have been MVP, since the dude was literally just a smart guy who ALSO cared about his family and was willing to sacrifice his work for the greater good. Everyone acted so well in this movie that it was that close, but the main cast definitely deserve recognition, and I chose Furlong since kid actors are hardly ever this good. The set piece at the end was the best, and I felt like the chase scene at the start wasn’t as fun as I hoped it would be. Sarah’s recurring visions were a little strange, and maybe her hospital time was a little much, but the break-out scene was SO satisfying. Also WHAT THE HELL is this movie’s deal with LICKING PEOPLE? Happened a whole TWO times, and it was just glossed over. So yeah apart from that, pretty solid.",
    "tmdbId": 280
  },
  {
    "id": "the-avengers-2012",
    "title": "The Avengers",
    "releaseDate": "2012-01-01",
    "genres": [
      "Action",
      "Superhero"
    ],
    "rating": 9.0,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Superhero fans, action movie fans, and pretty much everyone that enjoys any combination of the two",
    "rewatchability": "Pretty long, so maybe once in a couple months",
    "bestCharacterWinner": "TBD",
    "review": "Has there ever been a movie with such a memorable third act? The keystone of the MCU, and its first real world-banging movie, it’s really not hard to see why everyone loves this film. Even after having watched it dozens of times, its charm was still intact, mostly thanks to great acting from the whole cast (RDJ, Chris Evans, Chris Hemsworth, ScarJo, Jeremy Renner, Sam Jackson, Tom Hiddleston), but my latest rewatch shed light on Mark Ruffalo’s Bruce Banner, who comes in at a close second winner for this movie - although he does get overshone by a lot of other characters, his character and his part in the story are played beautifully. Hiddleston’s Loki is easily one of the most memorable villains in the superhero genre, with the British class really shining through, particularly in his conversation with Black Widow. Admittedly, the first act did not shine as much as the rest of the movie, with the second act grasping the audience’s attention and the third… well, the Avengers’ third act stands as one of the best third acts in action movie history (for me, anyway). The chemistry is certainly there, and Stark’s dialogue keeps things interesting even when the plot is moving slowly. Perhaps if the first act had been shorter, and the first scene omitted, bringing the runtime down to about 2 hours as opposed to 2.5, this movie would score even higher. However, this is made up tenfold by its sheer rewatchability - owing partly to Alan Silvestri’s unspeakably iconic score.",
    "reviewDate": "2024-01-15",
    "tmdbId": 24428
  },
  {
    "id": "the-big-short-2015",
    "title": "The Big Short",
    "releaseDate": "2015-01-01",
    "genres": [
      "Hollywood",
      "Thriller"
    ],
    "rating": 8.4,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Anyone who wants to know what happened in 2008",
    "rewatchability": "Every time you want to go into a career in finance",
    "bestCharacterWinner": "TBD",
    "review": "I now see why everyone hates Wall Street. Kinda glad I watched this in the end - they really do make money without adding any value to society. But yeah, this movie’s cast is INSANE: Michael Burry (Christian Bale), Jared Vennet (Ryan Gosling), Ben Rickert (Brad Pitt), in addition to Carrell. Then the supporting cast with Marissa Tomei, Jamie (Finn Whitrock), Charlie (John Magaro), Margot Robbie, Selena Gomez, Karen Gillan, Anthony Bodain, Richard Thaler, and a great performance from Vinny (Jeremy Strong). But yeah, this is definitely a tragedy, and between Bale and Carrell, they communicate just how sad it is spectacularly well. Gosling adds a lot of fire, and the celebrity cameos make all the jargon easier to understand. Great filmmaking, important subject-matter. That end scene where they’re walking through the empty stock exchange is really everything.",
    "reviewDate": "2024-01-15",
    "tmdbId": 318846
  },
  {
    "id": "the-bourne-identity-2002",
    "title": "The Bourne Identity",
    "releaseDate": "2002-01-01",
    "genres": [
      "Action",
      "Thriller"
    ],
    "rating": 7.1,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Action lovers, spy movie fans",
    "rewatchability": "Once in a couple years",
    "bestCharacterWinner": "TBD",
    "review": "The idea of the Bourne Identity isn’t bad in and of itself, just the execution of the movie was a bit flawed in my opinion. The action was undoubtedly the highlight of the film, with Bourne’s instinctive fighting style being extremely entertaining. The plot with Wombosi and several of the secret agents involved were quite disjointed, with there being too many subplots for the story to shine by itself. Marie (Franka Potente) had good chemistry with Damon, and his dialogue and acting carried the film. Overall, you probably wouldn’t go to the theatre to watch this, but if there was nothing else on TV, then maybe.",
    "reviewDate": "2024-01-15",
    "tmdbId": 2501
  },
  {
    "id": "the-chronicles-of-narnia-prince-caspian-2008",
    "title": "The Chronicles of Narnia: Prince Caspian",
    "releaseDate": "2008-01-01",
    "genres": [
      "Coming-of-age",
      "Fantasy",
      "Family"
    ],
    "rating": 7.6,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Rewatch Time:",
    "rewatchability": "WINNER: Prince Caspian (Ben Barnes)",
    "bestCharacterWinner": "TBD",
    "review": "Narnia might not be the most popular series, but I will say one thing - it has a magic that’s seldom repeated in other fantasy movies. The original Pevensie kids return in this one, Peter (William Moseley) staying as stubbornly arrogant as ever, Susan (Anna Popplewell) a little better than last time, Edmund (Skandar Keynes) a lot cooler but less important, and Lucy (Georgie Henley) who smashes it again. The supporting cast of Trumpkin (Peter Dinklage) and Nikabrik (Warwick Davis) along with Aslan (Liam Neeson) is definitely formidable, but Caspian’s charm and compelling story steals the show. It’s definitely hard to sway the audience away from their favourite heroes, but this movie manages it quite well. You can just tell that Peter and Susan don’t quite believe in Narnia’s magic as they used to, and their arcs are completed perfectly by the ending, as is Caspian’s. The music is great as usual, and the effects are amazing for their time. If anything, the movie might be a bit too long, and the sustained focus on the Telmarines takes a little away from the story.",
    "reviewDate": "2024-01-15",
    "tmdbId": 2454
  },
  {
    "id": "the-chronicles-of-narnia-the-voyage-of-the-dawn-treader-2010",
    "title": "The Chronicles of Narnia: The Voyage of the Dawn Treader",
    "releaseDate": "2010-01-01",
    "genres": [
      "Fantasy",
      "Coming-of-age",
      "Family"
    ],
    "rating": 7.5,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, adults who like fantasy",
    "rewatchability": "Super nostalgic, once in a couple years",
    "bestCharacterWinner": "TBD",
    "review": "For the longest time, I can only remember hating Eustace’s character from this movie. On rewatching, it turns out that he’s actually got the best journey. And that’s really what Narnia’s all about - turning annoying kids into heroes and friends. The idea that Peter and Susan are too old to return, and Lucy (Georgie Henley) and Edmund (Skandar Keynes) are having their final adventure as kids is really heartbreaking, but keeps with the whole ‘imagination is for the young’ and ‘passing on the torch’ themes that Narnia has always been about. Ben Barnes’ Caspian is once again super charismatic, as is Liam Neeson’s Aslan. Simon Pegg’s Reepicheep (the mouse) is cute and is important to Eustace’s storyline. The music is phenomenal, the sets and costumes are awesome, and the first scene with the painting is iconic.",
    "reviewDate": "2024-01-15",
    "tmdbId": 10140
  },
  {
    "id": "the-da-vinci-code-2006",
    "title": "The Da Vinci Code",
    "releaseDate": "2006-01-01",
    "genres": [
      "Action",
      "Drama",
      "Thriller"
    ],
    "rating": 8.6,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Not kids, maybe not super conservative Christians",
    "rewatchability": "Once a year, max",
    "bestCharacterWinner": "TBD",
    "review": "I’d always heard a lot about this movie/book series, but I never got around to watching it until just now, and I’m happy that I finally did. As an adventure film (treasure-hunting type), it’s one of the best I’ve ever seen, taking inspiration from all kinds of history and mythology. The cast is pretty great, with Tom Hanks as Robert Langdon, Ian McKellen as Leigh Teabing, and Paul Bettany as Silas (who was great from an acting perspective). Jean Reno and Alfred Molina played good supporting roles, and Audrey Tatou is officially the best looking french person I know. Her chemistry with Hanks is great, and it’s definitely fun to watch her hold her own beside such a talented actor. In terms of the movie’s rewatchability, I’m not sure, since I’ve only seen it the one time, but that’s the thing about adventure movies - the twists are great the first time around, less so after. But I can tell that the author really did think the plot through wonderfully, giving all the characters reasonable motivations. Music was really good, the cinematography was fun to watch since they were in France and London. And despite all the possible blasphemy of the film, its moral does hold up regardless of the beliefs of the viewer.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So the twists in this film are good, but I was able to predict all of them (maybe because I watch a lot of mystery, idk). Teabing as Teacher wasn’t a bad idea, and having Sophie be the holy grail in the end was a great idea, so both of those are understandable. This film really does build tension well for all the twists, which makes them even more effective. Solid watch.",
    "tmdbId": 591
  },
  {
    "id": "the-devil-wears-prada-2006",
    "title": "The Devil Wears Prada",
    "releaseDate": "2006-01-01",
    "genres": [
      "Hollywood",
      "Drama",
      "Comedy"
    ],
    "rating": 6.6,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Adults",
    "rewatchability": "It’s about 2h, probably wouldn’t",
    "bestCharacterWinner": "TBD",
    "review": "So yeah, Anne Hathaway is Andrea, the assistant to Meryl Streep’s Miranda Preesly - a big time fashion designer - even though she wants to be a journalist. The movie is basically saying not to let your job pull you away from what’s REALLY important (friends, family, your interests, etc.) and to have the strength to know when to stop. Simultaneously it argues to be confident and open-minded to new opportunities, and that happiness will inevitably find you. All good. Emily Blunt’s character is hilarious in every way, definitely the high point of the movie.",
    "reviewDate": "2024-01-15",
    "tmdbId": 350
  },
  {
    "id": "the-dictator-2012",
    "title": "The Dictator",
    "releaseDate": "2012-01-01",
    "genres": [
      "Hollywood",
      "Comedy"
    ],
    "rating": 8.1,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Adults, teens",
    "rewatchability": "Every day, it’s just comedy",
    "bestCharacterWinner": "TBD",
    "review": "Man, this movie. On one hand, it’s absolutely hilarious. The commentary on America and democracy through Cohen’s standard avatar frankness is definitely what makes it work. Anna Faris, Ben Kingsley, Jason Mantzoukas, and a lot of subtle cameos from other celebrities (and their lookalikes) are a solid accompaniment to Cohen’s anchoring performance. And how about that ‘Next Episode’ arabic theme? Still stuck in my head. So yeah, just super funny. Decent plot progression, too. But it’s also super offensive to anyone who treats it as anything other than a satire, so keep that in mind.",
    "reviewDate": "2024-01-15",
    "tmdbId": 76493
  },
  {
    "id": "the-fault-in-our-stars-2014",
    "title": "The Fault in Our Stars",
    "releaseDate": "2014-01-01",
    "genres": [
      "Drama",
      "Romance",
      "Coming-of-age"
    ],
    "rating": 8.4,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Good for all ages above maybe 15",
    "rewatchability": "Quite emotional and 2 hours+, so maybe once in a couple years",
    "bestCharacterWinner": "TBD",
    "review": "Ever just want to get in the feels? This is the movie you’ve been looking for. It’s got a tragic love story, two charming young characters with great chemistry, lots of cancer, parent issues, and some death. The imagery that the movie tries to represent is really what makes it special, and it highlights how idealistic teens can really be - it discusses the positives and negatives from this hopefulness in a way that’s really nice to watch. And the characters are hella cute. Obviously, Augustus Waters is an absolute legend, but his chemistry with Shailene Woodley’s Hazel Grace made most of the movie. Nat Wolff, Laura Dern, and Willem Dafoe all put in powerful supporting performances, and overall it was a great emotional journey to go on.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "It also deserves credit that such a sad movie can get me howling with laughter, but the scene with the egg-throwing at the car was hilarious, and cemented Augustus as a top-tier character. Also Lotte Verbeek is strangely attractive in this movie, but I’m not really complaining.",
    "tmdbId": 222935
  },
  {
    "id": "the-garden-of-words-2013",
    "title": "The Garden of Words",
    "releaseDate": "2013-01-01",
    "genres": [
      "Romance",
      "Coming-of-age",
      "Anime"
    ],
    "rating": 8.0,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Highschool teens, college kids",
    "rewatchability": "It’s 45m long, but it’s quite emotional, so maybe once every few years",
    "bestCharacterWinner": "TBD",
    "review": "Man, I love Shinkai - he just can’t make a bad movie. This is literally 45 minutes long, and it’s more significant than a lot of the feature-length movies I’ve seen. This one goes out to all those kids who had a crush on that one teacher in school, or on that one adult who saw you as a kid. I feel like I can’t do it justice by explaining it, but the chemistry between Yukino and Takao (Miyu Irino) is so authentic and relatable that you start to root for them even though there’s 12 years of an age difference and he’s a minor (the movie is fully legal though, don’t worry). But yeah, the music, the animation, the characters, the motifs… Shinkai just knocks it all out of the park. And although there might be some weirder elements in this particular film, it’s definitely got the heart to back it up.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Man, that last scene. I feel like I say that a lot, but Shinkai, so bear with me. Massive props to the voice actor for Yukino when she cried out and gave Takao the hug at the end - I got goosebumps at the voice. Great acting. The reveal that she was a teacher did surprise me, but I guess it did make sense. The whole ‘tanka’ poem callback from her being a English Literature teacher was really beautiful too, fitting in with the whole ‘garden’ aspect of the movie. And it’s just so funny to watch a teacher and a kid talk about drinking in the morning while they skip school. But yeah, that last scene when Takao is yelling at her and she’s crying… fabulous. And the post credits of him leaving the shoes for her in the park was a great ending too. Solid. Would definitely watch a longer version.",
    "tmdbId": 198375
  },
  {
    "id": "the-godfather-1972",
    "title": "The Godfather",
    "releaseDate": "1972-01-01",
    "genres": [
      "Drama",
      "Hollywood"
    ],
    "rating": 8.8,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Not kids, and teens probably wouldn’t appreciate it",
    "rewatchability": "Once a year, maybe",
    "bestCharacterWinner": "TBD",
    "review": "From a critical point of view, it doesn’t surprise me that this movie is considered one of the greatest of all time. The storytelling was notable, even if the initial wedding scene was tediously lengthy. Between Marlon Brando and Al Pacino, the Corleone Family stands as one of the most iconic gangster families ever, and I had the hardest time deciding the winner, which came to Brando’s delivery and presence (even if Michael Corleone was my personal favorite). The supporting characters (Sonny, Tom, Sollozzo, etc.) were pretty solid too. The world-building was brilliant, and the parallels of the first and last scene make it clear to the audience that the directors knew what they were doing.",
    "reviewDate": "2024-01-15",
    "tmdbId": 238
  },
  {
    "id": "the-godfather-part-ii-1974",
    "title": "The Godfather: Part II",
    "releaseDate": "1974-01-01",
    "genres": [
      "Drama",
      "Hollywood"
    ],
    "rating": 8.4,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Not kids, and teens probably wouldn’t appreciate it",
    "rewatchability": "3",
    "bestCharacterWinner": "TBD",
    "review": "The second godfather isn’t as good as the first, but is refreshing in that its strengths stem both from those of its predecessor and have an element of uniqueness. The inclusion of Robert Deniro as a young Vito Corleone as masterful, and his portrayal made my choosing a winner for this movie almost as hard as the previous film. The story was far less contained than in the previous film, which is saying a lot, especially because this one is 3.5 hours long, and doesn’t have Marlon Brando. That said, Michael’s character arc is continued to perfection, showing us the detriments of his time as Don, and the effect on the Corleone Family.",
    "reviewDate": "2024-01-15",
    "tmdbId": 240
  },
  {
    "id": "the-good-the-bad-and-the-ugly-1966",
    "title": "The Good, the Bad, and the Ugly",
    "releaseDate": "1966-01-01",
    "genres": [
      "Hollywood",
      "Action"
    ],
    "rating": 7.5,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids, adults",
    "rewatchability": "3h, but a classic",
    "bestCharacterWinner": "TBD",
    "review": "WOOH! That score is just wonderful. If you’ve never heard it (which should be impossible), go do that now. Iconic if there ever was a real definition for the word. The main cast was all phenomenal in their roles: The Man With No Name (Clint Eastwood) was the Good, Angel Eyes (Lee Van Cleef) was the Bad, and Tuco was the Ugly, but there wasn’t too much separating them. Each one of them could hold a screen by themselves. Also, can I just say, if this was a show instead of a 3h movie, it would DEMOLISH all the streaming services. This is basically the Mandalorian oozing with charisma (granted, with less Star Wars references). The Civil War backdrop was interesting, but also a little distracting, but the main arc of the characters was quite entertaining. The Music. Definitely a classic.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So many iconic scenes for this one. The showdown at the end was awesome - Blondie kept faking people out, it was pretty funny. The absolute end when he came back to free Tuco after almost forcing him to hang himself (payback for the desert torture) was definitely cool. The grave finding scene with the score in the back was absolutely enjoyable. And damn, the shooting display was awesome. Great chemistry all around, too. Tuco’s acting was really great, and it’s so impressive how the movie holds up even 60 years after its release.",
    "tmdbId": 429
  },
  {
    "id": "the-greatest-showman-2017",
    "title": "The Greatest Showman",
    "releaseDate": "2017-01-01",
    "genres": [
      "Drama",
      "Hollywood"
    ],
    "rating": 7.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids can watch, it’s pretty wholesome",
    "rewatchability": "Once a year, maybe",
    "bestCharacterWinner": "TBD",
    "review": "Everyone loves an underdog. Everyone loves a big heart. But an underdog with a big heart? With the face of Hugh Jackman? Love isn’t enough. This movie’s soundtrack is one of the best I’ve heard, and it has a crazy good plot for a musical. There’s a lot of heart, there’s chemistry, there’s character development. I don’t remember there being much wrong with this movie, to be honest. The only thing was that it didn’t really have any iconic or mindblowing kind of moments that helped it stand out.",
    "reviewDate": "2024-01-15",
    "tmdbId": 316029
  },
  {
    "id": "the-hobbit-an-unexpected-journey-2012",
    "title": "The Hobbit: An Unexpected Journey",
    "releaseDate": "2012-01-01",
    "genres": [
      "Fantasy",
      "Action"
    ],
    "rating": 7.0,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like fantasy, lord of the rings",
    "rewatchability": "It’s mostly jovial, but 3h",
    "bestCharacterWinner": "TBD",
    "review": "I feel like this captures the right feeling, hitting all the nostalgic spots for Lord of the Rings fans and exploring all aspects of the great world and characters it introduces. But it’s also 1/3rd of a series, and it’s 3 hours long - they waste so much time. Highlights include Elrond (Hugo Weaving), Gandalf (Ian McKellen), Thorin (Richard Armitage), and Gollum (Andy Serkis). Music and sets were obviously wonderful, costumes were cool, and even the emotional storytelling wasn’t bad, but it just took way too long with so few events. Also the many callbacks might make it seem like a rehash of the original series. Big fan of Freeman’s Bilbo though, who’s really funny and charming.",
    "reviewDate": "2024-01-15",
    "tmdbId": 49051
  },
  {
    "id": "the-hunchback-of-notre-dame-1996",
    "title": "The Hunchback of Notre Dame",
    "releaseDate": "1996-01-01",
    "genres": [
      "Romance",
      "Drama",
      "Animated",
      "Family?"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Could be anyone; this is more an ideological movie than anything else",
    "rewatchability": "1",
    "bestCharacterWinner": "TBD",
    "review": "So I think french people are quite good at writing stories. This one in particular is really cool because its main character actually doesn’t have most of the protagonist-type tropes. That said, Quasimodo (Tom Hulce) is a really likeable hero, and Frollo (Tony Jay) is a completely despicable villain. Esmeralda steals the show in terms of agency and personality, and Phoebus’ (Kevin Kline) one-liners are SO GOOD that I almost considered him winning just because of that. Music was phenomenal, and the plot was great too. The story isn’t so far-fetched that you might even believe it happening in real life, which makes it that much scarier. Definitely one of the more real disney films, even though the supporting cast of talking gargoyles were pretty hilarious.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "So Esmeralda has a little too good chemistry with everyone, because everyone’s in love with her - Quasimodo not ending up with her was an interesting choice, but also a little sad to think about. Frollo’s solo song was actually great for character, and the final scene was great character work. Phoebus was cool, but I feel like maybe he didn’t really need to exist? The scene with Quasimodo in the festival was great too. All-around very well done.",
    "tmdbId": 10917
  },
  {
    "id": "the-imitation-game-2014",
    "title": "The Imitation Game",
    "releaseDate": "2014-01-01",
    "genres": [
      "Drama",
      "Thriller"
    ],
    "rating": 8.4,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Pretty much anyone, maybe barring little kids",
    "rewatchability": "Probably every nine months or so",
    "bestCharacterWinner": "TBD",
    "review": "The role of Alan Turing draws on the same part of Cumberbatch’s acting as Sherlock Holmes or Doctor Strange (arrogant, unlikeable genius) while still making you want to root for him, for some reason. Whenever Turing was being a jerk to his colleagues, I was a little torn between being on their side and wanting to see his unique way of tackling a problem play out. Keira Knightley is also great, though it would’ve been nice if her character had had more to do. Then again, this movie is set during World War II, so I can see how the filmmakers struggled with that. The score is great, and was actually nominated for an Oscar before losing out to another score by the same composer, which kind of says all that needs to be said. The movie overall is ALL ABOUT THE SECRETS (makes sense), and as such can get pretty depressing despite a reasonable amount of levity. Turing’s sexuality is handled pretty well, if not completely accurately. To be honest, most of this movie took a few liberties with regard to history, but it all works to make the film better, so I’ll allow it. I’m pretty sure there’s a Game of Thrones actor in there somewhere too.",
    "reviewDate": "2024-01-15",
    "tmdbId": 205596
  },
  {
    "id": "the-incredibles-2004",
    "title": "The Incredibles",
    "releaseDate": "2004-01-01",
    "genres": [
      "Family",
      "Superhero",
      "Animated"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, teens, adults",
    "rewatchability": "It’s around 2h, but I remember I used to watch it almost once a month",
    "bestCharacterWinner": "TBD",
    "review": "Ah, the Incredibles. It was so good that they made a sequel 14 years after. There really is nothing more to say, is there? The characters were all SO nuanced and believable, with SO MUCH iconic dialogue and SO MANY iconic scenes. Who thought a family superhero movie would be what we wanted? Still great, even if the animation has gotten out of style. Honestly, Holly Hunter’s little speech pattern thing itself made Helen so much more real as a person, Violet was the perfect reclusive highschooler, Dash was a real annoying younger sibling, and Bob’s character flaws made the movie. Of course, the supporting cast of Lucius/Frozone (Samuel L Jackson, who’s amazing as usual), Syndrome (Jason Lee, who’s actually a well-crafted villain), and Edna (absolute scene-stealer) are just gems of performances too. So yeah, there’s always some kind of tension in the plot to keep things moving, and there’s lots of comedy too. Overall absolutely solid watch for superhero fans.",
    "reviewDate": "2024-01-15",
    "tmdbId": 9806
  },
  {
    "id": "the-irishman-2019",
    "title": "The Irishman",
    "releaseDate": "2019-01-01",
    "genres": [
      "Hollywood"
    ],
    "rating": 6.5,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Old people, film critics",
    "rewatchability": "Never",
    "bestCharacterWinner": "TBD",
    "review": "So this is probably the longest movie in history. Three and a half hours long, and there’s pretty much no reason for it to be - the whole last half hour is pointless as hell. Plot-wise, there isn’t really that much going on either - it really looks like it’s trying to be like the Godfather. They definitely have a talented enough cast (Robert de Niro, Al Pacino, Joe Petsci, Bobby Cannavale, Anna Paquin), but it’s really really tedious to sit through - nearly impossible for one sitting. The music was notably pretty good - because Scorsese is Scorsese - and the acting was as one would expect from these distinguished thespians. The ending was pretty upsetting, but in a ‘wth-was-that-for’ kinda way.",
    "reviewDate": "2024-01-15",
    "tmdbId": 398978
  },
  {
    "id": "the-lion-king-1994",
    "title": "The Lion King",
    "releaseDate": "1994-01-01",
    "genres": [
      "Coming-of-age",
      "Family (Animated)"
    ],
    "rating": 9.6,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Meant for kids, and teaches them a lot",
    "rewatchability": "As a kid, you can rewatch pretty much every day, except for some trauma",
    "bestCharacterWinner": "TBD",
    "review": "The crown jewel of Disney and animated cinema as a whole, the Lion King is and will likely stay as the essential childhood movie. The opening itself is one of the most iconic in cinema history, with the cultural representation of Africa really shining through at first, followed up by the masterful “Circle of Life”. For an animated movie, the performances were also unbelievable, making it almost impossible for me to pick a winner. Between Jeremy Irons’ Scar - one of the most Shakespearian villains of all time - Rowan Atkinson’s Zazu, John Kani’s Rafiki, Matthew Broderick’s Adult Simba, and Nathan Lane and Ernie Sabella’s Timon and Pumbaa, there were almost no non-iconic characters in the film. Given that it was based off of Hamlet, it isn’t all that surprising that the film’s plot is well crafted and meaningful, but it is also masterfully complemented with some of the most tasteful songs in cinema history, perfectly capturing the characters’ moods and themes as the film progressed (“I Just Can’t Wait to Be King”, “Hakuna Matata”, “Can You Feel The Love Tonight”). With lots of creative input and imagery slotted in for older viewers, this movie leaves absolutely nothing to want, with every scene seemingly flawless - it will definitely always be one of the greats for me, even if my childhood nostalgic bias is in effect.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Honestly, as mind-blowing as the film is, it has remained one of the most iconic pieces of cinema in history because of one bold scene - Mufasa’s death. Such an unexpected moment in a children’s movie was really a stroke of genius, allowing parents to introduce their children to the idea of death together as Simba’s understanding grows, and the “Circle of Life” theme giving them a constructive yet realistic understanding of a normally ghastly idea.",
    "tmdbId": 8587
  },
  {
    "id": "the-little-mermaid-1989",
    "title": "The Little Mermaid",
    "releaseDate": "1989-01-01",
    "genres": [
      "Family",
      "Coming-of-age",
      "Animated"
    ],
    "rating": 7.8,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Kids",
    "rewatchability": "1h30",
    "bestCharacterWinner": "TBD",
    "review": "UNDA DA SEA. This movie isn’t perfect, but watching it fully in 2021 for the first time, I’m so happy to see what high quality movies we had around us as kids. Ariel is pretty impulsive and easy to fall in love, but apart from that she’s a likeable protagonist, and the way she’s animated is really iconic. Jodi Benson’s voice is just so amazing as well, and Part of Your World is such a dreamy song that most kids can relate to. King Triton (Kenneth Mars) is actually a good parent throughout, and Sebastian plays the Mushu role of escorting the protagonist through the plot with lots of comic relief. Prince Eric (Christopher Daniel Barnes) is super handsome, and his character isn’t bad, having been fixated on finding the owner of Ariel’s beautiful voice. I’m a huge fan of his butler Grimsby (Ben Wright) also. The plot pacing, animation, songs, score, side characters, and dialogue were all held to a REALLY high standard, and I think it’s probably right that this is considered the start of Disney’s golden age of animated movies.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Wow, so Ariel giving away her voice was interesting, even if it’s a REALLY BAD DEAL to take along with the servitude thing. Her fish out of water scenes were cool, and Kiss the Girl with Eric was a really beautiful scene. Yay Sebastian. Now Ursula (Pat Carroll) obviously didn’t have the clearest motivations, but she was definitely really scary and her voice + design were both on point. Her turning into a massive monster and getting impaled by a ship was pretty stupid though. Also having Eric kill her seems undeserved, but I guess Ariel was a little indisposed. The mind-control voice stuff was pretty unnecessary I think, and it would have just been better to have Eric WANT to marry the person with that voice. Also Triton swapping in for Ariel was a really nice scene, just like the ending where she gets legs again.",
    "tmdbId": 10144
  },
  {
    "id": "the-little-prince-2015",
    "title": "The Little Prince",
    "releaseDate": "2015-01-01",
    "genres": [
      "Coming-of-age",
      "Family (Animated)"
    ],
    "rating": 8.5,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, primarily",
    "rewatchability": "Only a little longer than 1",
    "bestCharacterWinner": "TBD",
    "review": "This may be the best thing ever created by French people. A stellar cast of Mackenzie Foy, Rachel McAdams, Jeff Bridges, Marion Cotillard, James Franco, Ricky Gervias, Paul Rudd, and Benecio del Toro should be enough to get you to watch any film - and the animation doesn’t take away from the emotion. The portrayal of contemporary education is hurtfully realistic, and the theme that children should be encouraged to facilitate their imaginations is both beautiful in planning and execution. The friendship between the little girl and the aviator can inspire emotion in even the most stone-faced audiences, and as remarkable as their plotline is, the Little Prince himself takes the crown for me. His story and character perfectly portray the innocence and purity of childhood, and his idealism will make everyone wish that they’d taken just a little longer to grow up. Throw in some well-placed music and decent visuals, and the heart of the movie gets fair treatment - definitely worth a watch.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The ‘school’ plot was a decent opener to the film, but wasn’t exactly consistently followed-up until the very end. Not really anything to complain about, since it left more time for the little girl to find the little prince, and ending both of their character arcs together was particularly impactful. The sunrise motif was visually and thematically a wonderful inclusion too, and the fox proved to be a pretty funny comedic aid.",
    "tmdbId": 254904
  },
  {
    "id": "the-matrix-reloaded-2003",
    "title": "The Matrix Reloaded",
    "releaseDate": "2003-01-01",
    "genres": [
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 7.3,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens, Adults",
    "rewatchability": "2h, but feels a bit long at times",
    "bestCharacterWinner": "TBD",
    "review": "Better than I thought it would be, honestly. People don’t give this one enough credit - it keeps up the spirit of the first and builds on the world and the lore in wonderful fashion. If anything, maybe they spent a little too much time on those little matrix-y things that made the plot a little less linear than we would have liked. The action scenes were iconic in genuine matrix style, but they were a little too long for my taste as well, and shorter fights would have made for better pacing and lesser runtime, both of which would be the main areas of improvement here. Still, the plot was catchy and interesting, and definitely keeps you on your toes. Acting-wise, I can’t decide if everyone was good or okay, but Neo (Keanu Reeves), Morpheus (Lawrence Fishburne) and Trinity all did great with the dialogue they were given. Costumes were also awesome as usual. Supporting acts from Smith (Hugo Weaving), Persephone (Monica Bellucci), and Merovingian (Lambert Wilson) were all fun and entertaining, while Niobe (Jada Pinkett Smith) provided some star power. The “program” supporting actors also did a pretty great job playing non-humans, in my opinion.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "I really liked how they made some programs not evil - it explained the origin of the Oracle from the first movie and the Keymaker and Architect from this one. Definitely cool. Neo’s new powers are pretty dope. I guess the ending cliffhanger is pretty annoying, especially since now I have to watch another 2h movie, but it’s definitely a good marketing technique. Guess I’m watching Revolutions now.",
    "tmdbId": 604
  },
  {
    "id": "the-matrix-revolutions-2003",
    "title": "The Matrix Revolutions",
    "releaseDate": "2003-01-01",
    "genres": [
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 7.5,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens, Adults",
    "rewatchability": "2h, but feels a bit long at times",
    "bestCharacterWinner": "TBD",
    "review": "As far as sci-fi thrillers go, this one is pretty definitive. It has the exact same flaws as its immediate predecessor (overall length, battles were too long, pacing) but has the X-factor of actually having an ending, which is always nice. A lot of character arcs are also fulfilled in this one, particularly for minor characters, which we love to see. Keanu Reeves is just as good as Neo, but once again I prefer Moss’ acting style (they both lean toward less visual acting, but her performance seemed more lively) as a lead. Morpheus (Lawrence Fishburne) was unfortunately sidelined, while Niobe (Jada Pinkett-Smith) was awesome in this one. Monica Bellucci’s Persephone was wasted, but Hugo Weaving probably played his best Smith in this iteration. So yeah, it’s definitely a solid ending to the series, even if the finer details are hazy if you think about them too much.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "There’s SO much Jesus imagery going on with Neo at the end. The final fight ends in a pretty weird way, since everyone just explodes - I didn’t understand why Neo gave up and then Smith died. But the Oracle definitely pulled through in this one; great arc for her. I did really like both the surface scenes with Neo and Trinity as well as Niobe’s driving, but the main fight in Zion was mostly chaos. Still, the bit with Mifune and the kid was great. There really are a lot of notable actors in this movie; I recognized two from the Power Rangers series alone, so make of that what you will. But yeah, the final compromise between Neo and the machines seems a little tentative, but it works as an end to his arc.",
    "tmdbId": 605
  },
  {
    "id": "the-nanny-diaries-2007",
    "title": "The Nanny Diaries",
    "releaseDate": "2007-01-01",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "rating": 6.5,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "People who like hollywood comedies",
    "rewatchability": "Probably wouldn’t",
    "bestCharacterWinner": "TBD",
    "review": "So I pretty much only watched this for the Scarlett Johansson and Hayden (Chris Evans) chemistry before the MCU. Turns out that that’s the only watchable part of this movie. The end scene with her yelling at the parents was pretty great too, and I think Scarlett gets the short end of the stick for her acting. Chris Evans was pretty great as usual, but the little kid was annoying, and the parents were just the worst, and Annie’s friends weren’t too exciting either. Pretty tedious plot.",
    "reviewDate": "2024-01-15",
    "tmdbId": 12435
  },
  {
    "id": "the-prince-of-egypt-1998",
    "title": "The Prince of Egypt",
    "releaseDate": "1998-01-01",
    "genres": [
      "Family(?)",
      "Animated",
      "Historical/Faith"
    ],
    "rating": 8.5,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Works well with anyone who’s willing to keep an open mind and enjoy a story",
    "rewatchability": "Three times a year, maybe",
    "bestCharacterWinner": "TBD",
    "review": "Obviously, I’m not Jewish, and I’m not too into “faith” as it is, but there’s no denying that the story of Moses (at least as told in this movie) is beautiful. The relationship between Moses and Ramses (Ralph Fiennes) was extremely powerful and was the emotional basis for the entire movie, and even though Set I (Patrick Stewart) was objectively ruthless, both his and Ramses’ actions were understandable in their own twisted ways. The incorporation of Zipporah (Michelle Pfeiffer) to the plot as Moses’ catalyst was great, as was the occasional shift to Miriam’s (Sandra Bullock) point of view. Overall, the music was another highlight of the movie—hebrew chanting is really nice to hear, and the “deliver us” theme was actually great. Aaron’s (Jeff Goldblum) arc wasn’t bad, and was the most believable in my opinion, even if he was meant to be some kind of a bystander. So overall, if you can treat a little religious propagation as a learning experience, you’ll find that this is actually a great movie to watch for all ages.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Watching Moses go from the child of slaves to an ignorant prince to the prophet that he’s known to be was definitely an impressive character arc to say the least. Ramses going from eager prince to a king with a chip on his shoulder was a brilliant arc as well, and the last scene with his son’s death and him calling for Moses at the end was heart-breaking. The animation was great throughout, but particularly in the miracles scenes, as well as whenever “God” showed up. I don’t know if I’m allowed to have issues with the plot, but I did feel that there was a lot of bona fide deus ex machina involved whenever he faced conflict. But given that faith is the main theme of this movie, I guess that’s to be expected.",
    "tmdbId": 10854
  },
  {
    "id": "the-princess-bride-1987",
    "title": "The Princess Bride",
    "releaseDate": "1987-01-01",
    "genres": [
      "Thriller",
      "Comedy",
      "Action"
    ],
    "rating": 8.3,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Fun for kids, entertaining for adults",
    "rewatchability": "As often as you want, it’s only 1h30",
    "bestCharacterWinner": "TBD",
    "review": "Holy quotable lines. I knew that the characters from this movie were iconic before I even watched it, and it was easy to see why. Between Inigo Montoya’s catchphrase and The Dread Pirate’s charm (which almost gave him the win), there’s plenty of comedy in this INCONCEIVABLE movie. The theme and characters are great for kids, and adults would appreciate the fantasy aspect of this fairy-tale-esque story. The chemistry between Inigo and Fezzik was fun, even if Fezzik annoyed me a bit. The Prince and the Count were decent villains, and Buttercup was a strong female character. The whole premise with the plot being a storybook made it a little frustrating every time the kid interrupted, but the grandpa-kid relationship was cute.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Vizzini annoyed me beyond belief, so it was fun to watch him die. Westley and Inigo’s fight and their interactions later were hilarious too. Miracle Max and Valerie were hilarious too, and Inigo’s final fight was a great ending.",
    "tmdbId": 2493
  },
  {
    "id": "the-princess-diaries-2-royal-engagement-2004",
    "title": "The Princess Diaries 2: Royal Engagement",
    "releaseDate": "2004-01-01",
    "genres": [
      "Coming-of-age",
      "Romance",
      "Family"
    ],
    "rating": 6.8,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "School kids, people who enjoy romcoms",
    "rewatchability": "It’s 1h55, maybe a rare one-off rewatch",
    "bestCharacterWinner": "TBD",
    "review": "I’ll watch two hours of funny Anne Hathaway most days. They pretty much make use of most of the charm of the original, and bringing in Nicholas (Chris Pine) did wonders for chemistry, even though his uncle (John Rhys-Davies) was really not the best antagonist. The message and ending wasn’t bad, but the overall plot did seem to revolve a lot around Mia enjoying herself in Genovia as Princess, and rehashing a lot of the same comedy from the first movie. Not bad for fans of the original, but wouldn’t necessarily watch more than once.",
    "reviewDate": "2024-01-15",
    "tmdbId": 11130
  },
  {
    "id": "the-shawshank-redemption-1994",
    "title": "The Shawshank Redemption",
    "releaseDate": "1994-01-01",
    "genres": [
      "Drama",
      "Hollywood"
    ],
    "rating": 9.3,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Adults, mature teens",
    "rewatchability": "It’s 2h20, and it’s kind of a once-in-a-lifetime experience",
    "bestCharacterWinner": "TBD",
    "review": "This is widely touted as the best movie ever made, and I can definitely see the angle that people are coming from. Red’s (Morgan Freeman) narration was always going to be spectacular, but his chemistry with Andy was unreal. They both had such emotional performances that it was easy to want to keep watching. Prison life is awful, that’s no secret, but the story makes use of that tragedy to build such profound hope that it can give you faith in life no matter what you think has happened. Stephen King’s story was incredibly nuanced in the way only a novel can be, and the inclusion of all sorts of worldly practices into the greater metaphor for their struggle makes the movie that much grander - it feels like “no matter how bad you think it is, you’ll be fine.” And there’s definitely a lot of pain in the movie, so it isn’t exactly pleasant always, but you’ll definitely feel reassured after watching. That’s all I have for you.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Whoo! That rain scene! The catharsis was spectacular. I will say, this movie did well in that I didn’t know how it was going to end until it did. And damn, I hated that warden. SO glad that literally every antagonist got screwed over, but also RIP to the fallen heroes. There’s just a real sense of gravity about this movie, and I feel like I need to compare it to Good Will Hunting to explain. So yeah, I feel like I’ll rewatch this every 10 years until I die, and every time it’ll feel different. So until next time, get busy living, or get busy dying.",
    "tmdbId": 278
  },
  {
    "id": "the-shining-1980",
    "title": "The Shining",
    "releaseDate": "1980-01-01",
    "genres": [
      "Horror",
      "Thriller"
    ],
    "rating": 6.4,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Horror fans, Stephen King fans",
    "rewatchability": "It’s 2h, but also the plot is just weird, so probably wouldn’t",
    "bestCharacterWinner": "TBD",
    "review": "Bruh, Kubrick. I swear I can never understand your movies. They straight up don’t make any sense. There were really only 4 characters - Wendy (Shelley Duvall), Danny (Danny Lloyd), and Mr. Hallorann (Scatman Crothers), in addition to Jack, and they were all so polar. Jack was okay in the start, but man got SO weird as it went on - I honestly just got scared looking at Nicholson’s face most of the time. Wendy was a total sweetheart throughout (honestly feel bad for her), the kid was pretty annoying, and Hallorann did nothing. I will say that the score was great, since horror movies do depend on that a lot, and the direction was interesting. Obviously, there’s that iconic scene with the axe, which is great, but most of it is just slowly building up tension until insanity. Lots of suspense, relatively engaging, but it’s quite slow and isn’t really spectacular or emotional. Makes it a bit hard to watch.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "I know it’s based on a book, which I’m sure is great (Stephen King and all), but the plot is pretty basic too. The ending was pretty satisfying, even if I didn’t understand the meaning of the ball dance picture. “The shining” trait that Danny and Hallorann share is pretty cool in theory, but it’s effectively just a sharp noise and a weird expression, which is annoying as hell to watch. The fact that the movie has the n word has aged extremely poorly (even if there was a reason for it, as I understand) and didn’t help its judgement. So yeah, Jack Nicholson is scary, Kubrick is scary, King is scary. Movie is mostly ‘eh’ with iconic bits here and there and a lot of suspense. Let it be known that I’m not a horror fan.",
    "tmdbId": 694
  },
  {
    "id": "the-social-dilemma-2020",
    "title": "The Social Dilemma",
    "releaseDate": "2020-01-01",
    "genres": [
      "Documentary",
      "Drama"
    ],
    "rating": 6.6,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Anyone with a phone",
    "rewatchability": "Wouldn’t, but keep remembering what they’re saying",
    "bestCharacterWinner": "TBD",
    "review": "Straight up scared the life out of me. I was actually so angry in the middle that I had to take a break when the little girl was looking at herself in the mirror. The plot with Ben was okay to prove their point, but the experts really talk really well. Tristan, Tim Kendall, Jaron Lanier, etc. had all seen their algorithms at work and it was obvious that they were talking with great urgency and genuine heart. So yeah I’m definitely going to try to a) remember what they said, and b) find some resistance to getting swept up in all this people-packaging.",
    "reviewDate": "2024-01-15",
    "tmdbId": 656690
  },
  {
    "id": "the-sound-of-music-1965",
    "title": "The Sound of Music",
    "releaseDate": "1965-01-01",
    "genres": [
      "Family",
      "Drama"
    ],
    "rating": 8.7,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Pretty much everyone",
    "rewatchability": "It’s a solid 3 hours long, so maybe once a year",
    "bestCharacterWinner": "TBD",
    "review": "If we were ranking movie soundtracks, this movie would - by all measure of my thought right now - be masterclass captain. Every single song in this movie is more than just iconic, and has shaped pop-culture and the childhood of gen Y and Z in ways that transcend conventional cinema. The plot and acting in the film is pretty phenomenal too, with the Von Trapp Family and Maria (Julie Andrews) serving as solid leads with the Baroness (Eleanor Parker) and Max (Richard Hadyn) acting as decent supporting cast, with the standard all-time antagonists in the form of the nazis. The movie is always wonderful to look at, with the setting choice lending a lot to this, and Liesl (Charmian Carr) too. Lots of good family values, and overall things to admire.",
    "reviewDate": "2024-01-15",
    "tmdbId": 15121
  },
  {
    "id": "the-suicide-squad-2021",
    "title": "The Suicide Squad",
    "releaseDate": "2021-01-01",
    "genres": [
      "Superhero",
      "Comedy"
    ],
    "rating": 7.4,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teens",
    "rewatchability": "Airplanes, maybe",
    "bestCharacterWinner": "TBD",
    "review": "Pretty funny, overall. I think the main cast of the movie were all great: Bloodsport (Idris Elba), Peacemaker (John Cena), Harley Quinn (Margot Robbie), and Ratcatcher II were all really funny, and were utilized to really good effect. Nanaue/King Shark was absolutely hilarious and really precious, and I would honestly give him the win, but Ratcatcher was just as awesome, and Daniela Melchior is really good-looking. Harley’s plot was pretty funny, and I thought the opening scene idea was really great from James Gunn, whose bright colours and interesting text cards make this movie a lot more watchable than the previous suicide squad movie. Weasel (Sylvester Stallone) and Blackguard (Pete Davidson) were also funny. Polkadot Man (David Dastmalchian) and Rick Flag (Joel Kinnaman) were also funny, and I think Gunn figured out how to improve on characters like Flag and Amanda Waller (Viola Davis) to better suit the plot. Pretty funny throughout, would have liked a shorter, more compact story, and the final scene was just insane (in a crazy way). The political subtext was on point.",
    "reviewDate": "2024-01-15",
    "tmdbId": 436969
  },
  {
    "id": "the-terminator-1984",
    "title": "The Terminator",
    "releaseDate": "1984-01-01",
    "genres": [
      "Action",
      "Sci-Fi",
      "Thriller"
    ],
    "rating": 7.7,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Pretty much everyone already knows it, but people who like action movies will enjoy",
    "rewatchability": "Once a week if you want, 1h45",
    "bestCharacterWinner": "TBD",
    "review": "“Come with me if you want to live.” Even if you haven’t seen the movie, you must have heard that somewhere, and that’s honestly the biggest problem with this movie - everyone is too familiar with it. I hadn’t watched the whole thing before, but I already knew all the characters and the basic plot, as well as most of the iconic lines (there are a LOT of these, and they’re still great). I guess that’s saying it was too successful, which is crazy. T-800 (Arnold Schwarzenegger) was obviously the centerpiece of the movie, and even though his delivery was (iconically) robotic, his visual presence was terrifying enough to make him a great antagonist. Reese (Michael Biehn) and Sarah were pretty great protagonists overall, not wasting time or squandering suspense, but also retaining relevant character moments. I guess suspense is the main high point with this movie, in both the plot and the music. It was mostly fast paced, even if the beginning was a little drawn out. The Sci-fi elements are cool (even if I wish they were modernized) and very 80s, so it might seem a little old-fashioned now, but they’re still entertaining stories. I look forward to the sequel.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "The last scene was a great circle to the story, and was arguably one of the stronger scenes overall, with the whole picture and everything. I figured that Reese would be the dad from about halfway through the movie, but the scenes in the future were cool to see, and John Connor’s reputation is even more meaningful since I know we’ll see him in future movies. I was expecting Sarah Connor to be a badass in this one, I’ll admit, so I was wondering why she wasn’t just killing T-800, but her character growth was pretty great overall. Best believe I would definitely have died if I was in her place - and she didn’t even have plot armour, since the movie was pretty grounded. So yeah, Reese was cool too. Overall fun to watch.",
    "tmdbId": 218
  },
  {
    "id": "the-theory-of-everything-2014",
    "title": "The Theory of Everything",
    "releaseDate": "2014-01-01",
    "genres": [
      "Hollywood",
      "Romance"
    ],
    "rating": 8.6,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "All adults",
    "rewatchability": "It’s 2h and extremely heavy, but really beautiful",
    "bestCharacterWinner": "TBD",
    "review": "It’s funny how one of the best love stories of all time is not only real, but is largely unrecognized. And this is a love story - if there’s any doubt, google this movie and see who it’s written by (it’s Jane Hawking). Watching this after Stephen passed away (in real life) made the story bite that much more, and I have the utmost respect for both him and Jane. Eddie Redmayne (is unfairly charming here) and Felicity Jones (an absolute dream) do a great job of portraying them respectively, and both of their acting skills would make any movie worth watching. The music and shooting style really accentuate all the strongest emotional moments and really allow the story to shine. There’s tragedy, comedy, heart, and realism sorted in portions that only reality itself can perfect. And of course, the physics speaks for itself.",
    "reviewDate": "2024-01-15",
    "tmdbId": 266856
  },
  {
    "id": "the-way-of-the-dragon-1972",
    "title": "The Way of the Dragon",
    "releaseDate": "1972-01-01",
    "genres": [
      "Action",
      "Chinese"
    ],
    "rating": 7.0,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like martial arts movies",
    "rewatchability": "It’s mostly action, so at your own pleasure",
    "bestCharacterWinner": "TBD",
    "review": "RIP Bruce Lee. I’ve only just realized how awesome this man was, and I’m glad that there’s so much material that the world can remember him by. This movie isn’t one I’d normally watch, given that it’s in Chinese and feels like it has a lot of latent nationalistic undertones, but as an action movie, there’s no denying that it’s as enjoyable as anything else. Lee’s martial arts are amazing as always, and his interaction with Chin Hua (Nora Miao) - who’s really pretty and does a great job herself - builds most of the movie. You get to see a lot of Rome, which is nice, but the thing that sets this movie aside from most other martial arts movies is the final fight. Bruce Lee vs Chuck Norris (who plays Colt, who’s basically just Chuck Norris) at the Colosseum. If that’s doesn’t make your eyes widen, then this isn’t for you. But as one of the best martial arts fights on screen, it’s definitely a win for authentic action.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Can’t believe Bruce Lee straight up kills Chuck Norris. What a savage. Also the darts are a cool way to battle guns. But I didn’t understand what was up with Lee’s character having to use the washroom every five minutes, that was pretty strange.",
    "tmdbId": 9462
  },
  {
    "id": "the-worst-person-in-the-world-2021",
    "title": "The Worst Person in the World",
    "releaseDate": "2021-01-01",
    "genres": [
      "Romance",
      "Drama"
    ],
    "rating": 8.7,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Anyone above eighteen can probably find something to relate to here",
    "rewatchability": "The movie is built enough around subtext that deciphering it takes some brainpower, so eight or nine months at least",
    "bestCharacterWinner": "TBD",
    "review": "At first glance, It’s a little weird how this movie’s plot never really seems to go anywhere, but I guess the more I think about it the more convinced I become that the lack of a definite conflict worked well with the message it was trying to send. The Worst Person in the World feels less like a story and more like an episodic character study on its protagonist (Renate Reinsve), a young woman fresh out of college trying to find her place in the world. The title is kind of left open to interpretation as well—it’s a bit of a running joke for my friends and me to randomly ask one another, “So, who is the worst person in the world?” Very artsy, very clearly an indie film, and definitely made me want to move to Oslo (did I mention it’s in Norwegian? Well, now you know). If anything, the ending felt a little rushed, and the movie took a lot of time fleshing out its main questions at the expense of actually answering them. Of course, there’s no one way of figuring out your life, but I was hoping to at least come out of the theater with a sense of how Julie came to that realization herself. There’s some pretty funny social commentary as well, so that’s something to look forward to.",
    "reviewDate": "2024-01-15",
    "tmdbId": 776503
  },
  {
    "id": "titanic-1997",
    "title": "Titanic",
    "releaseDate": "1997-01-01",
    "genres": [
      "Romance",
      "Hollywood"
    ],
    "rating": 8.6,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Not kids, but pretty much everyone else should appreciate it",
    "rewatchability": "It’s decently rewatchable, but it’s 3 hours long, so you need some time",
    "bestCharacterWinner": "TBD",
    "review": "This movie deserves all the money it earned; it’s not hard to realize why it made as much as it did - young Leo with a special charm and the grandness of the biggest ship in the world, coupled with an iconic score and beautiful cinematography… they didn’t miss any tricks. Titanic is a sound narrative, with Jack and Rose’s story being my personal Romeo and Juliet equivalent. The dialogue between them is charming, and Jack’s underdog story makes him impossible not to root for. Cal is hilariously easy to dislike, and despite the fact that Kate Winslet’s Rose wasn’t as iconic as Jack, her character arc was charmingly completed and complemented by Jack’s. I’m not a Celine Dion fan, but “My Heart Will Go On” is a classic, and fits this movie to the T. James Cameron has got the blockbuster blueprint pretty well-set, and if this movie could have been about 2 hours instead of 3, it would have definitely made it to at least CC.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "ROSE KILLED JACK. Okay, that aside, it really shouldn’t have taken a full hour for the Titanic to sink. It might have helped the sense of urgency if it had been… urgent. Anyway, Rose throwing the heart of the ocean into the ocean at the end was cool, and the end scene with them back in the titanic was a nice ending.",
    "tmdbId": 597
  },
  {
    "id": "to-all-the-boys-always-and-forever-2021",
    "title": "To All the Boys: Always and Forever",
    "releaseDate": "2021-01-01",
    "genres": [
      "Romance",
      "Coming-of-age",
      "Drama"
    ],
    "rating": 7.0,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Teenagers",
    "rewatchability": "It’s pretty much only applicable to teens, so as many times as you want in your teens",
    "bestCharacterWinner": "TBD",
    "review": "Best one out of the three, if my memory holds true. Easily the one with the best message. Somehow these movies use very real, relatable romantic things that kids do and mesh it well with a totally stylized version of high school in a functional way - that’s what makes everything so attractive to audiences. Lara Jean (Lara Condor) and Peter Kavinsky (Noah Centineo) are perfect representations of the target audience’s high school ideal, and their relationship is well written in terms of dialogue. The plot was super promising upto the second act (which is rare for these kinds of movies) and the New York scenes were all actually the best. Of course, the fact that all the transitions have kpop is a massive plus for me. But the story was straightforward and incredibly believable, and even though I had hoped they had the guts to handle it a little bravely, I think I’m satisfied with the ending. Peter’s dad’s scene at the end was well done, and justified the ending. Graduation scene did make me a little melancholy, not going to lie. Also, supporting cast is awesome, with Trevor (Ross Butler), Margot (Janel Parrish), and Chris (Madeleine Arthur), with Kitty taking home the win for being just the purest little sibling ever. I guess there’s still a little high school left in me.",
    "reviewDate": "2024-01-15",
    "tmdbId": 614409
  },
  {
    "id": "top-gun-1986",
    "title": "Top Gun",
    "releaseDate": "1986-01-01",
    "genres": [
      "Action",
      "Thriller",
      "Drama"
    ],
    "rating": 8.6,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Teens and up",
    "rewatchability": "Can hit hard, but is also awesome, so once a couple months",
    "bestCharacterWinner": "TBD",
    "review": "This is one of the most hype movies ever, not gonna lie. The soundtrack, mixed in with the pure triumph of flying the way Maverick does, is the biggest adrenaline boost in any movie that I can remember. There’s a great overall acting job from the cast: Iceman (Val Kilmer), Goose (Anthony Edwards), Viper (Tom Skerritt), and Charlie (Kelly McGillis) were all perfect in their roles, and had great chemistry with Cruise. The outfits were awesome, and the 80s nuance was really cool to see. Dialogue was hella iconic and quotable, which made the interactions that much better. All the flying around could make you a little dizzy though.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Gahh the Goose death was obviously really sad, and he was pretty awesome. The whole thing with Maverick’s dad was pretty weird, but it was good for explaining his character, I guess. I would have liked to see a little more of Iceman’s actual flying before he won the prize, but I guess that would have taken away from the story. Charlie coming back at the end was cute, and all the random singing scenes slapped lmao.",
    "tmdbId": 744
  },
  {
    "id": "vampires-suck-2010",
    "title": "Vampires Suck",
    "releaseDate": "2010-01-01",
    "genres": [
      "Comedy"
    ],
    "rating": 5.7,
    "classRecommendation": "Guilty Pleasure",
    "intendedAudience": "People who know about Twilight and have watched the movies",
    "rewatchability": "After you watch twilight",
    "bestCharacterWinner": "TBD",
    "review": "This is like an abridged version of Twilight that breaks the fourth wall and pokes fun at all the problems with the story, the acting, and the dialogue in the original movie. Honestly, I thought Becca was better than Bella, and Jenn Priske is really pretty and does an amazing job imitating Kristen Stewart. Edward (Matt Lanter) looked surprisingly similar to Robert Pattinson, and even though I just know him as the voice of Anakin Skywalker in the CW animated series, he was really funny as Edward. Whoever wrote the dialogue is probably a fan of the real series/movies, and the final battle with Daro (Ken Jeong) is hilarious. The whole Team Edward vs Team Jacob bit is funny too, and Jacob (Chris Riggi) is utilized even better in this version. Very good vampire puns.",
    "reviewDate": "2024-01-15",
    "tmdbId": 40264
  },
  {
    "id": "venom-2018",
    "title": "Venom",
    "releaseDate": "2018-01-01",
    "genres": [
      "Action",
      "Thriller",
      "Superhero"
    ],
    "rating": 8.4,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "People who like superhero movies",
    "rewatchability": "2h00, pretty fast paced",
    "bestCharacterWinner": "TBD",
    "review": "Yoooo, I really didn’t expect this to be as good as it was - I have to say, the advertising for this movie really didn’t do it justice. No seriously, this is basically the Sony equivalent of Iron Man - the only thing that sets them apart is RDJ and color. That said, Carlton Drake (Riz Ahmed) was a fantastic villain, and his encounters with Eddie (Tom Hardy) were great. The highlight of the movie for me was when Venom and Eddie started talking to each other - instant gold. Annie (Michelle Williams) was a passable female lead, along with Jenny Slate, whose quirky vibe was good for keeping the start of the movie fresh, and the plot was pretty solid overall. The whole symbiote science system worked really well with the villain’s ideals, and the Venom vs Riot fight at the end was great. Basically, any scene that actually included Venom was fabulous. Definitely worth a watch; I know I’m going to watch the sequel.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "HAHA that kiss scene was actually hilarious. Full props to whoever thought that up. The Carnage setup was cool, and the Spider-Verse snippet was appreciated (even though I saw that before this), even if it didn’t do that movie justice. So I guess Sony just doesn’t know how to market stuff, because obviously ITSV was awesome, and this was great too.",
    "tmdbId": 335983
  },
  {
    "id": "wall-e-2008",
    "title": "WALL-E",
    "releaseDate": "2008-01-01",
    "genres": [
      "Family",
      "Romance",
      "Thriller",
      "Animated"
    ],
    "rating": 8.6,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, teens, adults",
    "rewatchability": "It’s 1h45, starts slow but picks up and doesn’t stop",
    "bestCharacterWinner": "TBD",
    "review": "I don’t know how Pixar do it. Their movies are all so unique in setting and conception, but all still manage to address really important themes - and this might just be their most impressive work. It’s unbelievably hard to make a compelling and entertaining movie when both your main characters actually can’t speak a coherent language (they have pokemon vocabulary), but WALL-E (Ben Burtt) and EVE were two of the most heart-wrenching characters I’ve ever watched, and they barely have faces. Plot, music, situation, all masterfully crafted; characters were iconic and well thought-out - Captain McCrea (Jeff Garlin) was particularly good, but the robots ruled this one. The animation and attention to detail regarding their facial expressions was what made the movie, alongside the sound mixing and effects (them saying each others’ names is just adorable). There’s drama, romance, heart, redemption, and a critique on humanity’s gluttony and environmental indifference; all in all, I’d be happy if kids learned anything at all from this movie.",
    "reviewDate": "2024-01-15",
    "tmdbId": 10681
  },
  {
    "id": "wargames-1983",
    "title": "WarGames",
    "releaseDate": "1983-01-01",
    "genres": [
      "Thriller",
      "Sci-Fi",
      "Coming-of-age"
    ],
    "rating": 7.4,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like 80s movies",
    "rewatchability": "Once a couple years",
    "bestCharacterWinner": "TBD",
    "review": "Yeah, Matthew Broderick is definitely my fav actor. I had to skip past the starting ten-ish minutes of the movie, but as soon as he showed up, it was a lot more fun. All the adults in the movie were pretty boring, except for Stephen Falken (John Wood), who’s pretty weird. Also Ally Sheedy’s Jennifer is cute AS HELL, I think I might be in love. And her chemistry with David was awesome, and her 80s vibe is super attractive for some reason. Obviously there’s a big message here about nuclear war, but “Shall we play a game” still SENDS.",
    "reviewDate": "2024-01-15",
    "tmdbId": 860
  },
  {
    "id": "weathering-with-you-2019",
    "title": "Weathering With You",
    "releaseDate": "2019-01-01",
    "genres": [
      "Coming-of-age",
      "Fantasy",
      "Anime"
    ],
    "rating": 7.9,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "People who like anime movies",
    "rewatchability": "Around 2h, but quite eventful, maybe once a year",
    "bestCharacterWinner": "TBD",
    "review": "I don’t even speak japanese, but the main theme for this movie is stuck in my head. It’s really an interesting story, what with Hina being a ‘sunshine-girl’ and Hodaka’s (Kotaro Daigo) relationship with her. Of course, Shinkai’s animation, music, and inspiration are all unmatched, and the supporting cast were great this time around as well. Keisuke (Shun Oguri) was a welcome change in tone, while Natsumi (Tsubasa Honda) and Nagi (Sakura Kiryu) were great for comedic and heartfelt scenes. Everything to do with the torii gates and the skyworld was breathtaking, and the last act was beautiful as well.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Man, I absolutely FREAKED OUT when I saw Taki and Mitsuha (from Your Name) show up in cameos. Made my day. Taki’s grandmother was a pretty fun character here too, which I appreciate a lot. I guess the movie was great overall, but the consequences for being a fugitive looked like they were super lax, and the movie did seem a little longer than it could have been. Still, the end scene definitely capitalized on most of the movie, and it was all beautiful as always.",
    "tmdbId": 568160
  },
  {
    "id": "weekend-at-bernie-s-1989",
    "title": "Weekend at Bernie’s",
    "releaseDate": "1989-01-01",
    "genres": [
      "Comedy"
    ],
    "rating": 7.9,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Kids, teens",
    "rewatchability": "1h30 and funny, even if the start is a little slow",
    "bestCharacterWinner": "TBD",
    "review": "These years just brought out the most hilarious movies. This movie is just a genuine comedy buddy movie, with Larry and Richard (Jonathan Silverman) just messing around for an hour and a half, and it’s HILARIOUS. Sure, it starts a little slow, but once they get to the island it’s absolutely hilarious. The plot is surprisingly comprehensive for a comedy, and the physical comedy of Bernie (Terry Kiser) and Paulie (Don Calfa) is a really good complement to Larry’s confident and Richard’s docile comedy. Gwen (Catherine Mary Stewart) and Tina (Catherine Parks) were both pretty funny, but the only real characters in the movie were Larry and Richard, and the movie works great centered around those two. I feel like it would be hilarious to watch with friends.",
    "reviewDate": "2024-01-15",
    "tmdbId": 8491
  },
  {
    "id": "west-side-story-2022",
    "title": "West Side Story",
    "releaseDate": "2022-01-01",
    "genres": [
      "Hollywood",
      "Drama",
      "Musical"
    ],
    "rating": 7.4,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Fans of musicals",
    "rewatchability": "2h, pretty classic",
    "bestCharacterWinner": "TBD",
    "review": "Not bad. I liked Maria (Rachel Zegler) and Tony’s (Ansel Elgort) chemistry, but Tony’s chemistry was even better with Riff (Mike Faist). Really nice songs, especially “America”, and it’s also like totally ripped off of Romeo and Juliet. Like completely. Bernardo (David Alvarez) looks perfectly cast and acts really well, and Anita is really strong and captivating on screen. Overall really great to watch.",
    "reviewDate": "2024-01-15",
    "tmdbId": 511809
  },
  {
    "id": "wonder-woman-1984-2020",
    "title": "Wonder Woman 1984",
    "releaseDate": "2020-01-01",
    "genres": [
      "Superhero",
      "Drama",
      "Hollywood"
    ],
    "rating": 7.2,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "Probably teens and up",
    "rewatchability": "2h30, feels pretty long",
    "bestCharacterWinner": "TBD",
    "review": "Man, there was a LOT of stuff in this movie; it straight up tried to be Infinity War. The beginning was promising, if a little slower than I would have liked, and Barbara is a hilarious and relatable character from the get-go, whose motivations and actions are completely understandable. Diana (Gal Gadot) is quaint and charming as usual, and her introduction isn’t bad either. The movie has a real classic feeling to it, with bright colours and over-the-top action scenes - it reminds me of the original Superman movies. Anyway, Maxwell Lord (Pedro Pascal) is also a fair villain in terms of being compelling, even if his plan seems to be a little foggy. Steve Trevor (Chris Pine) also returns for a sweet, fish-out-of-water storyline and some good romantic scenes. The movie does seem a little bloated in that sense, and I think it tries to do way too much. There’s themes of strong vs weak, assault, greed, war, and it’s a period piece (the costumes are GREAT by the way). Most callbacks are great, and Patty Jenkins manages to avoid the sillier aspects of the comics, but as a movie, the story will likely tire you out by the end.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "First up, that post-credits scene was a banger - Linda Carter I was definitely not expecting, so kudos. Now, the story. The final scene left the potential for SO many plotholes (what if some people didn’t renounce their wish?). There were so many moving parts, what with the oil plot, Alastair being a thing, Diana and Steve, Diana randomly wanting to fly, Barbara, the “Truth vs Lies” motif that tried to justify the MacGuffin, and the giant metal suit (that for some reason didn’t get electrocuted?). Just confusing. The scene where the world is dying and Diana is flying is so strange as well. Also how does she talk to the whole world without a camera? It’s just confusing. Anyway, the part with her losing her powers and then giving up Steve to get them back and save everyone is cool. That should have been the main story. Also I kinda expected Max to die at the beginning when he wished to be a wish stone (doesn’t sound like a very responsible wish). And also the first scene was cute, but I don’t really know where it fits in.",
    "tmdbId": 464052
  },
  {
    "id": "yesterday-2019",
    "title": "Yesterday",
    "releaseDate": "2019-01-01",
    "genres": [
      "Hollywood"
    ],
    "rating": 7.6,
    "classRecommendation": "Worth Your Time",
    "intendedAudience": "People who like the Beatles, people who don’t know the Beatles",
    "rewatchability": "About 2h00, but full of Beatles songs, so you could watch it every day",
    "bestCharacterWinner": "TBD",
    "review": "HEY JUDE. DON’T MAKE IT BAD. Man I love the Beatles. Just for having Beatles songs, this movie is like ultimately rewatchable. Ellie and Jack (Himesh Patel) had a really cute story, and it seemed really real. Ed Sheeran was great as himself, and the comedy in this movie was totally there. The scene with the three Beatles-rememberers geeking out over the songs; the yellow submarine, etc. hit soooo hard. Honestly what legends. And then obviously THE SCENE with THE LEGEND. Our man John Lennon (Robert Calysle) pulled up to complete Jack’s arc, and it was great. Then the last scene was wonderful, and I think that it was the only acceptable ending to this movie. Still the Let It Be scene was hilarious, and Deborah (Kate McKinnon) was pretty funny too. Overall it was really heart-warming, and I can only imagine how much nostalgia it must have caused for long-time Beatles fans.",
    "reviewDate": "2024-01-15",
    "tmdbId": 515195
  },
  {
    "id": "your-name-2016",
    "title": "Your Name",
    "releaseDate": "2016-01-01",
    "genres": [
      "Drama",
      "Romance",
      "Coming-of-age",
      "Anime"
    ],
    "rating": 9.8,
    "classRecommendation": "Must Watch",
    "intendedAudience": "Teens NEED to watch this",
    "rewatchability": "Bro I could watch this every day",
    "bestCharacterWinner": "TBD",
    "review": "My heart. Hurts. So much. Right now. You don’t understand. This movie brought out more emotions in me than my actual life did. I swear animation is just on another level - Studio Ghibli-esque. Apparently it’s the highest grossing anime movie ever, and it completely freaking deserves it. Since Mitsuha and Taki switch bodies and are joint protagonists, it’s only right to have them both win together. When you look up chemistry in the dictionary, pictures of these two come up. Straight up. Whoever wrote the plot needs a medal, too. Shit, I’ll give you the medal myself. The amount of TENSION is unheard of. But it’s also SO easy to watch - there’s comedy, there’s relatability, and the classic coming-of-age heart. The supporting characters are really well built-up also, never forgotten or misplaced. The animation itself is BREATHTAKING, the music is wonderful (very anime-like) and there’s just this wonderful childhood nuance that’s captured in the spirit of this movie that’s unheard of. This one’s for the ages.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Bruh. I’ll admit it. That whole “the village was destroyed 3 years in the past” thing got me. I spent a solid 20 minutes being like “Bring her back to life. Now.” I really couldn’t deal with her being dead. And the scene where they finally meet on the edge of the crater… massive feels. The “I love you” on her hand was brilliant too. And of course at the end “What’s your name?” That was solid as can be, even if I really really wanted to see them actually remember who they were. Also damn how awesome were Mitsuha’s friends? Real MVPs just went along with her crazy vision - absolute goals. And Taki’s friends took him to the village? I swear they’re actually the best. Finally the kuchikamisake was the holy grail of the movie - that’s what made it all work, and you could really feel the love. Also the half-night stuff was great. I swear there’s just so many little things that make this movie amazing, but even if you just watch it to watch it, there’s hardly anything better. Masterclass. Broke my entire heart.",
    "tmdbId": 372058
  },
  {
    "id": "zack-snyder-s-justice-league-2021",
    "title": "Zack Snyder’s Justice League",
    "releaseDate": "2021-01-01",
    "genres": [
      "Superhero",
      "Action"
    ],
    "rating": 7.6,
    "classRecommendation": "Highly Recommended",
    "intendedAudience": "Superhero movie fans",
    "rewatchability": "Once in a couple months, even though it’s 4h",
    "bestCharacterWinner": "TBD",
    "review": "Wow, so much better than the theatrical version. Steppenwolf (Ciaran Hinds) is an actual character with motivations and a face, and the wealth of riches of the DC universe isn’t squandered one bit. The story was well-paced (the “parts” made it a little episodic, but I guess that makes arranging a 4h movie easier) and all members of the Justice League were set up with defining characteristics and motivations that helped decide their actions later in the movie. Wonder Woman (Gal Gadot) was a mature leader, Batman (Ben Affleck) was a responsible protagonist, Aquaman (Jason Momoa) towed the line between uncaring and heroic very well, while Flash (Ezra Miller) was comedic and compelling at the same time. Cyborg was by far the most improved performer this time around, with his arc and relationship with his father (Joe Morton) basically acting as the framework for the movie. His backstory, abilities, and emotional journey was much better explained here. Darkseid (Ray Porter) and DaSaad (Peter Guiness) had just the right amount of ominous energy, with reverence from Steppenwolf, and the parademons didn’t have too much of the spotlight. The score was great (Wonder Woman’s Amazon theme was iconic) and the tone was a lot more streamlined.",
    "reviewDate": "2024-01-15",
    "spoilerReview": "Okay. Lots here. The superman revival plot device was so much better set up with that conversation of the burned-down house, which was awesome. And Lex Luthor being shown in that opening scene was helpful too. The focus on Lois Lane (Amy Adams) paid off well, even if most of the superman scenes weren’t that great - I think the one thing I liked about the original better was superman’s role in the finale. That said, Martian Manhunter’s (Harry Lenix) role here was really quite interesting, in the same way that Nick Fury showed up in Iron Man. The dream sequence at the end was pure genius, and would have built up SO much hype for the sequel if we didn’t already know there wasn’t going to be one. Wonderful storytelling, and I’m glad that the Joker (Jared Leto) could redeem himself with this performance. As always, Alfred (Jeremy Irons) was perfect, Martha (Diane Lane) wasn’t bad, Vulko (Willem Dafoe) was a bit random, and Mera (Amber Heard) had a strange British accent here. Ryan Choi (Kai Zheng) was a nice easter egg, even if I was surprised they didn’t work in a Green Lantern somewhere. Either way, definitely a great showing. The Unity was an awesome idea, and the Anti-Life sounds like it would be a great arc in the future. Kudos to Snyder, and I’m glad we got to see his original vision.",
    "tmdbId": 791373
  },
  {
    "id": "zombieland-2008",
    "title": "Zombieland",
    "releaseDate": "2008-01-01",
    "genres": [
      "Action",
      "Comedy",
      "Horror"
    ],
    "rating": 6.7,
    "classRecommendation": "Casual Viewing",
    "intendedAudience": "Teens",
    "rewatchability": "It’s only 1h30, and pretty action-packed",
    "bestCharacterWinner": "TBD",
    "review": "So yeah, basically funny real-life Call of Duty zombies. Not a bad idea. Columbus is a pretty decent protagonist (Eisenberg is interesting and gives off Michael Cera vibes) and has a decent supporting cast of Emma Stone (who’s awesome here too), Woody Harrselson, and Abigail Breslin. All good. The action is definitely there, and Bill Hurray makes a cameo (which I don’t really get). It’s entertaining, for sure, in a basic popcorn flick kinda way.",
    "reviewDate": "2024-01-15",
    "tmdbId": 19908
  }
]